{
    "intents": [
      {
        "tag": "greeting",
        "patterns": [
          "Hi",
          "Hey",
          "How are you",
          "Is anyone there?",
          "Hello",
          "Good day",
          "What's up"
        ],
        "responses": [
          "Hey :-)",
          "Hello, thanks for visiting",
          "Hi there, what can I do for you?",
          "Hi there, how can I help?"
        ],
        "context_set": [
          "hiii"
        ]
      },
      {

        "tag": "Vision",
        "patterns": [
          "Vision",
          "give me vision of BIET College",
          "what is the vision of clg",
          "What is the vision of Bapuji Institute of engineering",
          "Could you tell me about the vision of the BIET College?",
          "What goals does the BIET clg aim to achieve?",
          "Can you provide insights into the future aspirations of the BIET program?",
          "Tell me the long-term objectives of BIET college",
          "What are the ambitions of the BIET college"
],
        "responses": [
          "To be the center of excellence, recognized internationally so that the trained students can fit into the international requirements and become valuable assets to the society."
        ]
        
      },
      {

        "tag": "Mission",
        "patterns": [
          "Mission",
          "give me mission of BIET College",
          "what is the mission of clg",
          "What is the mission of Bapuji Institute of engineering",
          "Could you tell me about the mission of the BIET College?"
],
        "responses": [
          "BIET contributes to the growth and development of its students by imparting a broad based engineering education and empowering them to be successful in their chosen field by inculcating in them positive approach, leadership qualities and ethical values"
        ]
        
      },
      {

        "tag": "ECE Vision",
        "patterns": [
          "give me vision of ECE",
          "what is the vision of ece",
          "What is the vision of Electronics & Communication Engineering?",
          "Could you tell me about the vision of the ECE department?",
          "What goals does the Electronics & Communication Engineering department aim to achieve?",
          "Can you provide insights into the future aspirations of the ECE program?",
          "Tell me the long-term objectives of Electronics & Communication Engineering.",
          "What are the ambitions of the ECE field?"
],
        "responses": [
          "To be in the forefront in providing quality technical education and research in Electronics & Communication Engineering to produce skilled professionals to cater to the challenges of the society."
        ]
        
      },{
        "tag": "ECE Lecturers",
        "patterns": [
          "ece lecturers",
          "give lecturers name working in ece department",
          "ece department lecturers","Who are the lecturers in the ECE department?","lecturers in the Electronics & Communication Engineering department?",
          "Can you list the faculty members of the ECE department?",
          "Tell me about the professors teaching in the ECE department.",
          "I'd like to know the names of lecturers in the ECE department."
        ],
        "responses": [
         "Dr. G S Sunitha Professor,<br>Prof. Ashalatha M E Professor and PG Coordinator<br>Dr. Leela G.H Professor<br>Dr. Nirmala S O Professor<br>Dr. Avinash K.G Associate Professor<br>Dr. Prakash K. M Associate Professor<br>Dr. Kiran Kumar G. H Associate Professor<br>Mrs. Suma K. G Assistant Professor<br>Mrs. Savithri G. R Assistant Professor<br>Mrs. Radhika Priya Y.R Assistant Professor  <br>    Dr. Banumathi K. L Assistant Professor<br>MRs. Bhagya Shanthkumar Assistant Professor<br>Mr. Ali I. K. Assistant Professor<br>Dr. Pavan Kumar D Assistant Professor<br>Mrs. Shwetha S Assistant Professor (PG Course)<br>Mr. Mahendrachari Lecturer<br>Dr. Shubha V. Patil Assistant Professor<br>Mrs. Poornima G. N Assistant Professor<br>Mrs. Suman B.S Assistant Professor<br>Mr. Yogesha K O Assistant Professor<br>Mrs. Vanishree H V Assistant Professor<br>Mr. Mahantesh H Assistant Professor"
        ]
      },
      {
        "tag": "ece peos",
        "patterns": [
          "PEOs",
          "what are the program educational objectives",
          "what are the PEOs of ece "
        ],
        "responses": [
          "The Engineering graduates will be able to <br>1. Demonstrate the knowledge in electronics and IT industry for successful professional career.<br> 2. Pursue higher education and to engage in research for professional development.<br> 3. Contribute to the societal needs with constitutional and ethical principles and demonstrate quality of lifelong learning."
        ]
      },
      {
        "tag": "ece psos",
        "patterns": [
          "PSOs",
          "what are the program specific outcomes",
          "what are the PSOs of ece "
        ],
        "responses": [
          "At the end of BE Electronics and Communication Engineering Program, Students are expected to have developed the following program specific outcomes<br> 1. Specify, design, build and test Analog, digital and Embedded systems.<br>2. Understand and architect wired and wireless analog and digital communication systems as per specifications and determine their performance."
        ]
      },{
        "tag": "Cultural events",
        "patterns": [
          "Cultural events","Which are the cultural events",
          "Davana Fest"
        ],
        "responses": [
          "Davana Fest<br>Ethnic Day<br>Branch Fests<br>Farewells<br>Freshers Day"
        ]
      },
      {
    
        "tag": "ece about",
        "patterns": [
          "about",
          "give me about ece",
          "information about ece"
        ],
        "responses": [
          "Department of Electronics & Communication Engineering was established in the year 1979 with a vision to promote and maintain academic and professional excellence in technical education and research field. The department has well qualified, self-motivated, experienced and committed teaching talent whose main focus is on the Teaching- Learning with the right balance in research. Presently department has five doctorates and seven faculties who have registered for their PhD program are at different phases. The Institute is accredited by NAAC in 2017 with A Grade and NBAin 2021 for three years(2021-2024). Since its inception, student intake for E&CE branch has gradually raised from 30 to 120. The pass percentage of final year students is above 95% consistently. The department has to its credit a total of 35 ranks under Mysore/ Kuvempu/ Visvesvaraya Technological University.Department has adequate infrastructure. The laboratory facilities include sufficient number of personal computers with LAN connectivity, internet facility and state-of-the-art software packages and hardware worth approximately Two Crores and are regularly upgraded. Department is equipped with overhead projector, LCD projectors for lecture delivery, seminars and demonstration purpose in addition to ICT enabled classroom.In addition to Central Library, Departmental Library has 3358 volumes with 515 titles, which includes academic and competitive related books that can be accessed by faculty and students.Five sponsored projects have been executed by the department under TAPTEC & MODROB of AICTE, New Delhi.The Karnataka State Council for Science & Technology (KSCST), Bangalore, has sponsored 138 projects from Department of E&CE of which 37 projects have been selected for State Level Project Exhibition and Seminar. Four times the department has won Best Project of the Year award, instituted by KSCST, Bangalore. Every year two to three projects are selected by KSCST. Consecutively for three years 2016 to 2018 final year projects have received BEST Project award from ISTE. Proindo Keys, an On-going project under New Age Incubation Network (NAIN) is sanctioned with an amount of Rs.170000/- .MOU has been signed with companies like Whizchip Design Technologies Pvt. Ltd, Test & Verification Solutions, VI Solutions, Fiabilite Network Solutions Pvt. Ltd, Bangalore and Vidvath Technologies Pvt. Ltd, Davangere.Under Continuing Education Programme (CEP), few of the faculty members have submitted their course materials. The faculties are actively involved in research activities and have presented/published technical papers in various National & International Journals/Conferences. To keep updated with current technologies FDP/Workshop/Seminars are regularly organized in association with industries. Faculty interact with other institutions for delivering expert lectures, as resource person for workshop and Chairing sessions in Conferences. In-house Value Added Training programs will be organized by faculty for the students. Department has the credit of organizing First National Conference on Recent Advances in Electronics and Communication Engineering NCRAECE-17 on 13th October 2017. Faculty are member to professional bodies like ISTE, IETE & IE.The students are not only encouraged to excel in their academics but continuously motivated and encouraged to involve themselves in various co-curricular and extra- curricular activities. This is achieved through EC Forum by organizing various technical seminars, workshops and invited lectures exclusively for the students by renowned persons from industry, academics and R&D centers. This helps the students to be exposed to the emerging and state-of-the art technological developments in EC arena. EC forum provides an excellent platform for students to exhibit their talent during E-Utsav, a Technical cum Cultural fest held every year and other such events. A State Level Paper Presentation Event-PAPYRUS is organized under the forum since 2015."
        ]
        
      }, {
        "tag": "ece hod",
        "patterns": [
          "ece HOD",
          "give me ece hods profile",
          "what is the qualification of ece hod"
        ],
        "responses": [
          "Dr. G.S. Sunitha<br>Prof. G.S. Sunitha received her BE degree from the department of Electronics & Communication Engineering from Government B D T College of Engineering (University of Mysore), Davangere in 1990.She started her career as Lecturer at Bapuji Institute of Engineering and Technology. She persued her Masters degree in Digital Electronics & Advanced Communication from Karnataka Regional Engineering College (Mangalore University), Surathakal in 1996.After completion of PG she continued her services at BIET. She was promoted as senior Lecturer in 2005 and then as Assistant professor in 2008. She received her Doctral degree from University B D T College of Engineering (Kuvempu University), Davangere in 2011. She was promoted as Professor in 2011 and now Heading the department since 2013 and has 31 years of experience. Presently she is Guiding four PhD Scholars in the area of Information Theory & Coding, Hardware Description Language, Digital Signal Processing and Computer Networking. She has the credit of presenting/Publishing papers in National Conferences and International Conferences /Journals. She has authored a course material titled 'Digital Telephony' and 'Error control Coding' for AICTE, New Delhi.She has to her credit of organizing First National Conference on Recent Advances in Electronics and Communication Engineering NCRAECEC-17 on 13th October 2017 and organized FDP/workshops and Seminars for faculty members and students in the thrust areas. She was a Chair person for number of International Conferences. She was nominated as LIC Member of VTU for a period of TWO years. She was a member of BOE for VTU for the year 2017-18 and MCE, Hassan in 2016-17. She has the experience as Board of Examiner for UG and PG studies of Kuvempu University and Davangere University. She was the chair person for BSc Electronics for Davangere University for Two Academic Years. She has worked as resource person for Indira Gandhi National Open University study center, Bapuji Hi-Tech College for BCA, Facilitator for Infosys Initiated Campus connect program. She has delivered the lectures in Short Term Training Programs organized under ISTE Chapter and Workshops. She has attended seminars, workshops and short term training programme. She is a Life member of ISTE, FIETE & FIE."
           ]
      },
      {
        "tag": "ece infrastrucure",
        "patterns": [
          "infrastructure of ece",
          "how many classes are available in ece",
          "in which room ece students should sit"
        ],
        "responses": [
           " There are six class rooms in the Department with average carpet area of 100sqm. Each classroom is having an average of 20 desks, 7 fans, 8 tube lights, a blackboard with sufficient ventilation. One class room is equipped with Lecture Capturing System (LCS) with projector. Theory classes engaged in the LCS class room will be recorded and the video will be shared with students. Department has one seminar hall named ARYABHATA which is having sitting capacity of 300 students. The seminar hall is used for various activities like forum functions, technical talk, online sessions etc<br>the classroom no include A254 , A354 , A251, A249, A134."
        ]
      },
      {
        "tag": "ece library",
        "patterns": [
          "department library of electronics and communication engineering",
          "department library of ece",
          "how is the department library of ece."
        ],
        "responses": [
           " The library at department level is for the Students and Faculty of Electronics and Communication Engineering which homes good number of textbooks, reference book. At present over 3072 volumes with 520 titles,30 Competitive exam books, project reports, seminar reports & CD'S are available in the Department library. Sources of information for competitive exam, IETE Technical Review and IETE Journal of Research, catalogues of textbooks & products are kept for student's reference. Apart from the departmental library facility we have Central Library and Information Center. At Central Library, along with the standard books we have the facility of accessing various International & National Journals. CDs of all online classes taken during COVID-19 lockdown period are also available in the library."
        ]
      },
      {
        "tag": "ece placements",
        "patterns": [
          "department placements of ece","ec Placements",
          "total placements in the department of ece",
          "how are placements in department of ece.","total placements in the department of ec",
          "how are placements in department of ec.",
          "What are the placement statistics for Electronics and communication department?"
        ],
        "responses": [
           "2023-24 total no of companies visited is 11 and total number of students hired is 10 and highest package is 12.<br>2022-23 total no of companies visited is 10 and total number of students hired is 55 and highest package is 10.<br>2021-22 total no of companies visited is 26 and total number of students hired is 90 and highest package is 7.<br>2020-21 total no of companies visited is 22 and total number of students hired is 45 and highest package is 7.<br>2019-20 total no of companies visited is 13 and total number of students hired is 46 and highest package is 10.<br>2017-18 total no of companies visited is 10 and total number of students hired is 52 and highest package is 8."
        ]
      },
      {
        "tag": "ece faculty achievements",
        "patterns": [
          " ece faculty acheivements",
          "give me ece acheivements of lecturers",
          "staff ece acheivements in detail"
        ],
        "responses": [
          "Dr.Avinash K.G,Assistant Professor,has been awarded Ph.D. for the thesis titled 'Compact Single and Dual Band Microstrip Bandpass Filters with Transmission Zeros Using Dual-Mode and DGS Resonators' under VIT University,<br>Dr.G.S Sunitha,Prof. & Head,received her Doctral degree from University B D T College of Engineering (Kuvempu University), Davangere in 2011, LIC member during 2017-2018 & 2018-2019 and Member of Board of Examiners of EC/TE (Composite) Board of VTU, Belagavi for the academic period 2017-2018,<br>Dr.Leela G.H Associate Professor,has been awarded Ph.D for the thesis titled 'Design and development of FPGA based Cryptoprocessor for Circumventing Polymorphic Worms' under Shivaji University,<br>13 faculties have cleared different NPTEL courses during AY 2022-23, <br>Dr. Kiran Kumr G H, Assistant Professor, has been awarded Ph.D. by VTU, Belagavi, Karnataka Thesis title: Design and Development of Optimized Compressive Sensing Algorithms for WBAN,<br>Dr. Prakash K M, Assistant Professor, has been awarded Ph.D. by VTU, Belagavi, Karnataka Thesis title: Polar Codes for Low Complexity Encoder and Decoder and Their Performance Analysis,<br>Dr. Banumathi K L, Assistant Professor, has been awarded Ph.D. by VTU, Belagavi, Karnataka Thesis title: Novel Techniques for Offline Handwritten Script and Language Identification,<br>Dr. Ganesh K, Assistant Professor, has been awarded Ph.D. by VTU, Belagavi, Karnataka Thesis title: An Approach of Video Quality Analysis for Video Processing System,<br>Dr. B M Jayadeveppa, Professor has been awarded Ph.D. by VTU, Belagavi, Karnataka Thesis title: Design and Development of Wearable photoplethysmograph for the quantitative Assessment of Cardiovascular & Respiratory Ailments,<br>Dr.Nirmala S.O,Associate Professor,has been awarded Ph.D for the thesis titled 'Design and Development of FPGA based Digital Signal Processing for Image Processing' under Shivaji University,<br>Dr. Shubha V. Patel, Assistant Professor, has been awarded Ph.D. by VTU, Belagavi, Karnataka Thesis title: Analysis of Muscular Paralysis using Bio Signals."
        ]
      },
      {
        "tag": "ece student achievements",
        "patterns": [
          "student achievements of electonics communication and engineering",
          "student achievements of ece",
          "achievements of students of ece"
        ],
        "responses": [
          "Darshan A Hadadi secured X rank in VTU examination during the academic year 2018-19.<br>Students of 4 Sem paticipated in Android App Development, Pravega 20 organized by IISc, Bangalore. Sakshi J. Sethia secured Student Talent award <br>Paridhi Shekhar Keshri paticipated in 2020 Statewide Engineering IT Quiz organized by Board for IT Education Standards(BITES) and Tata Consultancy Services.<br>Shivakumar D, Gajanan Wali participated in NIT Kozhikode National Award 2018 Project entitled 'Embedded Solution for Military Fraticide Crisis' organized by 21st ISTE Students National Annual Convention, L.D. College of Engineering, Ahmedabad, Gujarat on 29th & 30th January 2019.<br>Bandaru Kamal P and team actively participated in Smart India Hackathon 2019-Non Stop 36 Hour Coding Event (A Robust Algorithm for Secure Communication Manager) organized by PSIT, Kanpur on 2nd & 3rd March 2019.<br>Nitesh Gupta Chebrolu and team actively participated in 'Technie'19 National Level Technical fest- BUG D-code' organized by JIT, Davangere on 15th & 16th March 2019.<br>Shreeraksha R K secured 1st Prize in TECHNOCRAT-2K19 Paper Presentation (E-waste Environment Problems & Current Management) organized by UBDTCE, Davangere on 25th & 26th March 2019.<br>Harsha N M, Abdul Adil, Swathi K S secured 3rd Prize in 'Intercollegiate Debate Contest 2019' organized by State Bank of India on 31st October 2019.<br>Shreeraksha R K participated in 20th VTU Youth Festival 'INSIGNIA' organized by SDM College of Engineering & Technology from 6th to 9th November 2019.<br> Anuradha Bharat Kolekar participated in DST & Texas Instruments India Innovation Challenge Design Contest 2019 organized by AICTE, NSRCEL on 20th March 2019.<br>Namma Ethnic - 2018 Winners for presenting theme Navarathri Special<br>Harsha N secured V rank in VTU examination during the academic year 2007-08.<br>Kallimattada Mamatha secured IV rank in VTU examination during the academic year 2011-12.<br>Chandrakantha N G secured VII rank in VTU examination during the academic year 2006-07.<br>9 students have cleared different NPTEL courses during AY 2022-2023<br>Aishwarya K M secured X RANK in VTU for the academic year 2019-20.<br>Mr. Prajwal Y Shirageri secured 6th rank with CGPA: 9.58 in E&CE under VTU, Belagavi for the AY 2022-2023 Aarded with, Padmabhushan Dr. M C Modi Merit Prize Prof. G S Shivanna Merit Prize for Best Outgoing Student Akash Yogeshwar Merit Prize<br>Project titled......... Hot Beverage Vending Machine .....Projectmates: Mr. Rakshith Gouda Patil, Ms. Sanmathi S. Satabhai, Mr. Rohan A M and Mr. Mallikarjun M Koppad under the guidence of Dr. G S Sunitha, HoD, ECE got best project of the year award during 46th series KSCST state level student project programme-seminar and project exhibition on 11th and 12th Aug 2023 organized by Alva's Institute of Engineering and Technology, Moodubidire<br>Kum. Anushree B N , outgoing student of 2023 batch has been awarded with BE honours degree from VTU, Belagavi. Anushree is the first proud student of BIET awarded with BE honours degree.<br>Rishi Kethu Chand, Bhoomika N, SriLakshmi, students from dept of E&CE out of 6 students team from BIET participated in the Smart India Hackathon 2022 and Won 1st Prize with cash award of Rupees 1Lakh . The event was conducted at SAGE University, Indore, MP, India"
        ]
      },
      {
        "tag": "ece activities",
        "patterns": [
          "Activities of electronics and communication engineering",
          "activities of ece",
          "do  ece branch participate in activities."
        ],
        "responses": [
           " Orientation program- Welcome to freshers and their parents meet.<br>ISTE BIET Chapter was inagurated on 22nd October 2019, Dr. G.S. Sunitha, Prof. & Head, was member of the organizing committee.<br>Sri. Praveen G.S., Assistant Professor, Polytechnic College, Hosadurga, delivered a technical talk and demonstrated on 'Automation of IOT' on 21st October 2019.<br>Sri. Arun Kumar H.H., Design Engineer, Bharat Electronics Limited, Banglore, an Alumni of 2009 batch, E&CE department, delivered a technical talk on 'Drones, Tethered Drones and Anti-Drone Technologies' on 12th April 2019.<br>Two days Workshop on 'Mobile Making' was organized on 19th and 20th March 2019. Sri. Shubham Raut, Sr. Design Engineer, ITG, IIT, Mumbai was the resource person.<br> A session on 'Heart fullness Meditation' was conducted by Dr. Siddeshwaran, MDS, College of Dental Sciences, Davangere, from 5th to 7th March 2019 under IETE forum. The event co-ordinator was Smt. Nirmala S.O., Assistant Professor.<br> The Students of VII sem actively participated in 5 days hands-on workshop on 'DSP Applications using MATLAB & DSP Processor' in association with Abeyaantrix softlab,Davangere from 21st to 25th Oct 2019.<br>A Value-added training program on 'Object oriented programming using C++' was organized from 6th to 11th Nov 2019 for V and VII Sem students.<br>Students of VII sem actively partcipated in Webinar on 'Cloud Based Application Software Development'<br>Alumni Meet - EC Milana Virtual Meet 2013-2017 & 2014-2018 Batch<br>Technical Idea Presentation event to students on 'Give a Hand to Society'<br> Five days Value Added Training Programme on Object Oriented Programming Using C++ conducted from 6-11-2019 to 10-11-2019 delivered by Dr.Leela.G.H, Assot. Prof, E&CE Dept. BIET,Davangere, Smt.Nirmala.G, Asst Prof., E&CE Dept. BIET,Davangere.<br>One day Workshop on Awareness Programme-Assistive Health Technology and Role of Engineers conducted on 6-11-2019 delivered Dr.Gnanavel, Director In-Charge, Composite Regional Centre, Davangere.By Mrs. Sucharitha S D Organized Under Faculty Activity<br> Chief Guest: Mr.Siddesh H M R (Alumni)Sr. Director, Engineering, Qualcomm Organized by, Dr. K.G. Avinash & Nirmala G<br>Introduction to Microstrip FPGA in Association with Technomic Components Pvt.Ltd.,Bangalore,ISTE,BIET Chapter and IETE,Shivamogga Center<br>An exhibition of innovative and socially releavant projects organised by BIET, Davangere<br> Virtual Project Exhibitions 2021 on 13th August 2021<br>Orientation and Parents Meet arranged for 3rd Semester students<br> The talk on 'Preparation for Competitive Exam' was delivered by Mirza Quadir, Indian Railway Traffic Service, Ministry of Railways, Govt. of India.<br> Talk on 'Introduction to Embedded System' was delivered by Mr. Siddana Gowda G.N, Staff Engineer Flash Products Group, Western Digital, Sandisk, Bengaluru<br> Talk on 'Introduction to MEMS Sensor' was delivered by Dr.Nitin S Kale<br>One Week AICTE-ISTE sponsored online Induction/ Refresher Programme On Electronic Assistive Devices (7th to 13rd January 2022)<br> Two day workshop for 3rd semester students..  "
        ]
      },
      {
        "tag": "ece numberof lecturers",
        "patterns": [
          " total no of lecturers",
          "total teaching staff in ece "
         
        ],
        "responses": [
          "22."
        ]
      },
      {
        "tag": "ece labs",
        "patterns": [
          " total no of labs in electronics and communication department",
          "total labs in ece "
         
        ],
        "responses": [
          "6"
        ]
      },
      {
        "tag": "CSE vision",
        "patterns": ["what is the vision of CSE","Can you tell me about the vision of the CSE department?","what is the vision of Computer Science and Engineering?",
        "What are the long-term goals of Computer Science and Engineering?",
        "Could you provide insights into the future aspirations of the CSE program?",
        "What is the vision of CSE department?",
        "Tell me the vision statement for Computer Science and Engineering.",
        "What goals does the CSE department aim to achieve?"],
        "responses": ["To be a centre-of-excellence by imbibing state-of-the-art technology in the field of Computer Science and Engineering, thereby enabling students to excel professionally and be ethical."]
      },
    {
        "tag": "CSE Mission",
        "patterns": ["CSE Mission","what is the Mission of cse","Can you tell me about the mission of the CSE department?","what is the Mission of Computer Science and Engineering?",
        "What are the goals of Computer Science and Engineering?",
        "Could you provide insights into the objectives of the CSE program?",
        "Describe the mission statement of the Computer Science and Engineering department.",
        "What is the focus of the CSE department?",
        "Tell me the mission statement for Computer Science and Engineering."
        ],
        "responses": ["1.Adapting best teaching and learning techniques that cultivates Questioning and Reasoning culture among the students.<br>2.Creating collaborative learning environment that ignites the critical thinking in students and leading to the innovation.<br>3.Establishing Industry Institute relationship to bridge the skill gap and make them industry ready and relevant.<br>4.Mentoring students to be socially responsible by inculcating ethical and moral values."]
      },
    {
        "tag": "CSE PEOs",
        "patterns": ["CSE Program Educational Objectives (PEOs)","CSE what are the PEOs of the department"],
        "responses": ["1.To apply skills acquired in the discipline of Computer Science and Engineering for solving societal and industrial problems with apt technology intervention.<br>2.To continue their career in industry/academia or to pursue higher studies and research.<br>3.To become successful entrepreneurs, innovators to design and develop software products and services that meets the societal, technical and business challenges.<br>4.To work in the diversified environment by acquiring leadership qualities with effective communication skills accompanied by professional and ethical values."]
    },{
      "tag": "CSE HOD",
      "patterns": ["CSE HOD"],
      "responses": ["Dr. Nirmala C R <br>Dr.Nirmala received her BE degree from Mysore University in the year 1992 in Electronics and Communication, M.Tech in Computer Science and Engineering from NITK, Surathkal in the Year 2002 and Ph.D degree in Computer Science and Engineering from Visvesvaraya Technological University in the year 2013. Accomplished career as professor with more than 25 years of experience in teaching, mentoring and guiding at UG, PG and PhD levels. She is currently working as a Professor and Head in the department of Computer Science and Engineering. Her research area focuses on Semantic Web, Artificial Intelligence, Mobile Agents, Cloud Computing, Data Science and Data Analytics and Machine Learning. She has more than 35 research articles presented and published at International Conferences and Journals. 6 research scholars have completed PhD under her guidance at VTU, Belagavi and currently guiding 1 Research Scholar at VTU. Academic experience includes Dean [IT], Professor, Research Supervisor, BOE Member, LIC Member and Single Point of Contact for many Industries . She has filed and published 4 patents. She has also received 40 lakhs grants from Vision Group of Science and Technology, Govt. Of Karnataka under K-FIST-L2. 3 of her student proposals have got funds of 9 lakhs by New Age Incubation Network [NAIN], Govt. OF Karnataka Initiative."]
  },
  {
      "tag": "CSE Faculties",
      "patterns": ["CSE Name of Faculties","Total number of faculties in CSE"],
      "responses": ["Dr. Nirmala C R-Professor and HOD<br>Dr Chetana Prakash-Professor<br>Dr. Pradeep N-Professor<br>Dr. Gururaj T-Associate Professor<br>Dr. Arun kumar G Hiremath-Associate Professor<br>Dr. Naveen Kumar K R-Associate Professor<br>Dr. Santosh K C-Associate Professor<br>Dr. Abdul Razak M S-Associate Professor<br>Dr. Naseer R-Associate Professor<br>Dr. Naresh Patel K M-Associate Professor<br>Dr. Gangadharappa S-Associate Professor<br>Dr.Anusha R-Associate Professor<br>Mr. Raghu B R-Assistant Professor<br>Mrs. Radhika Patil-Assistant Professor<br>Mr. Jagadeesh A N-Assistant Professor<br>Ms. Anu C S-Assistant Professor<br>Mr. Waseem Khan-Assistant Professor<br>Mrs. Gangamma Hediyalad-Assistant Professor<br>Mrs. Pooja H-Assistant Professor<br>Mrs. Preethi B-Assistant Professor<br>Mr. Siddesh.A.S-Assistant Professor<br>Mr. Chandrashekar M V-Assistant Professor<br>Ms. Rahima B-Assistant Professor<br>Mr. Vishwanath V K-Assistant Professor<br>Mrs. Madhu N Hiremath-Assistant Professor<br>Mr. Shankar Sarji P-Assistant Professor<br>Mrs. Shwetha G-Assistant Professor<br>Ms. Rachana G Sunkad-Assistant Professor<br>Mr. Arjun H-Assistant Professor<br>Mrs. Anusha N-Assistant Professor<br>Ms. Priya V-Assistant Professor<br>Mrs. Ranjitha H S-Assistant Professor<br>Mr. Mohamed Muthahir R-Assistant Professor<br>Mrs. Drusti Shastri- Assistant Professor","34"]
  },
  {
      "tag": "CSE About",
      "patterns": ["About CSE Department"],
      "responses": ["Department of Computer Science and Engineering was established in 1984 as an academic Centre for undergraduate studies in Computer Science and Engineering and currently offers undergraduate program with the intake of 180. Visvesvaraya Technological University recognized the R and D centre in the year 2000. There are 7 research supervisors and total of 13 scholars have been awarded with PhD degree under VTU. 17 scholars are pursuing their PhD as on today. Very proud to say that, undergraduate program has been accredited three times by NBA and is valid up to 2024. It is supported by well qualified faculty, non - teaching staff and best - in - class Infrastructure in imparting the quality technical education in the field of Computer Science and Engineering. The department strives hard to prepare the students to be industry ready along with motivating them towards higher studies as well as entrepreneurship qualities. It is the best opted department in central part of Karnataka and is well known for its university results, placements, industry and Alumni tie ups. Department is pro-active in hosting International and National Conferences, faculty development programs, Workshops, Learnathon, Hackathon and many more events regularly for the benefit of students and the faculty members<br>The Department of Computer Science and Engineering of BIET has been at the forefront of churning out software engineers with a high caliber of technical expertise. It continues to foster and engender the innovation and breadth of vision necessary to excel in the blooming software industry."]
  },{
    "tag": "CSE PSOs",
    "patterns": ["CSE Program Specific Outcomes (PSOs)","what are the PSOs of the CSE department"],
    "responses": ["1.Analyze and develop solutions for problems that are complex in nature by applying the knowledge acquired from the core subjects of this program.<br>2.Ability to develop Secure, Scalable, Resilient and distributed applications for industry and societal requirements.<br>3.Ability to learn and apply the concepts and construct of emerging technologies like Artificial Intelligence, Machine learning, Deep learning, Big Data Analytics, IoT, Cloud Computing, etc for any real time problems."]
},
{
    "tag": "CSE Labs",
    "patterns": ["CSE Labs","CSE Laboratory"],
    "responses": ["1.LAB-1<br>2.LAB-2<br>3.LAB-3<br>4.LAB-4<br>5.WI-FI-<br>6.WI-FI-2<br>7.Computer Programming Lab<br>8.Digital Systems and Microprocessor Laboratory<br>9.A121<br>10.A122A<br>11.A122B<br>12.A123A<br>13.A123B"]
},
{
    "tag": "CSE no.labs",
    "patterns": ["CSE Total number of labs"],
    "responses": ["13"]
},
{
    "tag": "CSE Library",
    "patterns": ["CSE Department Library"],
    "responses": ["Department Library<br>The library at department level is for the Students and Faculty of Computer Science & Engg. which houses good number of textbooks, reference books, and project & seminar reports. At present over 3564 books with 250 titles, project reports, seminar reports & CD'S are available in the Department library. The National and International conference proceedings, workshop and seminar reports, product & textbook catalogues are kept for student's reference. Apart from the departmental library facility we have Central Library and Information Center. At Central Library, along with the standard books we have the facility of accessing various International & National Journals."]
},
{
    "tag": "CSE Technical Staff",
    "patterns": ["Technical Staff"],
    "responses": ["Mr. Jayadeva J S-Assistant Programmer<br>Mr. Naveen Kumar C S-Assistant Instructor"]
},{
  "tag": "CSE Supporting Staff",
  "patterns": ["Supporting Staff"],
  "responses": ["Mr. Anjanappa-Attender<br>Mr. Shanmuka N-Attender<br>Mr. Manjunath N-Attender "]
},
{
  "tag": "CSE DAB",
  "patterns": ["CSE Department Advisory Board (DAB) Members"],
  "responses": ["S.No. Member Designation<br>1 Dr. Aravinda H B Principal, BIET, Davangere<br>2 Prof. Y Vrushabhendrappa Director, BIET, Davangere<br>3 Dr. Nirmala C R Professor & HOD, CS&E Department, BIET, Davanagere<br>4 Dr. ArunKumar G H Associate Professor, Dept of CSE, BIET, Davangere<br>5 Dr. Dinesh Professor, Dept of Textile, BIET, Davangere<br>6 Dr. Pradeep N Professor, CS&E Department, BIET, Davanagere<br>7 Dr. Chethana Prakash Professor, Dept of CSE, BIET, Davangere<br>8 Prof. S B Mallikarjuna Associate Professors, Dept of CSE, BIET, Davangere<br>9 Dr. Gururaj K S Associate Professor, Dept of CSE, BIET, Davangere<br>10 Dr. Naveen Kumar K R Associate Professor, Dept of CSE, BIET, Davangere<br>11 Prof. Naveen H M Assistant Professor, Dept of CSE, BIET, Davangere<br>12 Prof. Shilpa K C Assistant Professor, Dept of CSE, BIET, Davangere<br>13 Dr. Jalesh Kumar Professor, Dept of CS&E, JNNC, Shivamogga<br>Dr. Sunil Kumar B S Professor & Head, Dept of ISE, GMIT, Davangere<br>15 Mr. Kiran Kumar M R Director of Engineerig at optum Soft, Bengaluru Urban<br>16 Mr. Sachin Kumar R S Regional Program Manager - IT Academy - Asia Pacific & Japan at VMware Bengaluru, Karnataka, India<br>17 Dr. Praveen Anvekar <br>18 Wasid Sajid III Semester CSE, BIET, Davangere<br>19 Akshay Khalgatagi V Semester CSE, BIET, Davangere<br>20 Mr. Shivaprasad K M Director ,Fresher Profiles, Bangaluru.<br>21 Mr. Basava Darshan Manager, ICT Academy"]
},
{
  "tag": "CSE Accreditation",
  "patterns": ["CSE Accreditation"],
  "responses": ["BIET has already been accredited four times by National Board of Accreditation (NBA), New Delhi, during the year 2000, 2004, 2008 and 2021."]
},{
  "tag": "CSE placement",
  "patterns": ["CSE Placement","CSE dept average package","What are the placement statistics for CSE department?","Placements in Computer Science",
  "Can you provide information about the placements in the CSE department?"],
  "responses": ["Academic year No. of companies visited No. of students placed Highest Package Offered<br>In-campus Off-campus <br>2022-23 48 85 1 12 LPA<br>2021-22 32 103 2 22 LPA<br>2020-21 15 65 2 6 LPA<br>2019-20 10 56 21 7 LPA<br>2018-19 12 55 17 6 LPA","3-12LPA"]
},
{
  "tag": "CSE Staff Achievements",
  "patterns": ["CSE Staff Achievements"],
  "responses": ["Staff Achievements<br>1.Dr. Naveen H M, Assistant Professor, received the Ph.D in 2023-2024 from VTU, Belgaum.<br>2.Dr. Gangadharappa S, Assistant Professor, received the Ph.D in 2023-2024 from VTU, Belgaum.<br>3.Dr. Nirmala C R, HoD and Professor, awarded as Best Academic Coordinator by ICT Academy on 13/12/2023.<br>4.Dr. Naveen Kumar K R: Applauding Guiding Brilliance as CSE Team Secures Spot in Smart India Hackathon 2024<br>5.Dr. Abdul Razak M S and Dr. Naseer R have been appointed as the Coordinator and Co-coordinator, respectively, for the one-week Faculty Development Program on 'Agile Software Evolution and Microservices Mastery', generously sponsored by AICTE Training and Learning Academy (ATAL).<br>6.Dr. Naseer R has been awarded as 'SPOC of the month from Infosys Campus Connect and Springboard Team' on October 5th 2023.<br>7.Dr. Naseer R, Assistant Professor, received the Ph.D in 2022-2023 from VTU, Belgaum.<br>8.Dr. Naresh Patel K M, Assistant Professor, received the Ph.D in 2022-2023 from VTU, Belgaum.<br>9.Dr. Pradeep N has been appointed as Editor-in-chief for the International Journal of Research in Advent Technology (IJRAT) for 2023-2024.<br>10.Dr. S B Mallikarjuna, Associate Professor, received the Ph.D in 2022-2023 from VTU, Belgaum.<br>11.Dr. Abdul Razak M S, Assistant Professor, received the Ph.D in 2022-2023 from VTU, Belgaum.<br>12.Dr. Santosh K C, Assistant Professor, received the Ph.D in 2022-2023 from VTU, Belgaum.<br>13.Dr. Gururaj T, Dr. Naveen Kumar K R and Dr. Arunkuamar G Hiremath are felicitated and honoured on 23-02-2022 for obtaining Ph.D degree from VTU, Belgaum.<br>14.Dr. Pradeep N appointed as Academic Senior Member (SM-FINSS No. : 20301SMFINSS) for Iranian Neuroscience society-FARS chapter (SM-FINSS) from March 1, 2021 to March 2, 2023.<br>15.Dr. Pradeep N received International Honor: Academic Recognition of Hon. D. Eng. (Honoris Causa) from Iranian Neuroscience Society and Dana Brain Health Institute, Iran.<br>16.Dr. Vinutha H P, Assistant Professor, received the Ph.D in 2019-2020 from VTU, Belgaum.<br>17.Dr. Roopa G M, Assistant Professor, received the Ph.D in 2018-2019 from VTU, Belgaum.<br>18.Dr. Ashoka K, Assistant Professor, received the Ph.D in 2018-2019 from VTU, Belgaum.<br>19.Roopa G M , Assistant Professor, received best session paper award during the international conference held at Dubai during the academic year 2016.<br>20.Dr. Pradeep N, Associate Professor, received the Ph.D in 2014-2015 from VTU, Belgaum.<br>21.Dr. Nirmala C R, Professor, received the Ph.D in 2012-2013 from VTU, Belgaum.<br>22.Dr. Poornima B, Professor, received the Ph.D in 2011-2012 from Kuvempu university.<br>23.Dr. Nirmala C R, Professor has been awarded 'DHRONA' for guiding top TGMC projects under IBM Academic Initiative."]
},
{
  "tag": "CSE Student Achievements",
  "patterns": ["CSE Student Achievements"],
  "responses": ["Student Achievements<br>Kudos to the final team from the Department of CSE chosen for Smart India Hackathon - 2024. Your innovation shines bright!<br>B R Veeresh, a Final-year student, showcased exceptional debating skills and clinched the first position at the 'Energy Conservation Day-2023' event, a collaborative effort between the E&E department BIET and KREDL Bengaluru on May 22, 2023.<br>Neha U. K - A Final Year Student has won the Jury award in VMWare Build-A-Thon organised from 19th April 2021 to till May end.<br>Ridhi M Jain , final year student got placed in Uppsala Security Systems Singapore with annual pay of 18000 DOLLARS, monthly 82000 Rs.<br>Hanumanthappa Budihal, 2016 batch passed out student has been selected to higher studies in Computer Science and Engineering at Prestigious IIT Madras.<br>Under NAIN Scheme, proposal entitled 'Smart Ward -Tracking and Alerting System' has been funded three lakhs rupees under the mentorship of Dr. Roopa G M during the academic year 2020-21<br>Under NAIN Scheme, proposal entitled 'Depression Detection System and Remedial Recommendation System using Machine Learning' has been funded three lakhs rupees under the mentorship of Dr. Nirmala C R during the academic year 2020-21<br>Karthik GM from CSE Department got selected for an internship @CargoAI Singapore.<br>Students of CSE under the guidance of Dr. Nirmala.C.R, Mr. Bhimsen V Purohit have developed the present College Website.<br>Team 'Exotic Minds' with Mr.Gautam.P, Mr.Bhimasen.V.Purohit, Ms.Pragati.P.M, Mr.Adarsh.S under the guidance of Dr.Nirmala.C.R have won the Best Project Award under 'TGMC 2012, IBM Academic Initiative'.<br>Mr. Prashanth Y, Ms. Prakruthi V, Ms. Poonam, Ms. ashwini G with the team name of 'E-sparks' under the guidance of Dr.Nirmala.C.R have won the Best Project Award under 'TGMC 2011, IBM Academic Initiative'.<br>Mr. Tejas Jain, Mr. Bharath, Ms. Swetha, Ms. Veda P Shinde under the guidance of Dr. Nirmala.C.R have won the Best Project Award under 'TGMC 2010, IBM Academic Initiative'.<br>Every year 10 teams are selected for TCS TechBytes regional round which would be held at BVB Hubli.<br>Sharath P J Secured 1st place in C-Genius on 10th April 2018 under Kaushala 2018 by CS&E Dept., UBDTCE, Davangere.<br>Sharath P J Secured 1st place in Coding and Error Correction on 27th March 2018 under Tech Aspire 2K18 by Dept. of MCA, UBDTCE, Davangere.<br>Sharath P J Secured 1st place in JIT Hackathon on 16th March 2018 organised under TECHNIE'18 (National Level Technical Fest) by CS&E Dept, Jain Institute of Technology, Davangere.<br>2 teams participated in Smart India Hackthon 2018, National level project.<br>Sharath P J Secured 3rd place in CodeVeta on 24th February 2018 organized under Technie'18 (State Level Technical Fest) by CS&E Dept., Jain Institute of Technology, Davangere.<br>Mr. Naman Anand, Ms. Megha S, Ms. Sindhu D H, Mr. Medhansh C, Mr. Chandra N Secured 1st price during 2 day Hackthon On 'Building Chatbots using IBM Watson Assistance' conducted by Smartbridge in association with IBM.<br>3 teams were shortlisted for the second round for AICTE Vishwakarma Awards 2019 with the Award theme as 'How to enhance the income of a village'.<br>2 teams participated in India Innovation Challenge Design Contest 2019 (IIDC-2019) DST & Texas Instrument powered by AICTE Mission.<br>Mr. Sharath P J, Ms. Megha S, Mr. Naman Anand, Mr. Medhansh Chaubey, Ms. Ridhi M Jain, Ms. Sindhu D H participated in National Level Smart India Hackthon 2019 for the problem statement 'AI Solution for Framers' held on 2nd & 3rd March 2019 at Chitkara University, Rajpura Punjab.<br>6 Teams have been selected from Regional to National level 24 Hrs Hackthon organized by Smartbridge in association with IBM, Bengaluru.<br>Mr. Gowtham S Vernekar and Mr. Nachiketh M P are Selected for paper presentation during TechKriti-2020 organized by IIT Kanpur which will be conducted from 19th to 22nd March 2020."]
},
{
  "tag": "CSE Forum Activities",
  "patterns": ["CSE Forum Activities"],
  "responses": ["Forum Activities<br>COMPUTER SCIENCE FORUM (UniCS)<br>UniCS provides a platform for the students to exhibit their talents and skills. UniCS conducts variuos technical and non-technical events. UniCS conducts several short term courses and technical talks by inviting experts from industry and academia, organize industry and research centre visits and conduct personality development programs which may help in the placement.<br> Event Descrption<br>1. TEKHACK-2023 TEKHACK-2023- Inter-Institutional National Level Technology Hackathon organized by Dept. of CSE on 25/03/2023.<br>2. PROGYAN 5.0 Progyan 5.0 Open-House Project Exhibition organized on 4th and 5th of May 2023.<br>3. NSS Camp A three-day NSS Camp at Kondajji, focusing on fostering social connection and responsibility, took place from March 16th to March 18th, 2023, for third-semester students.<br>4. Heritage walk Heritage walk for Hampi in view of Social Connect and responsibility for III Semester Students held on 17/02/2023.<br>5.TCS Tech-Bytes TCS TechBytes, IT quiz competition which provides a better understanding of IT as Technology and is open to all stream students Initiation by TCS Pvt. Ltd., Bengaluru and hosted by Dept. of CS&E, BIET organized on 15/02/2023.<br>6. Internal Hackathon The Department of CSE was organized an Internal Hackathon to select the top teams to participate in MANTHAN-2023 on Friday 27/01/2023.<br>7. Workshop on Tech-O-Net One Day workshop conducted on Tech-O-Net on 13/01/2023 for 5th semester CSE students.<br>8. Workshop on Artificial Intelligence and Machine Learning 3 days workshop for 7th semester students on Artificial Intelligence and Machine Learning was organised from 03/01/2023 to 05/01/2023.9. Cyber security & Ethical Hacking 2 days workshop on Cyber security & Ethical Hacking under UniCS for 45 girl students of Batch-I, 5th semester students from 16/12/2022 to 17/12/2022, In association with Cybersapiens.<br>10. Techniques and Strategies Recipes for building a Modern Database Application Workshop on Techniques and Strategies Recipes for building a Modern Database Application to 5th semester of CSE was organised on 14/12/2022 by CSE faculties.<br>11.Java bootcamp + hackathon Java bootcamp + hackathon, one week Program for 5th semester CSE students was held from 06/12/22 to 10/12/2022.<br>12. Youth Talk Day Youth Talk Day was held on 31/10/2022 by Mr. Jackaulla, Microsoft Certified Expert from ICT Academy to CSE students.<br>13. Orientation Session on CLOUD AND DEVOPS LAB Orientation Session for CSE faculties on CLOUD AND DEVOPS LAB on 15/10/2022 by Mr. Santosh Navale, Director, Fresher Profiles Private Ltd, Bengaluru.<br>14. CODE-A-THAN 2.0 Bootcamp and competition for 4th semester students on problem solving through programming was organized from 04/08/2022 to 06/08/2022.<br>15. LATEX workshop A workshop for second and third year students of Computer science and Engineering was held on 07/06/2022.<br>16. Crash Course on C++ One week crash course on C++ for 4th semester students was organized from 23/05/2022 to 27/05/2022.<br>17. Interactive Session on Challenges faced in IT Industries Interactive Session on Challenges faced in IT Industries organized by department of Computer Science & Engineering on 04/05/2022.<br>18. Oracle Cloud Infrastructure Self learning program by Oracle in association with ICT academy was organized on 28/04/2022.<br>19. Progyan 4.0 Final year project phase-2 demo was held on 21/04/2022 and 22/04/2022.<br>20. UNICS - Coding Club Coding Contest using Hacker Rank was organised from 06/12/2021 to 07/12/2021.<br>21. Resume Building Session on Resume Building by Mr. Thippeswamy G, Senior Software Engineer, Nutanix India Pvt. Ltd. Bengaluru was organised on 10/11/2021.<br>22. Soft Skills Training Program Soft skills training program for pre final year students from 30/08/2021 to 04/09/2021<br>23. Crack the Code to Conquer the Interview Crack the Code to Conquer the Interview under CS forum from 31/07/2021 to 01/08/2021<br>24. Progyan-3.0 Progyan-3.0:In - house project exhibition from 09/07/2021 to 10/07/2021<br>25. Virtual Power Seminar on Industry 4.0 Virtual Power Seminar on Industry 4.0 on Employers Expectation on Fresh Engineering Graduates was oganized on 22/05/ 2021<br>26. Faculty Lecture Series Conclave Faculty Lecture Series Conclave in association with ISTE faculty chapter from 07/04/2021 to 30/04/2021<br>27. BLOG-A-THON The Blog-A-Thon event was held on 25-03-2021 for all faculty members of the institute to build their personal blogs as a initiative of new teaching pedagogy.<br>28. Power Seminar Power Seminar On Machine Learning by Ms. Monica Popuri, Engineering Manager, Hewlett Packard Enterprise, Bengaluru. Under the banner of ISTE Students Chapter In Association with ICT Academy On 25-09-2020.<br>29. Online Interactive Webinar Online Interactive Webinar On Cracking Coding Interviews in Tech Companies like GOOGLE and MICROSOFT BY Mr. Channa Bankapur, Associate Professor, Trainer at GoMaster.in and Mr.Narasimha Datta N, Co-Founder at GoMaster Technologies Under the banner of ISTE Students Chapter<br>30. MS-Abroad Exposures to higher studies and career organized by CS & E on 18/02/2020<br>31. Technical Talk on 'Startup World' organized talk on 8/11/2019 to become an entrepreneur<br>32. Oral Hygiene Awareness Program Initiation by College of Dental Science, Davangere and hosted by Dept. of CS&E, BIET to address the issues related to Oral health care organized on 23/09/2019<br>33. Technical Talk on 'Digital Marketing' Initiation by Hardsoft Solutions, Davangere and hosted by Dept. of CS&E, BIET on 14/09/2019<br>34. Progyan-1.0 In-house Project Exhibition organized by CS& E from 20/05/2019 to 21/05/2019<br>35. Crash Course on C++ Basics of C and C++ for fourth semester students from 28/01/2019 to 01/02/2019"]
},{
  "tag": "CSE Department Activities",
  "patterns": ["CSE Department Activities"],
  "responses": ["Department ActivitiesThe following department activities were conducted:Department of Computer Science and Engineering Celebrated 'International Women's day' on 12/03/2023.Invited talk on Cyber Security: Foundation and Research Opportunities under UniCS for 5th and 3rd semester students was held on 07/01/2023 in association with IQAC cell.One day workshop on Cracking product based company interviews by Mr. Channa Bankapur for 5th semester CSE/ISE Students was held on 29/12/2022.C Quest competition under UniCS for all semester students was held on 16/12/2022BPL Inauguration was held on 14/11/2022.FDP on Microsoft Power BI Data Analyst Associate was organized in association with ICT academy from 10/10/2022 to 14/10/2022.FRISSON-2022 , Department technical fest including technical and cultural activities for inter institute students was organized on 10/06/2022 and11/06/2022.CODE-O-FIESTA- Coding Related events for first year students held on 23/02/2022.TCS TechBytes, IT quiz competition which provides a better understanding of IT as Technology and is open to all stream students Initiation by TCS Pvt. Ltd., Bengaluru and hosted by Dept. of CS&E, BIET organized on 19/02/2022.Inauguration and MOU exchange with skyscend in association with IQAC was organised on 03/12/2021.Talk on Research Outcomes through Indexed Publications by Dr. Jalesh Kumar was organized on 18/11/2021 .C-Quest : Coding Contest was organized on 30/10/2021.Internal Hackathon for Manthan-2021 was organized on 25/10/2021.Inauguration of Center of Excellence for Women Empowerment-To establish the Center of Excellence on Women Empowerment under the CSR initiative of Honeywell implemented by ICT Academy was organized on 23/10/2021.IBM call for code workshop was organized on 07/06/2021GitHub Campus program Re-Engineer the code culture -Orientation session was on 25/05/ 2021Virtual Webinar on Introduction to RPA in association with ISTE and Uipath Robotic Process Automation was held on on 24/05 /2021Cisco Netacad Centre and Student training Program on Programming essential in Python for second year students on 25/01/ 2021.Coding Contest open for all the streams. The contest is conducted with written and coding round on the HackerRank Platform organized on 14/12/2020IT quiz competition which provides a better understanding of IT as Technology and is open to all stream students. Preliminary round will be held at Institute level on 25/02/2020Smart India Hackathon 2020 is a nationwide initiative to provide students a platform to solve some of the pressing problems we face in our daily lives and thus inculcate a culture of product innovation and a mindset of problem solving organized on 07/02/2020VMware IT Academy enables instructors at academic institutions to deliver authorized VMware courses in a variety of settings. Students can jump-start their careers and VMware knowledge with coursework through a global network of colleges and universities, and through online certification opportunities, hands-on labs, and other VMware learning resources organized on 21/11/2019IBM Digital Developer Conference was about Cloud Native Developer Track and Machine Learning Developer Track was initiated by IBM Pvt. Ltd., Bengaluru and hosted by Dept. of CS&E, BIET on 9/11/2019UiPath-RPA Academic Challenger 2019, event tries to help the next generation to prepare for future of work. The program enables learning and invites the institutions to join for the first UiPath Academic Challenge and help identify-'UiPath Academic RPA Champ' organized on 31/10/2019UiPath Diploma of Completion-RPA Starter Training course provides an overview of RPA, presents the main capabilities of the UiPath Enterprise RPA Platform and even gives an overview of actual automation building process from 17/10/2019 to 25/10/2019 .InfyTQ App are Certified Training Programmes and according to the current Industry Standards organized on 30/09/2019TEKHACK-2019 is an Inter-Institutional National Level Technology Hackathon organized to solve the problems of society and Industry with the help of Emerging Technologies (IoT, Data Science, Artificial Intelligence, and Machine Learning) in association with SMARTBRIDGE, Bengaluru and In Collaboration with: IBM, Bengaluru from 19/09/2019 to 21/09/2019 .C-Quest, Coding Contest open for all the streams. The contest is conducted with written and coding round on the HackerRank Platform on 30/08/2019.Industry workshop on 'Machine Learning to Deep Learning' course is designed to provide an exposure to the fundamentals of Artificial Intelligence and Deep Learning. Participants will learn to apply deep learning techniques to solve the real-world research and industry problems organized on 23/02/2019.TCSTech Bytes, IT quiz competition which provides a better understanding of IT as Technology and is open to all stream students organized on 15/02/2019."]
},
{
  "tag": "ISE VISION",
  "patterns": [
    "what is the vision of ISE","give  the vision of ISE","Can you tell me about the vision of the ISE department?","what is the vision of Information Science and Engineering",
    "What are the long-term goals of Information Science and Engineering?",
    "Could you provide insights into the future aspirations of the ISE program?",
    "Describe the overarching goals of the Industrial & Systems Engineering department.",
    "What is the vision of the ISE department?",
    "Tell me the vision statement for Industrial & Systems Engineering.",
    "What goals does the ISE department aim to achieve?"
  ],
  "responses": [
    "To be the center of excellence by adopting technological innovation in academics and research to develop competent man power for emerging needs of society and Industries."
  ]
},
{
  "tag": "ISE MISSION",
  "patterns": [
    "ISE MISSION","what is the mision of ISE","give the mision of ISE","Can you tell me about the mission of the ISE department?","what is the mision of Information Science and Engineering?",
    "What are the goals of Information Science and Engineering?",
    "Could you provide insights into the objectives of the ISE program?",
    "Describe the mission statement of the Information Science and Engineering",
    "What is the focus of the ISE department?",
    "Tell me the mission statement for Information Science and Engineering"
  ],
  "responses": [
        "To provide Quality education to meet the challenges of technological changes to succeed in their professional career and higher education.<br>To inculcate the culture of research, innovation and entrepreneur skills among the students.<br>To groom our students with the quality of team spirit, leadership skills and ethical values, to share and apply their knowledge for the benefit of the society."
  ]
},
{
  "tag": "ABOUT ISE",
  "patterns": [
    "ABOUT ISE","tell me about ISE"
  ],
  "responses": [
    "The Department of Information Science and Engineering was established in the year 2000 with the vision to produce high-qualified professionals in the field of Information Technology. The department started with an intake of 60 students, and subsequently intake was increased to 120 in the year 2007, 150 in the year 2021, and 180 in the year 2022. With the support of our beloved chairman Dr. Shamanur Shivashankarappa, Director and Principal, the department has grown over the last two decades in terms of infrastructure, facilities & teaching excellence. The department has a state-of-the-art laboratory, library facilities and well-trained and experienced teaching faculty who emphasize the theoretical and practical applications of computation to the needs of society. So far, the department has produced more than 2200 successful engineering graduates who have occupied leading positions in reputed organizations all over the globe. Apart from teaching, the faculties are involved in research and development activities.<br>The department is recognized by IIT Bombay as one of the remote centre, with a mission to reach out and engage a large number of teachers to enrich their knowledge through faculty development programs. The department has set up Industry 4.0 - Center of Excellence in collaboration with Rovelabs, Bengaluru to provide in-depth technical knowledge, innovation, and research opportunities for students. The Insync forum is meant exclusively to encourage the students to explore their technical and cultural abilities. Technical seminars, pep talks by accomplished alumni, and tech talks by industry experts are organized regularly under Insync. Aarohana, a techno fest, held every year creates a platform for students to showcase their technical talents. Technical quizzes, paper presentations, coding, debugging, and designing contests are organized in the Infozest. The department could achieve success because of the kind of cooperation extended by all our stakeholders. Looking forward to climbing further steps to attain more success in the years to come."
  ]
},
{
  "tag": "ISE PEOs",
  "patterns": [
    " ISE PEOs","what is the PEOs of ISE","give the PEOs of ISE"
  ],
  "responses": [
    "The graduates of program will have excellence through principles and practices of information technology combined with fundamentals of engineering.<br> The graduates of program will be prepared in diverse areas of information science for their successful careers, entrepreneurship and higher studies.<br>The graduates of program will work effectively as an individual and in a team, exhibiting leadership qualities, communication skills to meet the goals of the organization.<br>The graduates of program will grove their profession with ethics, management principles to carry societal responsibilities."
  ]
},
{
  "tag": "ISE PSOs",
  "patterns": [
    " ISE PSOs","what is the PEOs of ISE","give the PEOs of ISE"
  ],
  "responses": [
    "Problem Solving Skills - Ability to apply standard principles and practices of Information Technology to propose feasible ideas and solutions to computational tasks using appropriate tools and techniques.<br>Knowledge of Information Technology  Analyze, design, develop and test the computer based software in the areas related to networks, cloud computing, web technology, data science and IoT.<br>Profession and Research Ability  Inculcate the knowledge to excel in IT profession, entrepreneurship and research with ethical standards."
  ]
},
{
  "tag": "ISE HOD",
  "patterns": [
    " ISE HOD","who is the hod of ISE "
  ],
  "responses": [
    "Dr.Poornima B currently working as Head, Dept of Information Science and Engineering and Dean, BIET-Incubation Centre. Hitherto, served as Dean, Training and Placement. She has been awarded Ph.D. from Kuvempu University, Shivamogga in the year 2013 under the supervision of Dr.V.Ramaswamy, then the principal of BIET and Master's Degree in Computer Science & Engg., from PDA college of Engg. Gulbarga during the year 2001. She has more than 28 years of teaching experience, 12 years of research experience and one year in Industry. Her Research interest include Artificial Intelligence, Image Processing, Internet of Things, Big data and Data Science. Dr. Poornima B has published 34 research papers in refereed journals, presented, published research papers in international conferences, chaired sessions and delivered special lectures on various occasions. Under her supervision seven scholars awarded with Ph.D. degree and right now supervising three research scholars. Dr. Poornima B. is the Institute coordinator for New Age Innovation Centre (NAIN), initiative of KBITS, Dept. of IT, BT, Director of Bapuji Co - operative Bank, Government of Karnataka and coordinator for remote centre recognized by IIT Bombay. She has received research grants of Rupees 40.00 lakhs as principal Investigator/Coordinator for the project titled 'Novel Integrated Filter Based Approaches for Image Abstraction to Investigate The Hidden Research Issues in Processing Domain' under VGST, K-FIST Level -2 and from AICTE-RPS project for Rs.4.3 lakhs for the project titled 'Design and Analysis of Efficient Privacy Preserving Data Mining Algorithms'. Further, she has completed small grant students projects sanctioned from KSCST, as well as institution funded projects."
  ]
},
{
  "tag": "ISE Technical Staff",
  "patterns": [
    "ISE Technical Staff","give ISE Technical Staff details "
  ],
  "responses": [
    "Mrs. Indira S H-Instructor<br>Mr. Maxim Tellis-Instructor<br>Mr. Siddeshi S-Instructor"
  ]
},
{
  "tag": "ISE Supporting Staff",
  "patterns": [
    "ISE Supporting Staff","give ISE Supporting Staff details "
  ],
  "responses": [
    "Mr. Bakkeshwara G-Peon<br>Mr. Rudreshi P-Peon<br>Mr. Hanumanthappa D-Peon"
  ]
},
{
  "tag": "ISE Placements",
  "patterns": [
    " ISE Placements","GIve ISE placements details","What are the placement statistics for ISE department?","ISE department average package",
    "Can you provide information about the placements in the ISE department?","placements in the Information Science and Engineering department?"
  ],
  "responses": [
    "Academic Year No. of companies visited No. of students hired Highest Package<br>In campus Off campus <br> 2022-23 21 70 3 10<br>2021-22 32 58 20 12<br>2020-21 15 45 7 6<br>2019-20 10 34 10 7<br> 2018-19 12 38 15 6<br>2017-18 5 28 14 6<br>2016-17 4 39 13 5"
  ]
},
{
  "tag": "ISE Staff Achievements",
  "patterns": [
    "ISE Staff Achievements","give ISE Staff details"
  ],
  "responses": [
    "Mrs. Sushma C and Mrs. Roopa D E has cleared National Entrance Test (NET).<br>Under the guidance of Dr. Poornima B , Mr. Patil N. S.. has been awarded with Ph. D. for his research topic An Effective Technique for Managing Large and Unstructured Graph Database'- 2022-2023.<br>Under the guidance of Dr. Poornima B , Ms. Bhuvaneshwari K. V. has been awarded with Ph. D. for her research topic 'Early Detection of Gynecological Cancer using Data Mining Technique' 2022-2023.<br>Under the guidance of Dr. Sunilkumar G., Vijaya Vittala Inst. Of Tech., B'lore , Mrs. Anitha G has been awarded with Ph. D. for her research topic 'Morphotactic Model building for Kannada' 2022-2023.<br>Mr. Sheik Imran and Mrs. Hemashree H C has been selected their project proposal titled 'Intelligent Hexapod Synchronized Waste Collection System by KSCST.'<br>Under the guidance of Dr. Poornima B , Mrs. Vinutha H. P. has been awarded with Ph. D. for her research topic 'Data Mining Approaches for Security and Data Integrity in Networking Environment' 2018-2019.<br>Under the guidance of Dr. Poornima B , Mr. S. B. Mallikarjuna. has been awarded with Ph. D. for his research topic 'Automatic Disease Identification System of Arecanut Diseases using Image Processing Techniques' 2022-2023.<br>Under the guidance of Dr. Poornima B , Mrs. Varsha M. has been awarded with Ph. D. for her research topic 'Monitoring and Identification of Plant Diseases using Internet of Things' 2022-2023.<br>Under the guidance of Dr. Poornima B , Mr. Pavankumar M. P. has been awarded with Ph. D. for his research topic 'Some Novel Integrated Filter Based Image Abstraction approaches to Explore the Hidden Research Issues' 2021-2022.<br>Under the guidance of Dr. Poornima B , Mr. Ashoka K. has been awarded with Ph. D. for his research topic 'Some Novel Approaches for Privacy Preserving Data Publishing' 2018-2019.<br>Prof. Sheik Imran and project team has awarded as best paper entitled 'An Ensemble Machine Learning Approach in Brain Tumor Classification' in First International Conference on Multi-disciplinary Research Trends in Engineering and Technology (ICMRTET), at Smt. Kamala and Sri Venkappa M Agadi College of Engineering and Technology (SKSVMACET), Lakshmeshwar, Karnataka, India on March 12 - 13, 2024."
  ]
},
{
  "tag": "ISE Student Achievements",
  "patterns": [
    "ISE Student Achievements","give ISE Student Achievements details"
  ],
  "responses": [
    "8th Semester students Mr. Kiran Kumar N, Mr. TarunPaga and Mr.Vishnu Bhagath M.B have won SECOND PRIZE in the National level seminar 'KAUSHALA-2017' on 'Skill module for Engineers and Managers' held on 21st&22nd April 2017 at AIET, Moodbidri.<br>Dept. of IS&E has won the 'Championship & Rolling Shield' in the Inter-departmental competitions held for Davana 2017<br>Mr. T V S Akhil., 8th Semester student has awarded 'ISTE Best Student' for the Year 2015-2016.<br>8th semester students Ms. Shrusti C J , Mr. Akash C S, Ms. Inchara M R and MR. Bharath M N have been bagged state level innovation Dr. S K Shivakumar Award - 22 for their project titled 'Braille Learning : An Audio Based Learning System for Poor BLIEND CHILDREN using IoT' in the Year 2021-2022<br>Dept. of IS&E has won the 'Championship & Rolling Shield' in the Inter-departmental competitions held for Davana 2018.<br>Ms. Nithyashree K. V.,8th Semester student has awarded 'TCS Best Student' for the Year 2017-2018.<br>8th Semester students Mr. Kiran Kumar N, Mr. Sachin D.P, Mr. Ranganath H.R, Ms. Pratiksha S.B, Mr. Basanagouda S.D and Mr. AakashVerma have been participated 'Smart India HACKTHON-2017' held at Nagpur, M.P on 1st and 2nd April 2017, Guided by Mr. Chandan V. Asst.Prof., IS&E Dept.<br>Ms.Vaishnavi S Iyengar.,8th Semester student has awarded 'Best Sports Person of the Year 2016-2017' and 'Individual championship for girls in the Year 2016-2017' at BIET, Davangere.<br>8th semester students Ms. Sushmitha M R , Ms. Yashoda K U, Ms. Varsha B S and Ms. Supritha M have been bagged state level innovation Dr. S K Shivakumar Award - 22 for their project titled 'an EEG based Identification of Students Cognitive Load in their Intelligence Quotient Test' in the Year 2021-2022<br>Dept. of IS&E has won the 'Championship & Rolling Shield' in the Inter-departmental competitions held for Davana 2023.<br>Mr. Rahul A Grandhi, Mr. Nayan R. and Ms. Vachanashree M N has participated and received certificate of participation in BOSCH presents EnCode organized by E - Cell, IIT Guwahati and Coding Club, IIt Guwahati, Conducted during UDGAM - The Annual Entrepreneurship Summit of IIT Guwahati in the year 2021 -2022.<br>3rd Semester student Mr. Shreesh Gururaj Kulkarni has cleared 4 course from IIT Madras Qualifier Exam - 1. 1. Statistics for Data Science 1 with score 73% 2. English 1 with score 73% 3. Computational Thinking with score 66% 4. Mathematics for Data Science 1 with score 72%."
  ]
},
{
  "tag": "ISE Labs",
  "patterns": [
    "ISE Labs","about ISE labs"
  ],
  "responses": [
    "1.Project Laboratory -1 (B - 224)<br>2.Project Laboratory -2 (B - 224)<br>3.Computer Laboratory - 1 (B-226)<br>4.Computer Laboratory - 2 (B-226)<br>5.Microprocessors and Logic Design /Electronics Circuits Laboratory - 1 (B-228)<br>6.Microprocessors and Logic Design /Electronics Circuits Laboratory - 2 (B-228)"
  ]
},
{
  "tag": "total no of ISE faculties",
  "patterns": [
    "Total no of ISE faculties"
  ],
  "responses": [
    "27"
  ]
},
{
  "tag": "ISE classrooms",
  "patterns": [
    "ISE classrooms","about ISE classrooms","give about ISE classrooms"
  ],
  "responses": [
    "Department of Information Science and Engineering has six classrooms where theory classes are conducted regularly and one seminar hall. Among six classrooms one class room is facilitated with Lecture Capture System (LCS) and another classroom is having ICT facility. Theory classes taken in the LCS class room will be recorded and the video will be shared with students. Department has one seminar hall named 'S G BALEKUNDRI' seminar hall with a sitting capacity of 300 students and ICT facility. The seminar hall is used for conducting various events under forum, technical talk, seminar, and online sessions of IIT Bombay through Aview software."
  ]
},
{
  "tag": "ISE Department Library",
  "patterns": [
    "ISE Department Library","about ISE library","about ISE Department Library"
  ],
  "responses": [
    "In addition to the Central Library, a well-equipped departmental library is functioning in the department catering to the needs of the faculty and students. Number of Books - 2500 Number of Journals - 109 Number of Periodicals - 10 Number of Project Reports - 150 Number of UG Manuals - 27"
  ]
},
{
  "tag": "ISE Accredition",
  "patterns": [
    "ISE Accredition","Accredition"
  ],
  "responses": [
    "BIET has already been accredited four times by National Board of Accreditation (NBA), New Delhi, during the year 2000, 2004,2008 and 2021."
  ]
},
{
  "tag": "ISE Total number of Labs",
  "patterns": [
    "ISE Total number of Labs"
  ],
  "responses": [
    "6"
  ]
},
{
  "tag": "ISE Faculties",
  "patterns": [
    " ISE Faculties","give ISE Faculties details"
  ],
  "responses": [
      "Dr. Poornima B-Professor and Head<br>Dr. Vinutha H P-Professor<br>Dr. Ashoka K-Professor<br>Dr. Sreenivasa B R-Associate Professor<br>Dr. Rekha C-Associate Professor<br>Dr. Anitha Associate Professor<br>Dr. Bhuvaneshwari K V-Associate Professor<br>Dr. Patil N -Associate Professor<br>Dr. Naveen H M-Associate Professor<br>Mr. D Shivamurthy-Assistant Professor<br>Mr. Sheik Imran-Assistant Professor<br>Ms. Rekha B H-Assistant Professor<br>Mr. Puneeth S P-Assistant Professor<br>Mrs. Hemashree H C-Assistant Professor<br>Mr. Santhosh T-Assistant Professor<br>Ms. Priyanka D V-Assistant Professor<br>Mrs. Kamala R-Assistant Professor<br>Mrs. Manjushree K R-Assistant Professor<br>Mrs. Roopa D E-Assistant Professor<br>Mrs. Sushma C-Assistant Professor<br>Ms. Madhuri Martis-Assistant Professor<br>Mrs. Nagashri J A-Assistant Professor<br>Ms. Vinutha D-Assistant Professor<br>Mrs. Chaitra K J-Assistant Professor<br>Mrs. Nomitha Chawla-Assistant Professor<br>Ms. Mamatha S K-Assistant Professor<br>Chaitra K G-Assistant Professor<br>Mrs. Parveen Banu N-Assistant Professor"
  ]
},
{
  "tag": "Mechanical Vision",
  "patterns": [
    "vision of mech","mech vision",
    "give me vision of mechanical",
    "what is the vision of mech","Can you tell me about the vision of the Mechanical Engineering department?",
    "What are the long-term goals of Mechanical Engineering?",
    "Could you provide insights into the future aspirations of the Mechanical Engineering program?",
    "What is the vision of the Mechanical Engineering department?",
    "Tell me the vision statement for Mechanical Engineering.",
    "What goals does the Mechanical Engineering department aim to achieve?"
  ],
  "responses": [
    "The department endeavors to be a center of excellence, to provide quality education leading the students to become professional mechanical engineers with ethics, contributing to the society through research, innovation, entrepreneurial and leadership qualities."
  ] 
},
{
  "tag": "Mechanical Mission",
  "patterns": [
    "mission of mech","Mechanical Mission",
    "give me mission of mechanical department",
    "what is the mission of mech","Can you tell me about the mission of the Mechanical Engineering department?",
    "Could you provide insights into the objectives of the mechanical program?",
    "Describe the mission statement of the Mechanical Engineering department.",
    "What is the focus of the mechanical department?",
    "Tell me the mission statement for Mechanical Engineering."
  ],
  "responses": [
    "To impart quality technical education through effective teaching-learning process leading to development of professional skills and attitude to excel in Mechanical Engineering.<br>To interact with institutes of repute, to enhance academic and research activities.<br>To inculcate creative thinking abilities among students and develop entrepreneurial skills.<br>To imbibe ethical, environmental friendly and moral values amongst students through broad based education."
  ]
},
{
  "tag": "ugmech peos",
  "patterns": [
    "PEOs of mechanical department",
    "what are the program educational objectives of mech",
    "what are the PEOs of mechanical "
  ],
  "responses": [
    "Enable to understand mechanical engineering systems those are technically viable, economically feasible and socially acceptable to enhance quality of life.<br>Apply modern tools and techniques to solve real problems in mechanical and allied engineering streams.<br>Communicate effectively using innovative tools, to demonstrate leadership and entrepreneurial skills.<br>Be a professional having ethical attitude with multidisciplinary approach to achieve self and organizational goals.<br> Utilize the best academic environment to create opportunity to cultivate lifelong learning skills needed to succeed in profession."
  ]
},
{
  "tag": "ugmech psos",
  "patterns": [
    "PSOs of mechanical department",
    "what are the program specific outcomes of mech",
    "what are the PSOs of mechanical "
  ],
  "responses": [
    "Apply the acquired knowledge in design, thermal, manufacturing and interdisciplinary areas for solving industry and socially relevant problems.<br>To enhance the abilities of students by imparting knowledge in emerging technologies to make them proficient mechanical engineers."
  ]
},
{

  "tag": "ugmech about",
  "patterns": [
    "about mechanical department",
    "give me about mech",
    "information about mech"
  ],
  "responses": [
    "The Department of Mechanical Engineering is one of the pioneering departments of B.I.E.T and is the mother of all branches of engineering. Department started the Under Graduate programme in the year 1979 with an intake of 60 students. Later, the intake was increased to 120 students on demand from industries and research institutes. The Department is also having Research Centre and Product Development Cell. Department is affiliated to Visvesvaraya Technological University, Belgaum and is duly approved by Institution of Engineers India, Kolkata. Department was duly accredited thrice by National Board of Accreditation, New Delhi and also recently the NATIONAL ASSESSMENT AND ACCREDITATION COUNCIL (NAAC) is an autonomous body established by the University Grants Commission (UGC) of India to assess and accredit institutions of higher education in the country- awarded A grade to our college.Considering the potential and talents available in the department, various State and Central government funding agencies like AICTE, DST, FIST, UGC, DBT, ICSSR, VGST, KSCST and KSBDB have extended financial support to the tune of Rs 197.45 lakhs. Department strives hard for academic excellence through personalized attention. Faculties contribution in research activities are evidenced by their publications at National and International peer reviewed Conferences and Journals. At present in the department 13 students have registered for Ph.D. and are at various stages of their research activities and 13 students are already awarded Ph.D. by VTU, Belgaum.The Department is continuously striving to achieve excellence in education, academic and industry oriented research as well as consultancy work with service to the society. Our research activities are primarily focused on Composites, Alternative fuels, Electronic Engine Management, Fracture Mechanics, Precision Engineering. We aim to provide our students a perfect blend of intellectual and practical experiences, which helps them to serve our society and address a variety of needs. At the end of our program, students are prepared for entry-level work as a mechanical engineer as well as for the post-graduate study in Mechanical Engineering or in any other allied discipline. Our students are well placed in leading industries as well as in the higher level research institutions of International recognition.The Department of Mechanical Engineering, being one of the largest and oldest departments of the Institute, caters to its students with class tutorial and state-of-the-art laboratories. Apart from carrying out practical classes as per academic curriculum, Workshops caters to the needs of different departments of the Institute in terms of executing works of their B.E., M.Tech., and Ph.D. students as well as other related research works. The Department also welcomes students from other departments of the institute as a gesture of support to their time-to-time academic and research needs."
  ]
},
{
  "tag": "ugmech hod",
  "patterns": [
    " mech HOD",
    "give me mech hods profile",
    "what is the qualification of mechanical hod"
  ],
  "responses": [
    "Dr. G. Manavendra<br>Professor<br>Dr. G Manvendra, working as Professor & Head in Mechanical and research Engineering Department. Having 26 years of experience in teaching. He completed his B.E in Mechanical Engineering from Bapuji Institute of Engineering and Technology, Davanagere, Mysore University in 1991 and perused his Master degree in Thermal Power Engineering from PDACE Gulbarga, Gulbarga University in 1997. He started his career as Lecturer in Mechanical Department at BIET, Davanagere, from 1994 to 2006. He has promoted as Assistant Professor in the year 2008. He received his doctorate degree from Visvesvaraya Technological University, Belagavi during 2012. He served as PG Coordinator for M.Tech (TPE) from 2017-2020. He promoted as Professor in 2019. Currently, he is guiding 3 Ph.D. students and 3 research scholars are awarded with Ph.D. under VTU, Belagavi. He is a Life Member of ISTE, New Delhi and Member of Institution of Engineers (MIE) India. He has awarded as best teacher for several times from the institute for achieving 100% result in various subjects handled. He organized AICTE-ISTE Two week Short term training programme on 'RAM & MTS' from 16th - 27th August 2004 and one day national work shop on 'Combustion & CFD modelling of IC engine' on 15th April 2009 in BIET,Davanagere. He has the credit of publishing 58 research articles in National and International Conferences /Journals. He has chaired session at national conference on 'Trends and Innovation in Automation, Materials and Thermal Power Engineering (TIAMTE-2015)' in VTU PG Studies, Mysore and He worked as BOE for Kuvempu and Davanagere university. He was invited for technical talks in various institutes. He was a chairperson for many national and International conference He worked as convenor for VTU youth festival 2014 held at BIET Davanagere. He is working as Warden for BIET boy's hostel, since 2014"
  ]
},
{
  "tag": "ugmech infrastrucure",
  "patterns": [
    "infrastructure of mechanical",
    "how many classes are available in mech",
    "in which room mechanical students should sit"
  ],
  "responses": [
     " M101<br> M-301<br> M307 <br>M-107 <br>M-108<br> M-201<br> M007<br>M306<br> M-208"
  ]
},
{
  "tag": "ugmech library",
  "patterns": [
    "department library of Mechanical Engineering",
    "department library of Mech",
    "how is the department library of Mech."
  ],
  "responses": [
     "Library facility is available in our department which caters the need of the students and faculty members in the department.In Library there are about 1477 volumes related to Mechanical Engineering subjects, students project reports about 549, seminar reports and project CDs are available. The students and faculty members can utilize the department library apart from the central library and information centre, where about 18837 Volumes of books, with 4157 titles about 22 National Journals, 879 E BOOKS and 3775 Bound Volumes are available."
  ]
},
{
  "tag": "Mechanical placements",
  "patterns": [
    "department placements of mech",
    "total placements in the department of mech",
    "how are placements in department of mechanical.","Mech department average package"
  ],
  "responses": [
     "2023-24 total no of companies visited is 20 and total number of students hired on campus is 46 and students hires off campus is 4 and highest package is 4 lakhs.<br>2022-23 total no of companies visited is 30 no of students placed on campus is 35 and students hired offcampus is 6 and highest package is 6lakh.<br>2020-21 total no of companies visited is 10 and students placed in on campus is 10 and off campus 3 highest pacakage is 4 lakhs<br>2019-20 no of companies visited is 10 and students placed in on campus is 35 and off campus 7 highest pacakage is 10 lakhs<br>2018-192018-19 no of companies visited is 8 and students placed in on campus is 19 and off campus 6 highest pacakage is 4 lakhs<br>2017-18 no of companies visited is 8 and students placed in on campus is 32 and off campus 8 highest pacakage is 8 lakhs"
  ]
},
{
  "tag": "Mech faculty achievements",
  "patterns": [
    " mech faculty acheivements",
    "give me mech acheivements of lecturers",
    "staff mech acheivements in detail"
  ],
  "responses": [
    "Dr. Sharan A.S received Best Project award in the year-2015 by KSCST.<br>Dr. K. Sadashivappa received SRF award in the year-1992 by CSIR, New Delhli.<br>Dr. A G Shankara Murthy received fellowship for pursuing Ph.D at IIT Roorkee from AICTE under QIP scheme."
  ]
},
{
  "tag": "mech student achievements",
  "patterns": [
    "student achievements of mechanical Engineering",
    "student achievements of mech",
    "achievements of students of mech"
  ],
  "responses": [
    "Mr. Rajashekar, Mr. Raviprakash, Mr. Abhilash.N and Mr. Veeranagouda has participated in KSCST Seminar and Project Exhibition organised on 10 & 11th August 2018 obtained Best project of the year.<br>Mr.Vishnu R A and Mr. Diwakar babu has participated in (ANVESHANA- 2020) Science and Engineering Fair(Regional) on 15th & 17th January 2020 organized by Agastya international foundation,Hubli-Dharwad obtained 2nd prize of Rs 12,000 is received by the team.<br> Mr.Vinay Patil, Mr.Vinay kumar Hiremath , Mr.Prashanth T Y , Mr. Kumbar Rohith Ashok and Mr. Shivakumar Shankargouda Patil has participated in (SRISTI- 2019) 6th National level Technical project exhibition and Competition organised on 18th & 19th February 2019 by SAINTGITS College of Engineering, Pathamuttom P.O. Kottayam,Kerala awarded as Best Mechanical Engineering Project.<br> Ruqaiaya Mehwish , Final year student has won the Third Place Anveshana 2020-21 Science & Engineering between 28th to 29th , December 2020 Hubli<br>Ganesh D N, For winning the position as one of the TOP 10 Innovators in the 'Innovation Express 2021' organized by Times of India Organization, GlobalShala and Agastya International Foundation between 10th of January and 10th of February, 2021.<br> Mr. Hrishikesh has successfully participated in 'WASTE MANAGEMENT AND SANITATION' conducted from 22-12-2020 to 25-12-2020 as part of INDIA INTERNATIONAL SCIENCE FESTIVAL 2020( IISF 2020)<br> Aashish V Dandin, Abhishek R P, Alok K S and Manjula S E Awarded as Best Project of the year in student Project program (SPP) during the year 2020-21(44th series) held during 2021(online) by KSCST, IIT campus, Bangalore<br> Vikas A Vastrad and Yuvaraj T U Participated Awarded consolation prize in design and innovation clinic 2023 April 11th 2023<br>Girish P and Hrithik R Patil KPIT sparkle innovation contest and reaching the top 100th<br> Manoj Kumar V and Amruth J N Got 3rd Runner up prize of Design and Innovation Clinic held on June 6th -8th june 2022 at Central manufacturing technology institute (CMTI) Banglore<br> Manoj S K, Manoj Kumar V, Amruth J N and Puneeth K A Participated Awarded consolation prize in design and innovation clinic held on June 6th -8th june 2023 Central Manufacturing Technology Institute , CMTI Banglore<br> NIRMANA 3.0 In-house Project Exhibition was awarded best project entitled An Innovative Approach for Design and Fabrication of Soft and Stretchable Electronics Using Laser Induced Graphene on Polymide. Student associates are Manjunatha H M, Manoj N, Naveedahamed and Varunkumar C N held on 29-5-2023"
  ]
},
{
  "tag": "mech  department activities",
  "patterns": [
    "Activities of Mechanical engineering",
    "activities of mech",
    "do  mech branch participate in activities."
  ],
  "responses": [
     " Prof. Y. Vrushabhendrappa, Director BIET, delivered talk on success story of sponsored KSCST projects designed and developed by BIET, Davangere, held on 26th March 2019.<br> Graduation Day and Alumni Meet-2023 of 2022 graduate's batch students on 10th June 2023 at 09:00 AM at APJ Abdul Kalam seminar hall. Looking forward for your fruitful active participation in the Graduation Day and Alumni Meet.<br> Sri Sachin Keyyour, Senior Program Manager, A Deutsche Telekom group company, Bangalore, delivered a technical talk on 'STEM' on 9th May 2019.<br>Sri. Prasanna Kumar Shankar, MD & CEO, Maxpertise Technology Labs, delivered seminar on 'Connecting Engineering to Industry', held on 7th March 2019.<br> AICTE Model curriculum TEQUIP 1.3 workshop held at department of mechanical engineering on 29th & 30th April 2019.<br>Sri Manjunath B V delivered a talk on Future Mechanical Engineers he explained the Job opprtunities at various domin like Renewable Energy, Advanced oil and gas Exploration and recovery , Advanced materials , 3D printing,Energy storage , Next generation Genomics, Autonomous and near autonomous veichles, Advanced ROBOTICS, cloud teccnology, Intrenet of Things (IOT), Automation of Knowledge work , mobile Internet etc<br> Sri Raushan Kumar, 114th Rank holder UPSC Civil Services Examination 2019, Alumni 2010 batch inaugurated the MECH-I-PRIX, two days national level technical symposium, held on 9th May 2019.<br> KSCST project exhibition held on 25th May 2019 at Department of Mechanical Engineering.<br>Prof. Venugopal Bidaraguppa Former technical support specialist MOOG India, Technology center Bangalore, presently works at his own business institute, addressed the students on entrepreneurial opportunities. The principal Dr. M. C. Nataraja, the director Prof. Y. Vrushabhendrappa, were the chief guests. HOD Dr. S. Kumarappa, Dr. K. Sadashivappa, Dr. Thippeswamy Ekbote, Dr. G. Manavendra, Dr. K. C. Devendrappa, Dr. Shankar Murthy, forum coordinators and all faculty members were present on farewell function to the final year students on 25th May 2019.<br> Department of Mechanical Engineering organized an online webinar on 'Internship to Meet Corporate Expectations' on 18th August 2021. Dr. Sekhar S Iyer, Director MBA Program, Vivekananda school of Management Studies, Puttur, Dakshina Karnataka, was the invited speaker.<br> Royal Premier League, an interdepartmental cricket tournament was conducted by ROYAL MECH FORUM, selection of players was held by auction on base points for each team. The selection process was live telecast on Instagram. Initially league matches were held amongst the teams. Finals match was held on 6th May 2019and Mechanical engineering students team won the tournament. HOD Dr. S. Kumarappa, RPL coordinators Dr. G. Manavendra, Dr. K. C. Devendrappa, forum coordinators, staff members and students were present.<br> A virtual inter disciplinary project exhibition, NIRMANA 1.0, organized by our Institute (BIET), in which our students participated and exhibited their project, was held on 13th August 2021<br>Silver Jubilee of Alumni Meet of Mechanical Engineering 1989-93 batch held on 22nd September 2018.<br>Internship program for mechanical students organized in the department on Design and Development of Go-Kart from 10th July to 11th August 2018.<br>Smt. K M Janaki, Director KSBDB, Govt of Karnataka and Prof. S. Subramanian, Secretary, KSCST, IISC Bangalore inaugurated the KSCST Project Exhibition held at Department of Mechanical Engineering, on 10th August 2018.<br> 5-days workshop on 'Automation and Robotics', held from 22nd to 26th Jan 2018.<br>One day workshop on 'Vibration Measurement' organized by Mechanical Department held on 20th April 2018.<br> Three days Entrepreneurship Awareness camp'-DST-NIMAT Project, held on 14th  16th March 2018, Rajashekar P. Patil, Joint Director, CEDOK, Davangere was the chief guest.<br> Silver Jubilee of Alumni meet of Mechanical Engineering 1988-92 batch held on 10th February 2018.<br> IN-HOUSE PROJECT EXHIBITION DAY held at department of mechanical engineering, BIET on 22nd JUNE 2017. Inaugurated by Dr K R Sreenivas senior scientist (JNCASAR) Bangalore.<br>Department of Mechanical Engineering, B.I.E.T., Davangere, in association with Rove Labs, Bangalore Conducted 3 days 'Advanced Robotics Workshop' from 18  20 April 2017<br> Royal Premier League (RPL) Cricket Event was started on 26th Feb 2017 and Completed on 16th March 2017. Totally 6 Teams Participated in the event. Royal Riders (Dept. Of Mech. Engineering) became the winners of RPL. E C Scorchers (Dept. Of E & C) became the runners of the event.<br> Department of Mechanical Engineering, B.I.E.T., Davangere in association with Rectangle Automotive Technologies, Conducted one week 'Engine Technology Internship' Workshop (Hands on Training) from 2327 February 2017.<br> Virtual webinar on Toyota Hybrid Technology by Mr. Arjun Muralidharan Senior officer Toyota Kirloskar Motor Pvt. Ltd, Bangalore on 5th June 2021    Virtual webinar on Advanced CNC Machines and Additive Manufacturing 3D Printing by Mr. Naveen R Karki, Managing Director Naveen Engineering Service, Hubli, on 15th June 2021<br>Department of Mechanical Engineering in association with ISTE, Conducted an Online Webinar on HYBRID VEHICLES on 5th June 2021. Mr. Arjun Muralitharan, Senior Officer, Toyota Kirloskar Pvt ltd was the guest speaker."
  ]
},
{
  "tag": "ugmech number of lecturers",
  "patterns": [
    " total no of lecturers mechanical",
    "total teaching staff in mech "
   
  ],
  "responses": [
    "19"
  ]
},
{
  "tag": "ugmech labs",
  "patterns": [
    " total no of labs in mechanical department",
    "total labs in mech "
   
  ],
  "responses": [
    "9"
  ]
},
{
  "tag": "Mechanical Lecturers",
  "patterns": [
    "lecturers in mechanical department",
    "faculty members of mechanical department","Who are the lecturers in the mechanical department?",
    "Can you list the faculty members of the mechanical department?",
    "Tell me about the professors teaching in the mechanical department.",
    "I'd like to know the names of lecturers in the mechanical department."
  ],
  "responses": [
    "Dr. G Manavendra<br>Professor and HOD <br>Dr. S Kumarappa<br>Professor and Dean of Examination<br>Dr. K.C. Devendrappa<br>Professor and Dean of Alumni<br> Dr. A.G. Shankara Murthy<br> Professor and Dean R&D Dr. Sharan A.S.<br> Associate Professor<br> Mr. Umesh D.E<br>Assistant Professor<br>Mr. Umesh B.S<br>Assistant Professor <br> Mr. Krishna Murthy M<br>  Assistant Professor <br>Mr. Prashanth S.J<br>Assistant Professor<br> Dr. T.N. Vijay Kumar<br>Assistant Professor<br>Mr. Ashoka E.<br>Assistant Professor<br>Dr. Mohan T.R.<br>Assistant Professor<br>Mr. Hemanna K.B.<br>Assistant Professor<br>Dr. Vinayaka Patil A.B.<br>Assistant Professor<br>Dr.N.R. Pradeep<br>Assistant Professor<br>Mr. Ravikumar H.N.<br>Assistant Professor<br>Mrs. Sushma A Patil<br>Assistant Professor<br> Mr. Manjunatha G.M.<br>Assistant Professor"
  ]
},
{
  "tag": "ugmech technical staff",
  "patterns": [
    " who are technical staff of mech",
    "technical staff members of mechanical department "
   
  ],
  "responses": [
    " Mr. U.M. Suresh<br>Instructor<br>Mr. V.K. Mallikarjun<br>Instructor<br>Mr. Mruthyunjaya K.<br>Assistant Instructor<br>Mr Shivaraju G N<br>Assistant Instructor <br>Mr. K.R. Vedamurthy<br>  Mechanic<br> Mr. H.N. Ravikumar <br>  Mechanic<br>Mr. B.V. Nagendrachari<br>Mechanic<br>Mr. P. Veerachari<br>Mechanic<br>Mr. Babajan S<br>Machine Operator"
  ]
},
{
  "tag": "ugmech supporting staff",
  "patterns": [
    " who are supporting staff of mech",
    "supporting staff members of mechanical department "
   
  ],
  "responses": [
    "Mr. Ningappa H.<br>Peon<br> Mr. H. Halesh<br>Helper<br>Mr. Jagadeesh A.<br>Attender"
  ]
},
{
  "tag": "EEE Department Library",
  "patterns": [
      "EEE Department Library","about EEE library","about EEE Department Library"
  ],
  "responses": [
      "We have department library with 1567 books& 424 titles. Every year books are added to the library from the forum. Every semester two books are issued to students. Electrical and Electronics Engineering books available in the Central Library are 8685 with 1426 titles. Twenty Three National and International Journals have been subscribed to Central Library."
  ]
},
{
  "tag": "EEE Accredition",
  "patterns": [
      "EEE Accredition"
  ],
  "responses": [
      "BIET has already been accredited four times by National Board of Accreditation (NBA), New Delhi, during the year 2000, 2004,2008and2021."
  ]
},
{
  "tag": "EEE Total number of Labs",
  "patterns": [
      "EEE Total number of Labs"
  ],
  "responses": [
      "10"
  ]
},
{
  "tag": "EEE Labs",
  "patterns": [
      "EEE Labs","about EEE labs"
  ],
  "responses": [
      "1.Basic Electrical<br>2.Electrical Machines<br>3.Electronics Lb<br>4.Op-Amp & Linear ICs Lab<br>5.Power Electronics Lab<br>6.Microcontroller Lab<br>7.Control System Lab<br>8.Digital Signal Processing Lab<br>9.Power System Simulation lab<br>10. High Voltage and Relay Engineering Lab" 
  ]
},
{
  "tag": "total no of EEE faculties",
  "patterns": [
      "Total no of EEE faculties"
  ],
  "responses": [
      "11"
  ]
},
{
  "tag": "EEE classrooms",
  "patterns": [
      "EEE classrooms","about EEE classrooms","give about EEE classrooms"
  ],
  "responses": [
      "Electrical and Electronics department have 5 classrooms with carpet area of 120sq.m"
  ]
},
{
  "tag": "EEE Staff Achievements",
  "patterns": [
      "EEE Staff Achievements","give EEE Staff details"
  ],
  "responses": [
      "Dr M S Nagaraj Head of the department Reviewed IEEE Manuscript entitled 'Optimal Power Generation' in Energy Deficient Scenarios using Bagging Ensemble<br>Dr M S Nagaraj invited to chair the special sessions at international conference on applied and theoretical computing and communication Technology in Davangere<br>Dr.Anjaneya L H gave a Invited talk on 'Recent Methods in Acquisition and Processing of Electromyography' at Dept. of E&I, SJCE, Mysuru<br>T S Karibasavaraju was Judge for a event 'Diploma Project Exhibition-2K19' competition at JIT, Davangere<br>Dr.M.S.Nagaraj was judge for paper presentation competition at STJIT,Ranebennur<br>Dr.M.S.Nagaraj was given invited talk in sri devi college of engineering ,Tumkur<br>Dr. M.S.Nagaraj gave a invited talk in STJIT,Ranebennur<br>Dr. S R Basavarajappa , Assistant Professor, received the Ph.D. in 2022-2023 from VTU, Belagavi.<br>Dr. Shivakumar Swamy G M , Assistant Professor, received the Ph.D. in 2022-2023 from Srinivas University, Mangalore.<br>Dr Manjuntha H M ,Assistant Professor ,BOS and BOE member for UG and PG in MCE Hassan (Autonomous institute under VTU) 2016-2023.<br>Dr Manjunatha H M ,Assistant Professor Reviewer of technical papers in AICECS 2021 organized by Manipal Institute of Technology Manipal, India, October 28-30, 2021.<br>Dr Manjunatha H M ,Assistant Professor Reviewer for Journal of Cleaner Production, Elsevier Journal for the year 2023"
  ]
},
{
  "tag": "EEE Student Achievements",
  "patterns": [
      "EEE Student Achievements","give EEE Student Achievements details"
  ],
  "responses": [
      "Avinash.G has awarded by Sri Siddegowda, merit prize at the 'Annual Felicitation Function' for his performance in the Electrical and Electronics Engineering degree Examination held during the year 2017-18 held on 1st June 2019 at BIET, Davanage<br>Bhoomika A.M has awarded for securing first place in Third year B.E Electrical and Electronics Engineering at 'The Annual Felicitation Function' held on 1st June 2019 at BIET Davanagere.<br>Arpitha.S and Chandana A.P of fourth semester students secured FIRST prize in the paper presentation paper on title 'WITRICITY' held on 23rd February 2019 at SIT, Tumkur<br>Nayana.V.S & Apoorva.K.Radder of sixth semester students has secured SECOND prize in the paper presentation paper on title 'Automatic irrigation system using microcontroller' held on 24th March 2019 at SDM, Dharwad.<br>Joythi A.M of fourth semester student secured FIRST prize in the event Discuss Throw held on 10-04-2019 at BIET, Davanagere<br>Joythi A.M of fifth semester student secured FIRST prize in the event Drill, Skipping and Throw-Ball held from 2nd -11th August 2019 at BIET, Davangere<br>Sushma.M.S& team of seventh sem students secured FIRST prize in the event 'Tug of War' VIDYUTH-2019 held on 5th September 2019,BIET,Davangere.<br>Gundegowda & team of seventh sem students secured FIRST prize in the event 'Sherlock Homes' VIDYUTH-2019 held on 5th September 2019,BIET,Davangere<br>Chandan B R of first semester has secured FIRST and THIRD places in Singing duet and Solo Singing respectively on the eve of Student Induction Program -2020 held from 10th February 2020 to 15th February 2020 in Bapuji Institute of Engineering and Technology, Davangere.<br>Chandan B R of fifth semester has been recognized as a special achiever in Solo Singing at NCC Camp held in Toranagallu on 17th, November 2021.<br>Chandan B R of fifth semester has secured FIRST place in Guitar Competition in 'Yuvajanotsava 'a district level program on 14th December 2021, held at Davangere, Karnataka.<br>Kavya Mudigoudar of fifth semester has secured FIRST prize in 'Creative Writing in Kannada' held on 19th November 2021 on behalf of Kannada Rajyotsava celebration organized by the collaboration of NSS,ISTE,YRCW,IEI in Bapuji Institute of Engineering and Technology.<br>Priyanka M B of fifth semester has passed the' Certificate B' Examination as a cadet of NCC held in the year 2021 under the authority of ministry of defence ,Government of India.<br>Chandan B R of fifth semester has secured FIRST place in Guitar Competition in 'Rajya Yuvajanotsava 'held from 4th and 5th January 2022 in Mandya.<br>Suraj R K of 4th semester has been awarded 'JYOTISHYA RATNA ' , a Vedic Honorary Doctorate conducted in May 2022 by Gold Tree Astro ,India.<br>Anjali P S and Meghana B R of sixth semester have secured FIRST place in 'Waste to Wealth Designing 'in connection with 'Texcreative 22'held at department of Bapuji Institute of Engineering and Technology on 31st May and 1st June 2022.<br>Kavya Mudigoudar of sixth semester has secured THIRD prize in 'Creative Writing' Competition in inter-department Cultural Competitions held during 'Namma Davana'between 23rd to 25th June 2022 in Bapuji Institute of Engineering and Technology, Davangere.<br>Chandan B R of sixth semester has secured THIRD place in Light Vocal/Classical Singing Competition in inter-department Cultural Competitions held during 'Namma Davana 'between 23rd to 25th June 2022 in Bapuji Institute of Engineering and Technology, Davangere.<br>Sagar G G , Pavan S k ,Nuthan H P & Mahammed Mujthaba of 8th Semester presented a paper entitled 'Energy Management in Grid Tied Microgrid' in E-Belaku National Level Technical Symposium organized by AIT,Chikmagaluru and Bagged Third prize in the Competition held on 03.05.2023"
  ]
},{
  "tag": "EEE Technical Staff",
  "patterns": [
      "EEE Technical Staff","give EEE Technical Staff details "
  ],
  "responses": [
    "Mrs.Indira S H-Instructor<br> Mr.Maxim Tellis-Instructor<br>Mr. Siddeshi S-Instructor"
  ]
},
{
  "tag": "EEE Supporting Staff",
  "patterns": [
      "EEE Supporting Staff","give EEE Supporting Staff details "
  ],
  "responses": [
  "Vageesh kumar-Electrical Technician<br>Deepak M S-Instructor<br>Mahaboob Basha M-Instructor<br>Praveen kumar N R-Electrician<br>Yuvaraja O-Mechanic"
  ]
},
{
  "tag": "EEE Placements",
  "patterns": [
      " EEE Placements","Give EEE placements details","EEE department average package","EEE average package"
  ],
  "responses": [
      "Academic Year No. of companies visited No. of students hired Highest Package<br>In campus Off campus<br>2023-24 10 25 0 12<br>2022-23 10 18 0 4<br>2021-22 16 14 2 6<br>2020-21 22 14 9 5<br>2019-20 13 8 2 4<br>2018-19 10 7 6 4<br>2017-18 15 20 5 4<br>2016-17 4 20 2 4"
  ]
},
{
  "tag": "EEE PSOs",
  "patterns": [
      " EEE PSOs","what is the PEOs of EEE","give the PEOs of EEE"
  ],
  "responses": [
      "Ability to analyse power systems that efficiently generate, transmit, distribute and utilize electric powe<br>Able to design, develop and analysis of Modern Electric & Electronics systems and allied interdisciplinary areas using Conventional methods & Modern tools.<br>Aware of the impact of professional engineering solutions in societal, environmental context, professional ethics and be able to communicate effectively."
  ]
},
{
  "tag": "EEE HOD",
  "patterns": [
      "EEE HOD","who is the hod of EEE "
  ],
  "responses": [
      "Dr. M S Nagaraj, working as Professor & Head of the Electrical & Engineering Department since 2010 with 35 years of experience in teaching. He completed his B.E (E & E) degree from Government BDT College of Engineering, Davanagere, Mysore University in 1986 and perused his Master degree in Power systems from NIE, Mysore, Mysore University in 1990. He started his career as Lecturer in E&E Department at STJIT, Ranebennur, from 1986 to 1991and joined BIET in the year 1991. He has promoted as Assistant Professor in the year 2007. He received his doctorate from Visvesvaraya Technological University during 2008. Dr. M S Nagaraj promoted as Professor in the department of E& E during 2008. Presently, he is guiding 4 Ph.D students and 3 research scholars are awarded with Ph.D under VTU, Belagavi. He is Life Member of Indian Society for Technical Education and Member of Institution of Engineers (MIE). He has awarded as best teacher for several times from the college for achieving 100% result in various subjects handled. He arranged a workshop on 'Advanced Electrical Power Systems & Artificial Intelligent Techniques', from 11- 12 Feb2011, and 'Fuzzy Logic & it's Application to Power Systems', from 15-26, March 2004 in BIET, Davanagere. He has the credit of presenting / publishing papers in the National Conferences and International Conferences /Journals. He chair the special sessions at international conference on applied and theoretical computing and communication Technology in Davanagere and He was invited for technical talks in various colleges and BESCOM. He was chairperson for many national and International conference. He was judge for various paper presentation held in different college of VTU. He worked as BOE and BOS member of VTU, Kuvempu and Davanagere Universities and also worked as a Dean-Training and Placement at BIET ,Davangere"
  ]
},
{
  "tag": "EEE Faculties",
  "patterns": [
      "EEE Faculties","give EEE Faculties details"
  ],
  "responses": [
      "Dr M S Nagaraj-Professor & HoD<br>Dr Basavarajappa.S.R-Associate Professor<br>Dr Anjaneya L H-Associate Professor<br>Dr Manjunatha H M-Assistant Professor<br>Dr Shivakumarswamy.G.M-Assistant Professor<br>T S Karibasavaraju-Assistant Professor<br>Shilpa S K-Assistant Professor<br>Sowmya Anand-Assistant Professor<br>Prashanth kumar H K-Assistant Professor<br>Ashwini A R-Assitant Professor<br>Arun Kumar.P-Assistant Professor"
  ]
},
{
  "tag": "EEE MISSION",
  "patterns": [
    "EEE MISSION","what is the mision of EEE","give the mision of EEE","Can you tell me about the mission of the EEE department?",
      "Could you provide insights into the objectives of the EEE program?",
      "Describe the mission statement of the Electrical and Electronics Engineering department.",
      "What is the focus of the EEE department?",
      "Tell me the mission statement for EEE"
  ],
  "responses": [
      "To enhance the quality of life of students through continuous learning and state-of-the-art technical education.<br>To meet the long term needs of the industry & society.<br>To inculcate leadership qualities & ethical values.<br>To serve the Community for the socio economic developments."
  ]
},
{
  "tag": "ABOUT EEE",
  "patterns": [
      "ABOUT EEE","tell me about EEE"
  ],
  "responses": [
      "Department of Electrical & Electronics engineering was started in the year 1979 with an intake of 40 students. During 2009-2010, the intake has been enhanced to 60 due to increased demand for the course. The Department was accredited by National Board of Accreditation, AICTE, New Delhi for three times [1999-2011]. The department also recognized by The Institution of Engineers (India), Kolka<br>The Department has a broad based UG curriculum & the syllabi of the courses are continuously updated and the laboratories modernized to reflect the rapid changes in technology. The department is equipped with the latest experimental and computational facilities to meet the curriculum. The major laboratories in the department are Electronics, Microcontroller, Machines, Control system, Power system simulation & High voltage & relay.<br>Department is recognized as research center during 2009 from VTU, Belagavi and it offers quality research in the Ph.D program. Department is recognized as research center during 2009 from VTU, Belagavi. The department encourages faculty members / under graduate students to pursue higher studies in M Sc (Engg.) by research & doctoral programmes. Research scholars are working in the area of power systems and artificial intelligence.<br>The department has testing facilities for carrying out industry sponsored research and consultancy projects. Department is involved in consultancy work like testing of Motors, CTs, Energy meter and Transformer oil.<br>Department has Electrical forum. Students are motivated to develop co-circular & extra circular activities though forum. Every year, Electrical forum organize State level paper presentation 'IMPULSE' and interdepartmental competition 'VIDYUTH'.<br>Several lectures, workshops, and conferences are a regular feature in the Electrical &Electronics department. This is an opportunity to meet eminent speakers and exchange ideas. Regular technical tours are arranged to visit the electric power plants, substations, research institute switchgear industries etc.<br>Department will conduct training programs for students. Every year about 80% of our final students used to place in various organizations such as software companies, electricity board, hardware and construction companies.<br>We have department library with 1000 volumes & 500 titles. Every year books are added to the library from the forum. Two books are issued every semester to students and they can retain for entire one semester.<br>Students are trained under various programmes like Hard skills, Soft skills & Personality development programme. These training programmes are organized in collaboration with well known organizations. Seminars and Guest Lectures by experts from Industries and academicians are regularly being arranged through Industry Institute Partnership Cell (IIPC). The placement is found to be good and the students are placed in reputed companies like Infosys, TCS, MindTree, L &T, BEL, CYPRESS, CTS, Wipro, MSPl. About 80 % of eligible students are placed in reputed companies."
  ]
},
{
  "tag": "EEE VISION",
  "patterns": [
      "what is the vision of EEE","give  the vision of EEE","Can you tell me about the vision of the EEE department?",
      "What are the long-term goals of Electrical and Electronics Engineering?",
      "Could you provide insights into the future aspirations of the EEE program?",
      "What is the vision of the EEE department?",
      "Tell me the vision statement for Electrical and Electronics Engineering.",
      "What goals does the EEE department aim to achieve?"
  ],
  "responses": [
      "To train globally competent quality students in Electrical Engineering through excellent academic inputs, innovative ideas and team work."
  ]
},
{
  "tag": "EEE PEOs",
  "patterns": [
      " EEE PEOs","what is the PEOs of EEE","give the PEOs of EEE"
  ],
  "responses": [
      "The Electrical & Electronics Engineering graduates are able to<br>Successful in identifying, analyzing and solving variety of problems in the field of Electrical & Electronics Engineering.<br>Apply acquired knowledge in solving technological challenges of the industry and society with professional ethics and accountability.<br>Pursue a continual path of professional development along with advanced education and continuing enhancement programs, relevant to their specific career goals.<br>Adapt to emerging technologies and opportunities to work as team on multidisciplinary projects with effective communication skills and leadership qualities."
  ]
},
{
  "tag": "Civil Vision",
  "patterns": ["what is the Civil vision","Can you tell me about the vision of the Civil Engineering department?",
  "What are the long-term goals of Civil Engineering?",
  "Could you provide insights into the future aspirations of the Civil Engineering program?",
  "What is the vision of the Civil Engineering department?",
  "Tell me the vision statement for Civil Engineering.",
  "What goals does the Civil Engineering department aim to achieve?"],
  "responses": ["To train the students to become Civil Engineers with leadership qualities, having ability to take up professional assignments and research with a focus on innovative approaches to cater to the needs of the society."]
},
{
  "tag": "Civil Mission",
  "patterns": ["Civil Mission","what is the civil Mission","Can you tell me about the mission of the Civil Engineering department?",
  "Could you provide insights into the objectives of the Civil Engineering program?",
  "Describe the mission statement of the Civil Engineering department.",
  "What is the focus of the Civil Engineering department?",
  "Tell me the mission statement for Civil Engineering."],
  "responses": ["1.To provide quality education through up dated curriculum and conducive teaching learning environment for the students to excel in higher studies and competitive examinations and professional career.<br>2.To impart soft skills, leadership qualities and professional ethics among the graduates to handle the projects independently with confidence.<br>3.To deal with the contemporary issues and to cater to the socio economic needs.<br>4.To build industry institute interaction and to establish good rapport with alumni."]
},
{
  "tag": "Civil PEOs",
  "patterns": ["Civil Program Educational Objectives (PEOs)","what are the PEOs of the civil department"],
  "responses": ["1.Core Competence: Graduates will be able to plan, analyse, design and construct sustainable Civil Engineering Infrastructure.<br>2.Professional skills: Graduates will be professional engineers with a sense of ethics, creativity, leadership, self-confidence and independent thinking to cater to the needs of the society.<br>3.Societal needs: Graduates will be able to contribute effectively for the development of industry and professional bodies.<br>4.Cognitive Intelligence: Graduates will be able to take up competitive examinations, higher studies and involve in research and Entrepreneurship activities."]
},
{
  "tag": "Civil HOD",
  "patterns": ["Civil HOD"],
  "responses": ["Dr. S. Suresh <br>Dr. S. Suresh completed B. E. (Civil Engg.) at Bapuji Institute of Engineering and Technology, Davangere affiliated to University of Mysore. He obtained Masters Degree in Urban and Regional Planning from Mysore University, Mysore in the year 1988. He was awarded Ph. D. during the year 2008 from Kuvempu University. He started his career as Lecturer in the Department of Civil Engineering at Bapuji Institute of Engineering and Technology, Davangere from the year 1988. He was promoted as Assistant Professor and Later as Professor of Civil Engineering. At present he is working as Coordinator for M Tech programme in Environmental Engineering affiliated to Visvesvaraya Technological University, Belagavi. He is also head of Research Centre in Environmental Engineering at BIET. He has published number of papers in National and International Journals and attended many conferences at different places. He was member of Board of Examiners in different Universities. He has many funded research projects financed by AICTE and other organizations. In one of his major works he has been responsible for testing around 16000 bore well water samples from three districts of Karnataka. He extended his helping hand in restoration of Kundawada Lake which is a major source of drinking water for Davangere city. He is also a research guide and three students are working under him. He is member of District Expert Appraisal Committee of Davangere district under ministry of Environment and Forest. He has been actively involved in Consultancy services and his major area of interest in Drinking water treatment and sugar industries. Some of the major sugar industries that he has extended services are M/s. Renuka Sugars, Munoli, M/s. Renuka Sugars, Avalga, Gulbarga, M/s. Indian Cane Power Limited, Mudhol, etc. He has helped many sugar industries in setting up of ETP plants and obtaining licenses from Ministry of Environment and Forest and Pollution Control Boards."]
},
{
  "tag": "Civil Faculties",
  "patterns": ["Civil Name of Faculties","Total number of faculties in Civil","staff"],
  "responses": ["Dr H B Aravind-Professor<br>Dr Suresh S - Professor<br>Dr. Anila Kumar C P - Professor<br>Dr. C S Vijaya Kumar - Professor<br>Dr. M N Shivakumar  Professor<br>Dr. Chidananda G - Professor<br>Dr. Basavana Gowda S. N-Associate Professor<br>Sri.R S Chikkanagoudar-Assistant Professor<br>Sri. Raghu M E-Assistant Professor<br>Sri Vagish M-Assistant Professor<br>Sri. Praveen Kumar G B-Assistant Professor<br>Smt. Arpita D J-Assistant Professor<br>Sri. Chethan Gonni-Assistant Professor<br>Sri. Chandrashekar A R-Assistant Professor<br>Sri. Sathish G N-Assistant Professor<br>Sumana Y B-Assistant Professor<br>Akash C Arakere-Assistant Professor<br>Sharathraj R M-Assistant Professor<br>Shahabaz Hakeem-Assistant Professor<br>Savan R G Basavaraj-Assistant Professor<br>Supreeth-Assistant Professor<br>Nidarshana D P-Assistant Professor<br>Priyanka N-Assistant Professor","34"]
},
{
  "tag": "About civil",
  "patterns": ["About Civil Department"],
  "responses": ["The Department of Civil Engineering was established in the year 1979. It possesses state of the art facilities to cater to the needs of students. Department offers UG programme in Civil Engineering, PG programmes in Environmental Engineering and Structural Engineering. The department has two research centers viz.Environmental Science and TechnologyStudy Center and Civil Engineering researchcenter accommodating research scholars from various Institutes and Industries. The department has well experienced distinguished faculty with specialization in major areas of civil engineering. The department provides testing and consultancy services to various government and semi government agencies, contractors, construction industries and to the public in and around Davangere. The faculty members have good contact with reputed Institutions and professional bodies which will enable for the exchange of new technologies. The department is proud to have distinguished alumni doing excellent professional work at the global level."]
},
{
  "tag": "Civil PSOs",
  "patterns": ["Civil Program Specific Outcomes (PSOs)","what are the PSOs of the Civil department"],
  "responses": ["Students after the completion of the Program will be able to<br>1.Apply the fundamental concepts, software and codal provisions in the analysis, design and construction of sustainable civil engineering infrastructure<br>2.Inculcate professional and leadership qualities, sense of ethics and confidence related to Civil engineering<br>Faculty will be able t<br>3.Contribute to the overall development of civil engineering community through the professional bodies and offer services to the society."]
},
{
  "tag": "Civil Labs",
  "patterns": ["Civil Labs","Civil Laboratory"],
  "responses": ["1.CVL03-Environmental Engineering Laboratory<br>2.Auto CAD 1<br>3.Auto CAD 2<br>4.Geo technical Engineering Laboratory<br>5.Basic Material Testing laboratory<br>6.Surveying Lab<br>7.Concrete Laboratory and Highway Laboratory<br>8.CV205-Engineering Geology Laboratory"]
},
{
  "tag": "Civil no.labs",
  "patterns": ["Civil Total number of labs"],
  "responses": ["8"]
},
{
  "tag": "Civil Library",
  "patterns": ["Civil Department Library"],
  "responses": ["Department Library<br>The library at department level is for the Students and Faculty of Civil Engineering, which houses good number of textbooks, reference books, project and seminar reports. At present over 314 books with 230 titles, project reports, seminar reports & CD'S are available in the Department library. The National and International conference proceedings, workshop and seminar reports, product and textbook catalogues are kept for student's reference. Apart from the departmental library facility we have Central Library and Information Center. At Central Library, along with the standard books we have the facility of accessing various International and National Journals."]
},
{
  "tag": "Civil Technical Staff",
  "patterns": [" civil Technical Staff"],
  "responses": ["Pradeep S K-Instructor<br>aresh Kumar C-Intructor<br>Annapoorna-Assistant Instructor"]
},
{
  "tag": "Civil Supporting Staff",
  "patterns": ["civil Supporting Staff"],
  "responses": ["Kunneshi-Attender<br>Narappa-Peon<br>Rudresh K M-Peon<br>Punith-Peon"]
},
{
  "tag": "Civil DAB",
  "patterns": ["Civil Department Advisory Board (DAB) Members"],
  "responses": ["1 Prof. Y Vrushabhendrappa Director, BIET<br>2 Dr H B Aravind Principal,BIET<br>3 Dr. S Suresh Professor and Head PG (Environmental Engg ) Coordinator<br>4 Dr. Anila Kumar C P Professor<br>5 Dr. C S Vijaya Kumara Professor PG (Structural Engg) Coordinator<br>6 Dr. Sadashivappa K Professor and Dean (Academic)<br>7 Dr. M S Nagaraj Dean Training & Placement-BIET<br>8 Dr. G Chidananda Associate Professor and NBA Coordinator<br>9 Dr. Lokeshappa B Assoc. Prof., Dept. of Civil Engg., UBDTCE, Davangere<br>10 Sri. Y B Bharatha Raj Itagi Head of Civil Engg Dept, GMIT Davangere<br>11 Sri. Jagadeesh B V Superintendent Engineer - RDPR, Davangere<br>12 Sri. Halesh Parent Representative<br>13 Sri. Shivu R S Student Representative<br>14 Sri Rakesh A C Student Representative"]
},
{
  "tag": "Civil Accreditation",
  "patterns": ["Civil Accreditation"],
  "responses": ["BIET has already been accredited four times by National Board of Accreditation (NBA), New Delhi, during the year 2000, 2004, 2008 and 2021."]
},
{
  "tag": "Civil placement",
  "patterns": ["Civil Placement","Civil dept average package","Civil department average package","Can you provide information about the placements in the Civil department?"],
  "responses": ["Academic year No. of companies visited No. of students placed Highest Package Offered<br>In-campus Off-campus <br>2022-23 7 8 0 360000<br>2019-20 6 7 12 186000<br>2018-19 5 5 19 360000<br>2017-18 5 5 32 336875<br>2021-22 9 7 2 420000<br>2020-21 7 5 0 360000","3-12"]
},
{
  "tag": "Civil Staff Achievements",
  "patterns": ["Civil Staff Achievements"],
  "responses": ["Staff Achievements<br>1.Dr. H. B Aravind Awarded as Scientist of the year-2011 by National Environmental Science Academy, New Delhi - 110 019.<br>2.Dr. Suresh B Awarded as YOUNG ACHIEVER AWARD for research paper published in reputed International Journals for the year 2019 by Institute of Scholars, Department of Awards, #1338, 2nd Cross, 7th Block Sir M V Layout, Muddhinapalya Bengaluru-560091, Karnataka, India.<br>3.Dr. Suresh B awarded as BHARAT SHIKSHA RATAN AWARD for Individual contribution towards Economic Growth and Social Development by Global Society for Health & Educational Growth and The economic for Health and Educational Growth, New Delhi on 7th October 2017.<br>4.Dr. Suresh B awarded as SUNDERLAL BAHUGUNA YOUNG SCIENTIST AWARD for Valuable service and contribution to Environmental Science for the year 2011, by BOSE Science Society, Arimalam - 622201, Pudukkottai District, Tamilnadu, India.<br>5.As a part of Industry Institute Interaction programme, Sri. C S Vijaykumar, Assistant Professor visited TDSS new ware house project, for measuring 172000 sft at Dabbaspet on 8th Nov 2019 and between 16th December 2019 to 31st December 2019.<br>6.Dr. Suresh B Awarded as YOUNG SCIENTIST AWARD -2020 by National Environment Science Academy New Delhi.<br>7.Dr. G Chidananda and his project mates has got Best Project Award in Nirmana-3.0 In-house project exhibition hosted by BIET in association with ISTE, New Delhi Institute of Engineers, Kolkolata and IIC held on 29/05/23.<br>8.Sri G B Praveen Kumar is actively involved in organising Nirmana-3. 0 hosted by BIET"]
},
{
  "tag": "Civil Student Achievements",
  "patterns": ["Civil Student Achievements"],
  "responses": ["Student Achievements<br>1.PROJECT OF THE YEAR 2015, An Experimental investigation on Evaluation of Kinetic Parameters Co-efficient for the Treatment of Distillery waste using activated sludge process for the year 2015, selected by Karnataka State Council for Science and Technology, Bengaluru, Karnataka, India. Under Student project Programme (SPP) during the year 2014-2015 38th Series). Under the Guidance of Dr. G. P. Desai and Dr. Suresh B<br>2.Rakesh A C of fifth semester student participated in Design and Development Internship at Bangalore, from 8th July to 31st August 2019.<br>3.Manjunath Naik, Pooja K G, Kiran Arakeri, Akash, Abishek R, AnkithRaju R V, Veeresh T M, Piyush Ranjan, Pooja G R, Soumya K R, Rakshith G of fifth semester and Divya N K, Anup, Chetan Kumar M, Bharat Kumar, Kiran Deshpande, Karthik, , Netra, , Sheetal B Raj, Roopa S B, Swayamprabha, Bindu B N, Malaika T V, Matisha, Akilesh R and Shailesh G M of seventh semester students Participated in the events. Manjunath Naik, Pooja K G and Piyush Ranjan secured 1st place for Bob the Builder and Bindu B N and Malaika T V secured 3rd place for Tecno Paper at Advitiya-19, K.L.E Institute of Technology, Hubballi, on 20th and 21st September, 2019.<br>4.Kiran Deshpande of seventh semester student Participated in Two days Seminar on SURVEYING organized by INSTRUCT at Bangalore on 26th and 27th September 2019.<br>5.Suma R olekar, Kavya J L, Nisha V Shet, Ganavi K V, Sai Pratheek K S, Sathyanarayana, Darshan Kumar MH, Manoj M, Chethan N G, Rakshitha A M, Varshitha S, Harini K P, Monica R S, Jayalakshmi V, Niranjan B G, Vignesh M, Nihal Raj S J, Pooja K G, Sahana K, Shodhana D N, Salma D, Bhargav, Manjula M G, Tejas V, Kushal K B and Kashish of fifth semester students Participated in Industry Readiness Training Program Phase I , RaRo, Industry readiness Training Program BIET, Davanagere from 27th September 2019 to 3rd October 2019.<br>6.L V AmithKumar, Goutham S S, Manjula M G of seventh semester and Rakesh A C, Shreenidhi S V, Nisha Shet, Abishek R V, Chethan N G, Bharath K A, Gourav R, Bharathkumar H, Chethana M P, Akash, Gautham Raj M R, Anjan Kumar T C, Manoj M, Pavitra, Bhargav G T. Darshan Kumar M Halageli, Rakshitha A M, Ganavi K V of fifth semester participated in Concrete Fair 2019 at R V College of Engineering Bengaluru, on 15th and 16th October 2019.<br>7.Kruthika T P, Ravi N Ganji, Maruthi R, N K Divya, DivyaHangal, Chaitra R B, Shree Lakshmi M D, VanuPatil, Raghunath reddy N P, Ravi Teja K of seventh semester and Anusha A Doddamani, Apeksha B M, Salma D, Girija J Sharma, Monika R S, Pooja K G, Piyushranjan, Shreenidhi S V, Harini K P, Rakesh A C, Jayalakshmi V of fifth semester participated in Pravarthana -2019 at PESIT&M,Shivamogga on 24th October 2019.<br>8.L V Amith Kumar Pawar, Ganesh M, Goutham S.S, Jyoti M K, Archana J.S, Ashwini A Patil, Anusha B and Kruthika T P of seventh semester participated in NIRMAAN ICESS 2019, B M S College of Engineering Bengaluru, on 9th and 10th November 2019.<br>9.SOCIAL SERVICE: * Girija Sharma, Shreenidhi S V and Pooja K G of fifth semester participated in NCC CAMP Held at Toranagallu from 2nd to 11th August 2019<br>10.SPORTS:  Tejas R of seventh semester participated in Chess at S J M College, Chitradurga on 18th and 19th August 2019.  Tarun G V, Akash C M, Pradeep G K of third semester and Bharath Kumar K M, Bharath K of fifth semester participated in Athletics at GNDE College, Bidar on 22nd to 25th October 2019.  Mahantesh S Hallur of seventh semester and Bharath K A of fifth semester participated in Table Tennis at SIT, Tumkur on 16th and 17th November 2019."]
},
{
  "tag": "Civil Forum Activities",
  "patterns": ["Civil Forum Activities"],
  "responses": ["Forum Activities<br>Civil FORUM (CVFORUM)<br>From forum of civil engineering dept given farewell to the 2019-23 batch students on 1/6/2023 in civil engineering department...<br>The following events are conducted regularly by CVForum:<br>1.Inauguration of Civil Engineering ForumChief Guest Sri. B.V.Jagadeesh, Executive Engineer, PMGSY on 10/09//2016<br>2.Technical Talk Sri. Sanjay Pant Scientist & Director BIS,New Delhi on 05/10/2016<br>3.Technical Industrial visit Two Day Technical visit to Varahi Underground Power house (KPCL), an hydroelectric power project around Mangaluru from 13/10/2016 to 14/10/2016<br>"]
},
{
  "tag": "Civil Department Activities",
  "patterns": ["Civil Department Activities"],
  "responses": ["Department Activities<br>The following department activities were conducted:<br>Bapuji Institute of Engineering and Technology got Institutional Membership to 'Institute for Research Development and Training of Construction Trades and Management (INSTRUCT), Bangalore', on 15th July 2019 with membership No. IM 14.<br>Bapuji Institute of Engineering and Technology got Institutional Life Membership to 'Association of Consulting Civil Engineering (India) with life membership No. 7456<br>Bapuji Institute of Engineering and Technology became Life organizational member of 'Indian Water Works Association (IWWA), Mumbai, Maharashtra', on 27th July 2019 with membership No.1014.<br>The Department has MOU with Forum of Practicing Architects and Consulting Civil Engineers (FPACE), Davangere, accordingly 7th Semester students after their 6th semester examination carried out internship from 15th July 2019 to 14th August 2019.<br>Department of civil Engineering is also bringing out yearly newsletter 'CIVIL VOICE. The civil voice provides the information about departmental, faculty and students activities. Information such as technical talks, technical trips, site visits, alumni meets organized by the department are furnished. Faculty achievements, journal paper publications, FDPs attended information are provided. Further civil forum activities and student participation in inter / intra-college technical events are also provided.<br>Department of Civil Engineering successfully organized 3 days webinar on 'Concepts and Practices in Civil Engineering' from 07.06.2021 to 09.06.2021, in association with Institution of Engineers (I) - Davangere Local Centre and Indian Society for Technical Education - BIET Chapter. Webinar was organized on Microsoft Teams Platform. Eminent faculties from reputed Engineering Institutions gave technical talk on trending topics of Civil engineering. The webinar was attended by UG and PG students, Faculties of our Institution, Faculties of other Institutions and Practical Civil Engineers of Davangere.<br>Bapuji Institute of Engineering and Technology got Institutional Membership to 'Association of consulting Civil Engineers' (India) with membership No. 7456<br>Department of civil engineering has conducted World Environment Day on 5/6/2023 in the college campus at SSM Cultural Centre."]
},
{
  "tag": "Civil Class Rooms",
  "patterns": [" Civil Class rooms"],
  "responses": ["Classroom<br>The department has well furnished classrooms and seminar rooms to facilitate learning, discussions and outcome oriented learning. The specially designed classrooms are equipped with LCD projector & offer internet connectivity to enhance the learning process. It is used for conducting classes, presentations & webinars. The classrooms provide a very conducive environment for effective learning and objective is to provide students a hands-on experience and the right ambiance to stimulate learning. Spacious seminar hall is equipped with LCD projector and internet connectivity. The room can comfortably seat 100 people and is used for conducting classes, seminars and distinguished lectures.<br>CV 201 - 6 A<br>CV202 - 6B Class Room<br>CV305 8B Class Room<br>CV305 8B Class Room<br>CV301 - Class room<br>CV302 Seminar Hall<br>CV302 Seminar Hall<br>CV001 - 4A Class Room<br>CV105 -4B Class room<br>Cv102 A - Cad Room<br>Cv102 B - Cadd Room 2<br>Cv005 - Seminar Hall<br>Cv001 - Ist year class room<br>CV002 A - I st year class room<br>CV002 B - I st year class room"]
},
{
  "tag": "UG Admission",
  "patterns": ["Under Graduate Admission","UG admission",
  "How to apply for Under Graduate Admission?",
  "What is the process for UG admission?",
  "Requirements for Under Graduate Admission",
  "UG Admission procedure",
  "Information on UG admissions",
  "When does UG admission start?",
  "Deadline for UG admission applications",
  "Documents needed for UG admission"],
  "responses": ["Eligibility for Admission to B.E.Course(2023-2024):<br>A pass in II PUC/Intermediate/10+2 or any other equivalent examination with Physics and Mathematics as compulsory subjects along with Chemistry/Bio-Technology/Computer Science/Biology/Electronics as optional subjects with English as one of the languages of study with an minimum aggregate of 45% marks in the optional subjects (40% of marks for SC.ST.CAT-1 and OBC category)."]
},
{
  "tag": "civil Adimission",
  "patterns": ["civil Admission","Civil Engineering Admission",
  "Admission for Civil Engineering",
  "Intake for Civil Engineering admission",
  "Intake for Civil Engineering",
  "How many seats are available for Civil Engineering admission?",
  "What is the admission intake for Civil Engineering?",
  "Last year's Civil Engineering admission"],
  "responses": ["60 Intakes"]
},
{
  "tag": "civil Kea",
  "patterns": ["last year civil kea cet admission","civil Kea cet","Last year's Civil Engineering KEA CET admission",
  "Previous year civil KEA CET admission","civil Kea intake",
  "Civil Engineering admission through KEA CET last year",
  "How many seats were available for Civil Engineering through KEA CET last year?",
  "What was the intake for Civil Engineering via KEA CET in the previous year?"],
  "responses": ["45 Intakes"]
},
{
  "tag": "civil management",
  "patterns": ["last year civil management admission","civil management","Last year's Civil Engineering management admission",
  "Previous year civil management admission",
  "Civil Engineering admission under management quota last year",
  "How many seats are available for Civil Engineering under management quota?",
  "What was the intake for Civil Engineering under management quota in the previous year?"],
  "responses": ["15 Intakes"]
},
{
  "tag": "civil SNQ",
  "patterns": ["last year civil SNQ admission","civil SNQ","Last year's Civil Engineering SNQ admission",
  "Civil SNQ admission",
  "Previous year civil SNQ admission",
  "Civil Engineering admission under SNQ last year",
  "How many seats were available for Civil Engineering under SNQ last year?",
  "What was the intake for Civil Engineering under SNQ in the previous year?"],
  "responses": ["03 Intakes"]
},
{
  "tag": "Mechanical Adimission",
  "patterns": ["Mechanical Engineering Admission","MEch admission","last year Mech admission","ME admission Intake",
  "Admission to Mechanical Engineering",
  "Intake for Mechanical Engineering admission","Intake for Mech",
  "How many seats are available for Mechanical Engineering admission?",
  "What is the admission intake for Mechanical Engineering?",
  "Last year's Mechanical Engineering admission"],
  "responses": ["60 Intakes"]
},
{
  "tag": "Mechanical Kea",
  "patterns": ["last year Mechanical kea cet admission","Mechanical Kea cet","Mechanical Engineering admission through KEA CET",
  "Mechanical Engineering KEA CET admission",
  "Intake for Mechanical Engineering through KEA CET",
  "How many seats are available for Mechanical Engineering admission through KEA CET?",
  "What is the admission intake for Mechanical Engineering through KEA CET?",
  "Last year's Mechanical Engineering admission through KEA CET"],
  "responses": ["45 Intakes"]
},
{
  "tag": "Mechanical management",
  "patterns": ["last year Mechanical management admission","Mechanical management","Mechanical Engineering admission through management quota",
  "Management quota admission for Mechanical Engineering",
  "Intake for Mechanical Engineering through management quota",
  "How many seats are available for Mechanical Engineering admission through management quota?",
  "What is the admission intake for Mechanical Engineering through management quota?",
  "Last year's Mechanical Engineering admission through management quota"],
  "responses": ["15 Intakes"]
},
{
  "tag": "Mechanical SNQ",
  "patterns": ["last year Mechanical SNQ admission","Mechanical SNQ","Mechanical Engineering admission through SNQ",
  "SNQ admission for Mechanical Engineering","Mech SNQ seats intake",
  "Intake for Mechanical Engineering through SNQ",
  "How many seats are available for Mechanical Engineering admission through SNQ?",
  "What is the admission intake for Mechanical Engineering through SNQ?",
  "Last year's Mechanical Engineering admission through SNQ"],
  "responses": ["03 Intakes"]
},
{
  "tag": "Electronics communication Adimission",
  "patterns": ["Electronics communication Engineering Admission","ECE admission","Admission for Electronics and Communication Engineering",
  "Intake for ECE admission","Intake for ECE",
  "How many seats are available for Electronics and Communication Engineering admission?",
  "What is the admission intake for ECE?",
  "Last years ECE admission"],
  "responses": ["120 Intakes"]
},
{
  "tag": "Electronics communication Kea",
  "patterns": ["Electronics and Communication KEA Admission",
  "KEA admission for Electronics and Communication Engineering",
  "Last year Electronics and Communication KEA admission",
  "EC KEA cet",
  "Intake for EC KEA admission",
  "Intake for Electronics and Communication KEA",
  "How many seats are available for ec KEA admission?",
  "What is the admission intake for Electronics and Communication KEA?",
  "Last years Electronics and Communication KEA admission"],
  "responses": ["74 Intakes"]
},
{
  "tag": "Electronics communication management",
  "patterns": ["last year Electronics communication management admission","last year EC management admission",
  "Electronics communication management",
  "ECE management intake",
  "What is the intake capacity for ECE management?",
  "Tell me about the management admission intake for Electronics and Communication Engineering.",
  "Can you provide details about the management intake for ECE?",
  "What is the number of seats available for management admission in ECE?",
  "Give me information about the management quota intake for ECE.",
  "How many students are admitted through management quota in ECE?",
  "What is the total intake for ECE management admissions?"],
  "responses": ["30 Intakes"]
},
{
  "tag": "Electronics communication SNQ",
  "patterns": ["last year Electronics communication SNQ admission","Electronics communication SNQ","What is the intake for EC SNQ?",
  "How many intakes are there for Electronics communication SNQ?","ECE SNQ intake",
  "I want to apply for Electronics communication SNQ. What should I do?",
  "Is there any reservation policy for Electronics communication SNQ?"],
  "responses": ["06 Intakes"]
},
{
  "tag": "Electronics communication comedk",
  "patterns": ["last year Electronics communication comedk admission","Electronics communication comedk","What is the intake for Electronics communication in comedk?",
  "How many seats are available for Electronics communication in comedk?","EC comedk intake","Number of intake for ec comedk"],
  "responses": ["16 Intakes"]
},
{
  "tag": "Computer Science & Engineering Adimission",
  "patterns": ["Computer Science & Engineering Admission",
  "CSE admission",
  "Admission for Computer Science & Engineering",
  "Intake for CSE admission",
  "Intake for CSE","CSE intake",
  "How many seats are available for Computer Science & Engineering admission?",
  "What is the admission intake for CSE?",
  "Last years CSE admission"],
  "responses": ["240 Intakes"]
},
{
  "tag": "Computer Science & Engineering Kea",
  "patterns": ["Computer Science & Engineering KEA Admission",
  "KEA admission for Computer Science & Engineering",
  "Last year Computer Science & Engineering KEA admission",
  "Computer Science & Engineering KEA cet",
  "Intake for Computer Science & Engineering KEA admission",
  "Intake for CSE KEA","CSE KEA intake",
  "How many seats are available for Computer Science & Engineering KEA admission?",
  "What is the admission intake for CSE KEA?",
  "Last years CSE KEA admission"],
  "responses": ["108 Intakes"]
},
{
  "tag": "Computer Science comedk",
  "patterns": ["last year Computer science comedk cse admission",
  "Computer science comedk cse",
  "What is the intake for Computer science in comedk cse?",
  "How many seats are available for Computer science in comedk cse?",
  "CSE comedk intake",
  "Number of intake for CSE in comedk"],
  "responses": ["72 Intakes"]
},
{
  "tag": "Computer Science & Engineering management",
  "patterns": ["Last year Computer Science & Engineering management admission",
  "Last year CSE management admission",
  "Computer Science & Engineering management",
  "CSE management intake",
  "What is the intake capacity for Computer Science & Engineering management?",
  "Tell me about the management admission intake for CSE",
  "Can you provide details about the management intake for CSE?",
  "What is the number of seats available for management admission in Computer Science & Engineering?",
  "Give me information about the management quota intake for CSE.",
  "How many students are admitted through management quota in CSE?",
  "What is the total intake for Computer Science & Engineering management admissions?"],
  "responses": ["60 Intakes"]
},
{
  "tag": "Computer Science SNQ",
  "patterns": ["last year Computer Science SNQ admission", "Computer Science SNQ",
  "What is the intake for CSE SNQ?", "How many intakes are there for Computer Science SNQ?",
  "CSE SNQ intake", "I want to apply for Computer Science SNQ. What should I do?",
  "Is there any reservation policy for Computer Science SNQ?"],
  "responses": ["12 Intakes"]
},
{
  "tag": "Information Science & Engineering Adimission",
  "patterns": ["Information Science & Engineering Admission",
  "ISE admission",
  "Admission for Information Science & Engineering",
  "Intake for ISE admission",
  "Intake for ISE","ISE intake",
  "How many seats are available for Information Science & Engineering admission?",
  "What is the admission intake for ISE?",
  "Last years ISE admission"],
  "responses": ["180 Intakes"]
},
{
  "tag": "Information Science & Engineering Kea",
  "patterns": ["Information Science & Engineering KEA Admission",
  "KEA admission for Information Science",
  "Last year Information Science & Engineering KEA admission",
  "Information Science & Engineering KEA cet",
  "Intake for ISE KEA admission",
  "Intake for Information Science KEA",
  "How many seats are available for Information Science KEA admission?",
  "What is the admission intake for Information Science KEA?",
  "Last years Information Science & Engineering KEA admission"],
  "responses": ["81 Intakes"]
},
{
  "tag": "Information Science comedk",
  "patterns": ["last year Information Science comedk admission","Information Science comedk"],
  "responses": ["54 Intakes"]
},
{
  "tag": "Information Science & Engineering management",
  "patterns": ["Last year Information Science & Engineering management admission",
  "Last year ISE management admission",
  "Information Science & Engineering management",
  "ISE management intake",
  "What is the intake capacity for ISE management?",
  "Tell me about the management admission intake for Information Science & Engineering.",
  "Can you provide details about the management intake for ISE?",
  "What is the number of seats available for management admission in ISE?",
  "Give me information about the management quota intake for ISE.",
  "How many students are admitted through management quota in ISE?",
  "What is the total intake for ISE management admissions?"],
  "responses": ["45 Intakes"]
},
{
  "tag": "Information Science SNQ",
  "patterns": ["last year Information Science SNQ admission",
  "Information Science SNQ",
  "What is the intake for Information Science SNQ?",
  "How many intakes are there for Information Science SNQ?",
  "ISE SNQ intake",
  "I want to apply for Information Science SNQ. What should I do?",
  "Is there any reservation policy for Information Science SNQ?"],
  "responses": ["9 Intakes"]
},

{
  "tag": "Electrical & Electronics & Engineering Adimission",
  "patterns": ["Electrical & Electronics Engineering Admission",
  "EEE admission",
  "Admission for Electrical & Electronics Engineering",
  "Intake for EEE admission",
  "Intake for EEE","EEE intake",
  "How many seats are available for Electrical & Electronics Engineering admission?",
  "What is the admission intake for EEE?",
  "Last years EEE admission"],
  "responses": ["60 Intakes"]
},
{
  "tag": "Electrical & Electronics & Engineering Kea",
  "patterns": ["Electrical & Electronics KEA Admission",
  "KEA admission for Electrical & Electronics Engineering",
  "Last year Electrical & Electronics KEA admission",
  "Electrical & Electronics KEA cet",
  "Intake for Electrical & Electronics KEA admission",
  "Intake for Electrical & Electronics KEA",
  "How many seats are available for Electrical & Electronics KEA admission?",
  "What is the admission intake for Electrical & Electronics KEA?",
  "Last years Electrical & Electronics KEA admission"],
  "responses": ["37 Intakes"]
},
{
  "tag": "Electrical & Electronics comedk",
  "patterns": ["Electrical & Electronics comedk Admission",
  "comedk admission for Electrical & Electronics",
  "Last year EEE KEA admission",
  "Electrical KEA cet",
  "Intake for Electrical & Electronics KEA admission",
  "Intake for Electrical & Electronics KEA",
  "How many seats are available for Electrical & Electronics KEA admission?",
  "What is the admission intake for EEE KEA?",
  "Last years Electrical & Electronics KEA admission"],
  "responses": ["08 Intakes"]
},
{
  "tag": "Electrical & Electronics & Engineering management",
  "patterns": ["Last year Electrical & Electronics management admission",
  "Last year EEE management admission",
  "Electrical & Electronics Engineering management",
  "EEE management intake",
  "What is the intake capacity for EEE management?",
  "Tell me about the management admission intake for Electrical & Electronics Engineering.",
  "Can you provide details about the management intake for EEE?",
  "What is the number of seats available for management admission in EEE?",
  "Give me information about the management quota intake for EEE.",
  "How many students are admitted through management quota in EEE?",
  "What is the total intake for EEE management admissions?"],
  "responses": ["15 Intakes"]
},
{
  "tag": "Electrical & Electronics SNQ",
  "patterns": ["last year Electrical & Electronics SNQ admission", "Electrical & Electronics SNQ", "What is the intake for EEE SNQ?",
  "How many intakes are there for Electrical & Electronics SNQ?", "EEE SNQ intake",
  "I want to apply for Electrical & Electronics SNQ. What should I do?",
  "Is there any reservation policy for Electrical & Electronics SNQ?"],
  "responses": ["03 Intakes"]
},
{
  "tag": "Data Science Adimission",
  "patterns": ["Data Science Admission",
  "Admission for Data Science",
  "Intake for Data Science admission",
  "Intake for Data Science",
  "How many seats are available for Data Science admission?",
  "What is the admission intake for Data Science?",
  "Last years Data Science admission"],
  "responses": ["60 Intakes"]
},
{
  "tag": "Data Science Kea",
  "patterns": ["Data Science KEA Admission",
  "KEA admission for Data Science",
  "Last year Data Science KEA admission",
  "Data Science KEA cet",
  "Intake for Data Science KEA admission",
  "Intake for Data Science KEA",
  "How many seats are available for Data Science KEA admission?",
  "What is the admission intake for Data Science KEA?",
  "Last year's Data Science KEA admission"],
  "responses": ["27 Intakes"]
},
{
  "tag": "Data Science comedk",
  "patterns": ["last year Data Science comedk admission",
  "Data Science comedk",
  "What is the intake for Data Science in comedk?",
  "How many seats are available for Data Science in comedk?",
  "Data Science comedk intake",
  "Number of intake for Data Science comedk"],
  "responses": ["18 Intakes"]
},
{
  "tag": "Data Science management",
  "patterns": ["Last year Data Science management admission",
  "Last year DS management admission",
  "Data Science management",
  "DS management intake",
  "What is the intake capacity for Data Science management?",
  "Tell me about the management admission intake for Data Science.",
  "Can you provide details about the management intake for Data Science?",
  "What is the number of seats available for management admission in Data Science?",
  "Give me information about the management quota intake for Data Science.",
  "How many students are admitted through management quota in Data Science?",
  "What is the total intake for Data Science management admissions?"],
  "responses": ["15 Intakes"]
},
{
  "tag": "Data Science SNQ",
  "patterns": ["last year Data Science SNQ admission","Data Science SNQ","What is the intake for Data Science SNQ?",
  "How many intakes are there for Data Science SNQ?","Data Science SNQ intake",
  "I want to apply for Data Science SNQ. What should I do?",
  "Is there any reservation policy for Data Science SNQ?"],
  "responses": ["03 Intakes"]
},

{
  "tag": "Computer Science and Business Systems Adimission",
  "patterns": ["Computer Science and Business Systems Admission",
  "Admission for CSBS",
  "Intake for CSBS admission",
  "Intake for CSBS",
  "How many seats are available for CSBS admission?",
  "What is the admission intake for CSBS?",
  "Last years CSBS admission"],
  "responses": ["60 Intakes"]
},
{
  "tag": "Computer Science and Business Systems Kea",
  "patterns": [ "Computer Science and Business Systems KEA Admission",
  "KEA admission for Computer Science and Business Systems",
  "Last year Computer Science and Business Systems KEA admission",
  "Computer Science and Business Systems KEA cet",
  "Intake for Computer Science and Business Systems KEA admission",
  "Intake for Computer Science and Business Systems KEA",
  "How many seats are available for Computer Science and Business Systems KEA admission?",
  "What is the admission intake for Computer Science and Business Systems KEA?",
  "Last year's Computer Science and Business Systems KEA admission"],
  "responses": ["27 Intakes"]
},
{
  "tag": "Computer Science and Business Systems comedk",
  "patterns": ["last year CSBS comedk admission",
  "CSBS comedk",
  "What is the intake for Computer Science and Business Systems in comedk?",
  "How many seats are available for CSBS in comedk?",
  "CSBS comedk intake",
  "Number of intake for CSBS comedk"],
  "responses": ["18 Intakes"]
},
{
  "tag": "Computer Science and Business Systems management",
  "patterns": ["Last year Computer Science and Business Systems management admission",
  "Last year CSBS management admission",
  "Computer Science and Business Systems management",
  "CSBS management intake",
  "What is the intake capacity for CSBS management?",
  "Tell me about the management admission intake for Computer Science and Business Systems.",
  "Can you provide details about the management intake for CSBS?",
  "What is the number of seats available for management admission in CSBS?",
  "Give me information about the management quota intake for CSBS.",
  "How many students are admitted through management quota in CSBS?",
  "What is the total intake for CSBS management admissions?"],
  "responses": ["15 Intakes"]
},
{
  "tag": "Computer Science and Business Systems SNQ",
  "patterns": ["last year CSBS SNQ admission","CSBS SNQ","What is the intake for CSBS SNQ?",
  "How many intakes are there for Computer Science and Business Systems SNQ?","CSBS SNQ intake",
  "I want to apply for CSBS SNQ. What should I do?",
  "Is there any reservation policy for CSBS SNQ?"],
  "responses": ["03"]
},
{
  "tag": "Computer Science and Design Adimission",
  "patterns": ["Computer Science and Design Admission",
  "Admission for Computer Science and Design",
  "Intake for Computer Science and Design admission",
  "Intake for Computer Science and Design",
  "How many seats are available for Computer Science and Design admission?",
  "What is the admission intake for Computer Science and Design?",
  "Last years Computer Science and Design admission"],
  "responses": ["60"]
},
{
  "tag": "Computer Science and Design Kea",
  "patterns": ["Computer Science and Design KEA Admission",
  "KEA admission for Computer Science and Design",
  "Last year Computer Science and Design KEA admission",
  "Computer Science and Design KEA cet",
  "Intake for Computer Science and Design KEA admission",
  "Intake for Computer Science and Design KEA",
  "How many seats are available for Computer Science and Design KEA admission?",
  "What is the admission intake for Computer Science and Design KEA?",
  "Last year's Computer Science and Design KEA admission"],
  "responses": ["27"]
},
{
  "tag": "Computer Science and Design comedk",
  "patterns": ["last year Computer Science and Design comedk admission",
  "Computer Science and Design comedk",
  "What is the intake for Computer Science and Design in comedk?",
  "How many seats are available for Computer Science and Design in comedk?",
  "CS and Design comedk intake",
  "Number of intake for CS and Design comedk"],
  "responses": ["18"]
},
{
  "tag": "Computer Science and Design management",
  "patterns": ["Last year Computer Science and Design management admission",
  "Last year CS&D management admission",
  "Computer Science and Design management",
  "CS&D management intake",
  "What is the intake capacity for CS&D management?",
  "Tell me about the management admission intake for Computer Science and Design.",
  "Can you provide details about the management intake for CS&D?",
  "What is the number of seats available for management admission in CS&D?",
  "Give me information about the management quota intake for CS&D.",
  "How many students are admitted through management quota in CS&D?",
  "What is the total intake for CS&D management admissions?"],
  "responses": ["15"]
},
{
  "tag": "Computer Science and Design SNQ",
  "patterns": ["last year Computer Science and Design SNQ admission","Computer Science and Design SNQ","What is the intake for CS and Design SNQ?",
  "How many intakes are there for Computer Science and Design SNQ?","CS and Design SNQ intake",
  "I want to apply for Computer Science and Design SNQ. What should I do?",
  "Is there any reservation policy for Computer Science and Design SNQ?"],
  "responses": ["03"]
},
{
  "tag": "Artificial Intelligence and Machine Learning Adimission",
  "patterns": ["Artificial Intelligence and Machine Learning Admission",
  "Admission for Artificial Intelligence and Machine Learning",
  "Intake for AIML",
  "Intake for Artificial Intelligence and Machine Learning",
  "How many seats are available for Artificial Intelligence and Machine Learning admission?",
  "What is the admission intake for AIML?",
  "Last years AIML admission"],
  "responses": ["120"]
},
{
  "tag": "Artificial Intelligence and Machine Learning Kea",
  "patterns": ["Artificial Intelligence and Machine Learning KEA Admission",
  "KEA admission for Artificial Intelligence and Machine Learning",
  "Last year Artificial Intelligence and Machine Learning KEA admission",
  "Artificial Intelligence and Machine Learning KEA cet",
  "Intake for Artificial Intelligence and Machine Learning KEA admission",
  "Intake for Artificial Intelligence and Machine Learning KEA",
  "How many seats are available for Artificial Intelligence and Machine Learning KEA admission?",
  "What is the admission intake for Artificial Intelligence and Machine Learning KEA?",
  "Last year's Artificial Intelligence and Machine Learning KEA admission"],
  "responses": ["54"]
},
{
  "tag": "Artificial Intelligence and Machine Learning comedk",
  "patterns": ["last year Artificial Intelligence and Machine Learning comedk aiml admission",
  "Artificial Intelligence and Machine Learning comedk aiml",
  "What is the intake for Artificial Intelligence and Machine Learning in comedk aiml?",
  "How many seats are available for Artificial Intelligence and Machine Learning in comedk aiml?",
  "AIML comedk intake",
  "Number of intake for AIML comedk"],
  "responses": ["36"]
},
{
  "tag": "Artificial Intelligence and Machine Learning management",
  "patterns": ["Last year Artificial Intelligence and Machine Learning management admission",
  "Last year AIML management admission",
  "Artificial Intelligence and Machine Learning management",
  "AIML management intake",
  "What is the intake capacity for AIML management?",
  "Tell me about the management admission intake for Artificial Intelligence and Machine Learning.",
  "Can you provide details about the management intake for AIML?",
  "What is the number of seats available for management admission in AIML?",
  "Give me information about the management quota intake for Artificial Intelligence and Machine Learning.",
  "How many students are admitted through management quota in AIML?",
  "What is the total intake for AIML management admissions?"],
  "responses": ["30"]
},
{
  "tag": "Artificial Intelligence and Machine Learning SNQ",
  "patterns": ["last year Artificial Intelligence and Machine Learning SNQ admission",
  "Artificial Intelligence and Machine Learning SNQ",
  "What is the intake for AIML SNQ?",
  "How many intakes are there for Artificial Intelligence and Machine Learning SNQ?",
  "AIML SNQ intake",
  "I want to apply for Artificial Intelligence and Machine Learning SNQ. What should I do?",
  "Is there any reservation policy for Artificial Intelligence and Machine Learning SNQ?"],
  "responses": ["06"]
},

{
  "tag": "total Adimission in 2022-23",
  "patterns": ["Total Admission in 2022-23","last year Total admission"],
  "responses": ["1120"]
},
{
  "tag": "Total Kea Admission",
  "patterns": ["last year Total kea cet admission","Total Kea cet Admission","Total admission through KEA CET last year",
  "Number of students admitted through KEA CET in the previous year",
  "Total seats filled through KEA CET last year",
  "How many students got admission through KEA CET last year?",
  "Number of students who enrolled through KEA CET last year"],
  "responses": ["600"]
},
{
  "tag": "Total comedk Admission",
  "patterns": ["last year Total comedk admission","Total comedk Admission","Total number of students admitted through comedk last year",
  "How many students got admission through comedk in the previous year?",
  "What was the total comedk admission in the last academic year?",
  "comedk admission statistics for the previous year",
  "Number of students enrolled through comedk last year"],
  "responses": ["240"]
},
{
  "tag": "Total management Admission",
  "patterns": ["last year Total management admission","Total management Admission","How many students got admitted in Total Management last year?",
  "What was the total admission count for Total Management?",
  "Total management admission statistics for last year?",
  "Number of students enrolled in Total Management last year?",
  "Can you provide information about admissions in Total Management?"],
  "responses": ["280"]
},
{
  "tag": "Total SNQ Admission",
  "patterns": ["last year Total SNQ admission","Total SNQ Admission","total SNQ admissions last year",
  "number of students admitted through SNQ last year",
  "how many students got admission through SNQ last year",
  "SNQ admissions for the previous year",
  "number of students admitted under SNQ"],
  "responses": ["56"]
},
{
  "tag": "civil Kea Fee",
  "patterns": ["last year civil kea cet fee","civil Kea cet fee","civil cet fee"],
  "responses": ["1,29,672.00"]
},
{
  "tag": "civil Comedk fee",
  "patterns": ["last year civil comedk admission fee","civil comedk fee"],
  "responses": ["1,29,672.00"]
},
{
  "tag": "civil management fee",
  "patterns": ["last year civil management admission fee","civil management fee"],
  "responses": ["1,29,672.00"]
},
{
  "tag": "civil SNQ fee",
  "patterns": ["last year civil SNQ admission fee","civil SNQ fee"],
  "responses": ["50,610.00"]
},
{
  "tag": "Computer Science  Toatal Adimission",
  "patterns": ["Computer Science Engineering total Admission","last year CSE total admission","How many students got admitted to Computer Science Engineering last year?",
  "What is the total admission count for Computer Science Engineering?",
  "Number of admissions in Computer Science Engineering last year?",
  "CSE total admissions last year?"],
  "responses": ["240"]
},
{
  "tag": "Computer Science Kea Fee",
  "patterns": ["last year Computer Science kea cet fee","Computer Science Kea cet fee","Computer Science cet fee","CSE kea cet fee","CS kea fee"],
  "responses": ["1,29,672.00"]
},
{
  "tag": "Computer Science Comedk fee",
  "patterns": ["last year Computer Science comedk admission fee","last year Computer Science COMEDK fee",
  "Computer Science COMEDK fee",
  "CSE COMEDK fee",
  "CS COMEDK fee"],
  "responses": ["2,24,546.00"]
},
{
  "tag": "Computer Science management fee",
  "patterns": ["last year Computer Science management admission fee","Last year Computer Science management quota fee",
  "Computer Science management fee",
  "CSE management fee",
  "CS management quota fee"],
  "responses": ["2,24,546.00"]
},
{
  "tag": "Computer Science SNQ fee",
  "patterns": ["What was the last year fee for Computer Science through SNQ?",
  "Computer Science SNQ fee last year",
  "Fee for Computer Science through SNQ",
  "SNQ fee for Computer Science",
  "CSE SNQ fee",
  "CS SNQ fee"],
  "responses": ["50,610.00"]
},

{
  "tag": "Information Science  Toatal Adimission",
  "patterns": ["Information Science Engineering total Admission","ISE admission"],
  "responses": ["180"]
},
{
  "tag": "Information Science Kea Fee",
  "patterns": ["last year Information Science kea cet fee","Information Science Kea cet fee","Information Science cet fee",
  "IS kea cet fee","ISe cet fee",
  "Info Sci kea fee"],
  "responses": ["1,29,672.00"]
},
{
  "tag": "Information Science Comedk fee",
  "patterns": ["last year Information Science comedk admission fee","Information Science comedk fee","Last year Information Science COMEDK fee",
  "What was the COMEDK fee for Information Science last year?",
  "Information Science COMEDK CET fee last year",
  "Fee for Information Science through COMEDK",
  "COMEDK fee for Information Science"],
  "responses": ["2,24,546.00"]
},
{
  "tag": "Information Science management fee",
  "patterns": ["last year Information Science management admission fee","Information Science management fee","last year Information Science Management fee",
  "Information Science Management fee",
  "Information Science Management fee",
  "IS management fee"],
  "responses": ["2,24,546.00"]
},
{
  "tag": "Information Science SNQ fee",
  "patterns": ["last year Information Science SNQ admission fee","Information Science SNQ fee","last year Information Science SNQ fee",
  "Information Science SNQ fee",
  "Information Science SNQ fee",
  "IS SNQ fee"],
  "responses": ["50,610.00"]
},

{
  "tag": "AI&ML Toatal Adimission",
  "patterns": ["Artificial Intelligence and Machine learning total Admission","AI&ML admission"],
  "responses": ["120"]
},
{
  "tag": "Artificial Intelligence and Machine learning Kea Fee",
  "patterns": ["last year Artificial Intelligence and Machine Learning kea cet fee",
  "Artificial Intelligence and Machine Learning Kea cet fee",
  "Artificial Intelligence and Machine Learning cet fee",
  "AIML kea cet fee",
  "AI and ML kea fee"],
  "responses": ["1,29,672.00"]
},
{
  "tag": "Artificial Intelligence and Machine learning Comedk fee",
  "patterns": ["last year Artificial Intelligence and Machine learning comedk admission fee","Artificial Intelligence and Machine learning comedk fee","Last year Artificial Intelligence and Machine Learning COMEDK fee",
  "AI and ML COMEDK fee",
  "COMEDK fee for Artificial Intelligence and Machine Learning",
  "Artificial Intelligence and Machine Learning COMEDK fee last year",
  "AI and ML COMEDK fee last year",
  "What is the COMEDK fee for Artificial Intelligence and Machine Learning?"
],
  "responses": ["2,24,546.00"]
},
{
  "tag": "Artificial Intelligence and Machine learning management fee",
  "patterns": ["last year Artificial Intelligence and Machine learning management admission fee","Artificial Intelligence and Machine learning management fee","Last year Artificial Intelligence and Machine Learning management fee",
  "AI and ML management fee",
  "management fee for Artificial Intelligence and Machine Learning",
  "Artificial Intelligence and Machine Learning management fee last year",
  "AI and ML management fee last year",
  "What is the management fee for Artificial Intelligence and Machine Learning?"],
  "responses": ["2,24,546.00"]
},
{
  "tag": "Artificial Intelligence and Machine learning SNQ fee",
  "patterns": ["last year Artificial Intelligence and Machine learning SNQ admission fee","Artificial Intelligence and Machine learning SNQ fee","Last year Artificial Intelligence and Machine Learning SNQ fee",
  "AI and ML SNQ fee",
  "SNQ fee for Artificial Intelligence and Machine Learning",
  "Artificial Intelligence and Machine Learning SNQ fee last year",
  "AI and ML SNQ fee last year",
  "What is the SNQ fee for Artificial Intelligence and Machine Learning?"],
  "responses": ["50,610.00"]
},

{
  "tag": "CS&BS  Toatal Adimission",
  "patterns": ["computer science and business system total Admission","CS&BS admission"],
  "responses": ["60"]
},
{
  "tag": "computer science and business system Kea Fee",
  "patterns": ["Last year CSBS KEA CET fee",
  "CSBS KEA CET fee",
  "CS and Business Systems CET fee",
  "CSBS KEA fee",
  "CS and Business Systems KEA fee"],
  "responses": ["1,29,672.00"]
},
{
  "tag": "computer science and business system Comedk fee",
  "patterns": ["last year computer science and business system comedk admission fee",
  "computer science and business system comedk fee",
  "Last year Computer Science and Business System COMEDK fee",
  "CS and Business System COMEDK fee",
  "Computer Science and Business System fee for COMEDK"],
  "responses": ["2,24,546.00"]
},
{
  "tag": "computer science and business system management fee",
  "patterns": ["last year computer science and business system management admission fee",
  "computer science and business system management fee",
  "Last year Computer Science and Business System management fee",
  "CS and Business System management fee",
  "Computer Science and Business System fee for management"],
  "responses": ["2,24,546.00"]
},
{
  "tag": "computer science and business system SNQ fee",
  "patterns": ["last year computer science and business system SNQ admission fee",
  "computer science and business system SNQ fee",
  "Last year Computer Science and Business System SNQ fee",
  "CS and Business System SNQ fee",
  "Computer Science and Business System fee for SNQ"],
  "responses": ["50,610.00"]
},

{
  "tag": "Computer Science and design Toatal Adimission",
  "patterns": ["Computer Science and design system total Admission","Computer Science and design admission"],
  "responses": ["60"]
},
{
  "tag": "Computer Science and design system Kea Fee",
  "patterns": ["last year Computer Science and Design System kea cet fee",
  "Computer Science and Design System Kea cet fee",
  "Computer Science and Design System cet fee",
  "CSE and Design System kea cet fee",
  "CS and Design System kea fee"],
  "responses": ["1,29,672.00"]
},
{
  "tag": "Computer Science and design system Comedk fee",
  "patterns": ["last year Computer Science and design system comedk admission fee","Computer Science and design system comedk fee","Last year's fee for Computer Science and Design System through Comedk",
  "Computer Science and Design System Comedk fee last year",
  "Comedk fee for Computer Science and Design System",
  "What was the fee for CS and Design System through Comedk last year?",
  "CS and Design System Comedk fee"],
  "responses": ["2,24,546.00"]
},
{
  "tag": "Computer Science and design system management fee",
  "patterns": ["last year Computer Science and design system management admission fee","Computer Science and design system management fee","Last year's fee for Computer Science and Design System through management",
  "Computer Science and Design System management fee last year",
  "management fee for Computer Science and Design System",
  "What was the fee for CS and Design System through management last year?",
  "CS and Design System management fee"],
  "responses": ["2,24,546.00"]
},
{
  "tag": "Computer Science and design system SNQ fee",
  "patterns": ["last year Computer Science and design system SNQ admission fee","Computer Science and design system SNQ fee","Last year's fee for Computer Science and Design System through SNQ",
  "Computer Science and Design System SNQ fee last year",
  "SNQ fee for Computer Science and Design System",
  "What was the fee for CS and Design System through SNQ last year?",
  "CS and Design System SNQ fee"],
  "responses": ["50,610.00"]
},

{
  "tag": "Electronic and communication Toatal Adimission",
  "patterns": ["Electronic and communication system total Admission","Electronic and communication admission"],
  "responses": ["120"]
},
{
  "tag": "Electronic and communication Kea Fee",
  "patterns": ["Last year Electronic and Communication System KEA CET fee",
  "Electronic and Communication System KEA CET fee",
  "Electronic and Communication System CET fee",
  "ECE KEA CET fee",
  "ECE KEA fee"],
  "responses": ["1,29,672.00"]
},
{
  "tag": "Electronic and communication Comedk fee",
  "patterns": ["last year Electronic and communication comedk admission fee","Last year Electronic and Communication COMEDK fee",
  "Electronic and Communication COMEDK fee",
  "COMEDK fee for ECE",
  "ECE COMEDK fee"],
  "responses": ["2,24,546.00"]
},
{
  "tag": "Electronic and communication system management fee",
  "patterns": ["last year Electronic and communication management admission fee","Last year Electronic and Communication management fee",
  "Electronic and Communication management fee",
  "management fee for ECE",
  "ECE management fee"],
  "responses": ["2,24,546.00"]
},
{
  "tag": "Electronic and communication system SNQ fee",
  "patterns": ["last year Electronic and communication system SNQ admission fee","Last year Electronic and Communication SNQ fee",
  "Electronic and Communication SNQ fee",
  "SNQ fee for ECE",
  "ECE SNQ fee"],
  "responses": ["50,610.00"]
},

{
  "tag": "Data Science Toatal Adimission",
  "patterns": ["last year Electronic and communication system comedk admission fee","Last year Electronic and Communication COMEDK fee",
  "Electronic and Communication COMEDK fee",
  "COMEDK fee for ECE",
  "ECE COMEDK fee"],
  "responses": ["60"]
},
{
  "tag": "Data Science system Kea Fee",
  "patterns": ["last year Data Science System kea cet fee",
  "Data Science System Kea cet fee",
  "Data Science System cet fee",
  "DSS kea cet fee",
  "Data Science System kea fee"],
  "responses": ["1,29,672.00"]
},
{
  "tag": "Data Science system Comedk fee",
  "patterns": ["last year Data Science comedk admission fee","Data Science system comedk fee","last year Data Science comedk fee",
  "Data Science Comedk fee",
  "Data Science comedk fee",
  "DS comedk fee"],
  "responses": ["2,24,546.00"]
},
{
  "tag": "Data Science system management fee",
  "patterns": ["last year Data Science management admission fee","Data Science system management fee","last year Data Science management fee",
  "Data Science management fee",
  "Data Science management fee",
  "DS management fee"],
  "responses": ["2,24,546.00"]
},
{
  "tag": "Data Science system SNQ fee",
  "patterns": ["last year Data Science SNQ admission fee","Data Science system SNQ fee","last year Data Science SNQ fee",
  "Data Science SNQ fee",
  "Data Science SNQ fee",
  "DS SNQ fee"],
  "responses": ["50,610.00"]
},

{
  "tag": "Electrical and Electronics Toatal Adimission",
  "patterns": ["Electrical and Electronics system total Admission","Electrical and Electronics admission"],
  "responses": ["60"]
},
{
  "tag": "Electrical and Electronics system Kea Fee",
  "patterns": ["last year Electrical and Electronics System kea cet fee",
  "Electrical and Electronics System Kea cet fee",
  "Electrical and Electronics System cet fee",
  "EES kea cet fee",
  "EE kea fee"],
  "responses": ["1,29,672.00"]
},
{
  "tag": "Electrical and Electronics system Comedk fee",
  "patterns": ["last year Electrical and Electronics system comedk admission fee","Electrical and Electronics system comedk fee",
  "What was the COMEDK fee for Electrical and Electronics System last year?",
  "Last year's fee for Electrical and Electronics System through COMEDK?",
  "COMEDK fee for Electrical and Electronics System?",
  "Electrical and Electronics System COMEDK fee last year?",
  "Electrical and Electronics System fee for COMEDK?"],
  "responses": ["1,29,672.00"]
},
{
  "tag": "Electrical and Electronics system management fee",
  "patterns": ["last year Electrical and Electronics system comedk admission fee","Electrical and Electronics system comedk fee",
  "What was the COMEDK fee for Electrical and Electronics System last year?",
  "Last year's fee for Electrical and Electronics System through COMEDK?",
  "COMEDK fee for Electrical and Electronics System?",
  "Electrical and Electronics System COMEDK fee last year?",
  "Electrical and Electronics System fee for COMEDK?"],
  "responses": ["1,29,672.00"]
},
{
  "tag": "Electrical and Electronics system SNQ fee",
  "patterns": ["last year Electrical and Electronics system comedk admission fee","Electrical and Electronics comedk fee",
  "What was the COMEDK fee for Electrical and Electronics System last year?",
  "Last year's fee for Electrical and Electronics System through COMEDK?",
  "COMEDK fee for Electrical and Electronics System?",
  "EC COMEDK fee last year?",
  "ECE fee for COMEDK?"],
  "responses": ["50,610.00"]
},

{
  "tag": "Mechanical engineering Toatal Adimission",
  "patterns": ["Mechanical engineering system total Admission","Mechanical engineering admission"],
  "responses": ["60"]
},
{
  "tag": "Mechanical engineering system Kea Fee",
  "patterns": ["last year Mechanical engineering system kea cet fee","Mechanical engineering system Kea cet fee","Mechanical engineering system cet fee"],
  "responses": ["1,29,672.00"]
},
{
  "tag": "Mechanical engineering Comedk fee",
  "patterns": ["last year Mechanical engineering comedk admission fee","Mechanical engineering comedk fee","Last year Mech Comedk fee",
  "Mechanical Engineering Comedk fee",
  "Mechanical Engineering fee through Comedk",
  "Comedk fee for Mechanical Engineering",
  "Comedk fee for ME","Comedk fee for MECH"],
  "responses": ["1,29,672.00"]
},
{
  "tag": "Mechanical engineering management fee",
  "patterns": ["last year Mechanical engineering management admission fee","Mechanical engineering management fee","Last year Mech management fee",
  "Mechanical Engineering management fee",
  "Mechanical Engineering fee through management",
  "management fee for Mechanical Engineering",
  "management fee for ME","management fee for MECH"],
  "responses": ["1,29,672.00"]
},
{
  "tag": "Mechanical engineering system SNQ fee",
  "patterns": ["last year Mechanical engineering system SNQ admission fee","Mechanical engineering system SNQ fee","Last year Mech SNQ fee",
  "Mechanical Engineering SNQ fee",
  "Mechanical Engineering fee through SNQ",
  "SNQ fee for Mechanical Engineering",
  "SNQ fee for ME","Comedk fee for MECH"],
  "responses": ["50,610.00"]
},

{
  "tag": "Textile Technology Toatal Adimission",
  "patterns": ["Textile Technology total Admission"],
  "responses": ["40"]
},
{
  "tag": "Textile Technology Kea Fee",
  "patterns": ["last year Textile Technology kea cet fee","Textile Technology Kea cet fee","Textile Technology cet fee"],
  "responses": ["1,29,672.00"]
},
{
  "tag": "Textile Technology Comedk fee",
  "patterns": ["last year Textile Technology comedk admission fee","Textile Technology comedk fee"],
  "responses": ["1,29,672.00"]
},
{
  "tag": "Textile Technology management fee",
  "patterns": ["last year Textile Technology management admission fee","Textile Technology management fee"],
  "responses": ["1,29,672.00"]
},
{
  "tag": "Textile Technology system SNQ fee",
  "patterns": ["last year Textile Technology SNQ admission fee","Textile Technology SNQ fee"],
  "responses": ["50,610.00"]
},

{
  "tag": "Chemical Engineering Toatal Adimission",
  "patterns": ["Chemical Engineering total Admission","Chemical Engineering admission"],
  "responses": ["30"]
},
{
  "tag": "Chemical Engineering Kea Fee",
  "patterns": ["last year Chemical Engineering system kea cet fee","Chemical Engineering system Kea cet fee","Chemical Engineering system cet fee"],
  "responses": ["1,29,672.00"]
},
{
  "tag": "Chemical Engineering Comedk fee",
  "patterns": ["last year Chemical Engineering system comedk admission fee","Chemical Engineering system comedk fee"],
  "responses": ["1,29,672.00"]
},
{
  "tag": "Chemical Engineering management fee",
  "patterns": ["last year Chemical Engineering system management admission fee","Chemical Engineering system management fee"],
  "responses": ["1,29,672.00"]
},
{
  "tag": "Chemical Engineering SNQ fee",
  "patterns": ["last year Chemical Engineering system SNQ admission fee","Chemical Engineering system SNQ fee"],
  "responses": ["50,610.00"]
},

{
  "tag": "Bio Technology Toatal Adimission",
  "patterns": ["Bio Technology system total Admission","Bio Technology admission"],
  "responses": ["30"]
},
{
  "tag": "Bio Technology Kea Fee",
  "patterns": ["last year Bio Technology kea cet fee","Bio Technology Kea cet fee","Bio Technology cet fee"],
  "responses": ["1,29,672.00"]
},
{
  "tag": "Bio Technology Comedk fee",
  "patterns": ["last year Bio Technology comedk admission fee","Bio Technology comedk fee"],
  "responses": ["1,29,672.00"]
},
{
  "tag": "Bio Technology system management fee",
  "patterns": ["last year Bio Technology management admission fee","Bio Technology management fee"],
  "responses": ["1,29,672.00"]
},
{
  "tag": "Bio Technology system SNQ fee",
  "patterns": ["last year Bio Technology SNQ admission fee","Bio Technology SNQ fee"],
  "responses": ["50,610.00"]
},
{
  "tag": "IS Hostel available",
  "patterns": [
    "Is hostel available?","hostel facility?"
  ],
  "responses": [
      "yes hostel is available for both boys and girls"
  ]
},
{
  "tag": "IS bus available",
  "patterns": [
    "Is bus available?","bus facility?"
  ],
  "responses": [
      "no bus facility is not available"
  ]
},
{
  "tag":"BIET email",
  "patterns":[
      "BIET email","email address of BIET"
  ],
  "responses":[
      "principal@bietdvg.edu"
  ]
},
{
  "tag":"BIET Contact number",
  "patterns":[
      "BIET contact number","phone number","ph.no"
  ],
  "responses":[
      "+08192-222245"
  ]
},
{
  "tag":"BIET FAX number",
  "patterns":[
      "BIET fax number","fax number","ph.no"
  ],
  "responses":[
      "08192 - 223261"
  ]
},
{
  "tag":"BIET misssion",
  "patterns":[
      "BIET mission"
  ],
  "responses":[
      "BIET contributes to the growth and development of its students by imparting a broad based engineering education and empowering them to be successful in their chosen field by inculcating in them positive approach, leadership qualities and ethical values"
  ]
},
{
  "tag":"chairman",
  "patterns":[
      "chairman of BIET","who is the chairman of BIET?",
      "current chairman of BIET",
      "BIET chairman",
      "head of BIET"
  ],
  "responses":[
      "Dr. Shamanur Shivashankarappa"
  ]
},
{
  "tag":"Principal",
  "patterns":[
      "Principal","Who is the principal?",
      "Who is the head of the institution?",
      "Principal's name?",
      "Who leads the school/college?",
      "Principal's designation?",
      "Principal's identity?"
  ],
  "responses":[
      "Dr. H B Aravind"
  ]
},

{
  "tag":"Deans",
  "patterns":[
      "BIET Deans","Deans","Dean contacts",
      "Who are the deans?",
      "Contact details of deans",
      "Who can I contact regarding admissions?",
      "Who is responsible for training and placement?"
  ],
  "responses":["1.Dr. Leela.G.H Admissions leela_mahesh@rediffmail.com +919844474712<br>2. Dr. Nirmala C R Training and Placement placement@bietdvg.edu +919740770377<br>3. Dr. Kumarappa S. Examination drskumarappa@gmail.com +919341000364<br>4. Dr. A.G. Shankara Murthy Research & Development (R & D) agsiitr@gmail.com +919448240355<br>5. Dr. S.N. RAMESH Student Welfare rameshbietdvg@gmail.com +919845023378<br>6.Dr. Devendrappa K C Alumni Relations kcdbiet16@gmail.com +919844616304<br>Dr. Devendrappa K C Alumni Relations kcdbiet16@gmail.com +919844616304<br>7. Smt. Ashalatha M.E Women Welfare meashalatha@rediffmail.com +919844638188<br>8. Dr. G.P. Desai Public Relation Officer and Training and Placementdesai_gp@yahoo.com +919845388943<br>9. Dr.Vinutha H P Incubation vinuprasad.hp@gmail.com +919964262478<br>10.Dr. Nirmala C.R Dean IT cell nirmala.cr@gmail.com +919740770377<br>11. Dr.Pradeep N & Dr.Dinesh Y N Academics nmnpradeep@bietdvg.edu dineshyn@gmail.com +919886086840 +919964088918"]
},
{
  "tag":"Students' welfare council",
  "patterns":[
      "About Students welfare council"
  ],
  "responses":[
      "Roles and Responsibilities of Students Welfare Council<br>1.Nomination/ Election of Office Bearers of Students Welfare Counc<br>2.Monitor the Facilities Provided to the Students-Medical, Financial<br>3.Provide an Environment for Spiritual and Social Growth<br>4.Date for Conducting Ethnic Day-23<br>5.Fixation of Judges for the Events of Ethnic Day<br>6.Programme to be scheduled to conduct Cultural Fest 2023(DAVANA-23)<br>7.Conduction of Events such as Debate, SKIT, MIME, Group song, Fashion Show etc under the Umbrella of DAVANA<br>8.Identification of Judges for the Various Events of the Fest<br>9.Identifying the Students to participate in the University Youth Festival<br>10.Valedictory/ Closing Function of Students Welfare Council"
  ]
},
{
  "tag":"SC,ST OBC cell's",
  "patterns":[
      "about sc , st and obc cell"
  ],
  "responses":[
      "1.To look after welfare and addressing grievances of SC, ST & OBC students of the institute.<br>2.To create awareness among students about various governmental initiatives on academics.<br>3.To provide necessary support for vertical progression.<br>4.To implement and optimally utilize the benefits of the schemes offered by the State Government, Government of India, UGC and AICTE."
  ]
},
{
  "tag":"BIET established year",
  "patterns":[
      "BIET established year"
  ],
  "responses":[
      "The Bapuji Institute of Engineering and Technology (BIET) was established in 1979 by the Bapuji Educational Association."
  ]
},
{
  "tag":"How many years old is biet",
  "patterns":[
      "how many years old is biet"
  ],
  "responses":[
      "BIET is a 40 years old college "
  ]
},
{
  "tag":"Is biet an autonomous college?",
  "patterns":[
      "Is biet an autonomous college?"
  ],
  "responses":[
      "Yes biet is an autonomous college"
  ]
},
{
  "tag":"BIET affiliated",
  "patterns":[
      "to which board biet was affliated before","BIET affiliated"
  ],
  "responses":[
      "Bapuji Institute of Engineering and Technology (BIET) in Davangere, Karnataka was affiliated with Visvesvaraya Technological University (VTU) in Belgavi. "
  ]
},
{
  "tag":"Number of departments in UG",
  "patterns":[
      "how many number of departments are there in biet?"
  ],
  "responses":[
      "BIET offers 15 departments under UG"
  ]
},
{
  "tag":"List Departments in UG",
  "patterns":[
      "list the department in UG","Departments present in UG"
  ],
  "responses":[
      "1.Civil Engineering<br>2.Mechanical Engineering<br>3.Electrical and Electronics Engineering<br>4.Electronics and Instrumentation Engineering<br>5.Computer Science and Engineering<br>6.Information Science Engineering"
  ]
},
{
  "tag":"BIET accreditation",
  "patterns":[
      "about BIET accredition"
  ],
  "responses":[
      "BIET is approved by the All India Council for Technical Education (AICTE), UGC under 2(F) and 12(B), and the government of Karnataka. It has also been accredited by NAAC with 'A' Grade, and also accredited by NBA and Institution of Engineers."
  ]
},
{
  "tag": "boys hostel",
  "patterns": [
    "adress of boys hostel",
    "route to boys hostel",
    "where is boys hostel"
  ],
  "responses": [
    "Anjaneya Badavane, Swami Vivekananda Badavane, Biet, Davangere - 577005"
  ]
},
{
  "tag": "boys hostel fees",
  "patterns": [
    "fee of boys hostel",
    "fee structure to boys hostel",
    "what is boys hostel fees"
  ],
  "responses": [
    "1.Hostel Fee (Including mess charge) 2021-22 Rs.67,000.00<br>2.Deposit (Refundable) Rs.10,000.00<br>Total Rs.77,000.00"
  ]
},
{
  "tag": "boys hostel facilities",
  "patterns": [
    "facilities of boys hostel",
    "facilities provided to boys hostel",
    "benificiaries of boys hostel"
  ],
  "responses": [
    "Three Color T.V sets for entertainment & Information<br>Indoor Games:- 'EKALAVYA' Indoor games hall for Shuttle, Badminton , T.T, Carom & chess.<br>CCTV Coverage<br>Multi gym for Physical fitness<br> Vinayaka Reading hall<br> Reading room with Kannada & English newspapers, periodicals & Magazine<br>Captive Power - 125 Kv.A<br>Solar hot water for each blocks & Kitchens Geezer Hot Water<br>Drinking water (R.O) & Softener Plant<br>Deep freezer<br>Vehicle Parking<br>Wardrobe in each room<br>Banking facility near by campus"
  ]
},
{
  "tag": "boys hostel fees payment",
  "patterns": [
    " can we pay fee of boys hostel online",
    "online payment for boys hostel",
    "payment details for boys hostel"
  ],
  "responses": [
    "Beneficiary B I E T Campus Hostel<br>Credit Account No. 005011500001060<br> Account Type SB A/C<br>Bank IDBI Bank<br> Branch Bapuji Co- Operative Bank LTDk<br> IFSC Code IBKL0364BCBk <br> HOSTEL FEE CAN ALSO BE PAID THROUGH: DD in favour of BIET CAMPUS HOSTEL Davangere"
  ]
},
{
  "tag": "boys hostel contact details",
  "patterns": [
    "contacts details of boys hostel",
    "phone number to boys hostel",
    "what is boys hostel contacts"
  ],
  "responses": [
    "1. Prof. Y. Vrushabendrappa (Director) 9448393144 <br>2. Dr. H.B. Arvind (Principal) 9844061789<br>3. Dr.G.Manavendra(Warden) 9964030806<br>4.Dr.N.S.Basavarajappa(Deputy Warden) 9845746833<br>5. Dr.Veena Kumara Adi(Deputy Warden) 9449678206<br>6. K.Rudrappa(Manager) 9964378728"
  ]
},
{
  "tag": "boys hostel rooms",
  "patterns": [
    " how many rooms are present in boys hostel",
    "provide hostel room details of boys",
    "total boys hostel roms"
  ],
  "responses": [
    "KAMADHENU block with 72 rooms and number of borders 216<br> KALPATARU block with 80 rooms and number of borders 240<br> total rooms 152 and total number of borders are 456"
  ]
},
{
  "tag": "girls hostel",
  "patterns": [
    "adress of girls hostel",
    "route to girls hostel",
    "where is girls hostel"
  ],
  "responses": [
    "Amrutha girls hostel <br> Inside the Campus Bapuji Institute of Engineering and Technology, Davanagere, Karnataka, 577004 <br> https://www.mappls.com/b26quz"
  ]
},
{
  "tag": "girls hostel fees",
  "patterns": [
    "fee of girls hostel",
    "fee structure to girls hostel",
    "what is girls hostel fees"
  ],
  "responses": [
    "1.Hostel Fee (Including mess charge) 2021-22 Rs.57,000.00<br>2.Deposit (Refundable) Rs.10,000.00<br>Total Rs.67,000.00"
  ] 
},
{
  "tag": "girls  hostel contact details",
  "patterns": [
    "contacts details of girls hostel",
    "phone number to girls hostel",
    "what is girls hostel contacts"
  ],
  "responses": [
    "Prof. Y. Vrushabendrappa (Director) 9448393144<br> 2. Dr. H.B. Arvind (Principal) 9844061789<br> 3. Dr. S.M. Chandrashekara (Warden) 9844422882<br> 4. Dr. Vinutha H.P. (Deputy Warden) 9964262478<br> 5. Smt. Nirmala G. (Deputy Warden) 9964618228"
  ]
},
{
  "tag": "girls hostel rooms",
  "patterns": [
    " how many rooms are present in girls hostel",
    "provide hostel room details of girls",
    "total girls hostel roms"
  ],
  "responses": [
    "AMRUTHA block with 104 rooms and number of borders is 320<br>2. KALYANA block with 52 rooms and number of borders is 156<br>3. HEMAVATHI with 72 rooms and number of borders is 280"
  ] 
},
{
  "tag": "cet civil SC rank",
  "patterns": ["civil cet SC rank","civil SC rank","SC rank for civil"],
  "responses": ["Starting from 85358 to 167363"]
},
{
  "tag": "cet civil st rank",
  "patterns": ["civil cet st rank","civil st rank","st rank for civil"],
  "responses": ["Starting from 118978 to 207782"]
},
{
  "tag": "cet civil General management rank",
  "patterns": ["civil cet GM rank","civil General management rank","GM rank for civil"],
  "responses": ["Starting from 80840 to 207780"]
},
{
  "tag": "cet civil SNQ rank",
  "patterns": ["civil cet SNQ rank","civil SNQ rank","SNQ rank for civil"],
  "responses": ["Starting from 75476 to 114648"]
},
{
  "tag": "cet Mechanical Engineering SC rank",
  "patterns": ["Mechanical Engineering cet SC rank","Mechanical Engineering SC rank","SC rank for Mechanical Engineering"],
  "responses": ["Starting from 206139"]
},
{
  "tag": "cet Mechanical Engineering st rank",
  "patterns": ["Mechanical Engineering cet st rank","Mechanical Engineering st rank","st rank for Mechanical Engineering"],
  "responses": ["Starting from 152869 to 166958"]
},
{
  "tag": "cet Mechanical Engineering General management rank",
  "patterns": ["Mechanical Engineering cet GM rank","Mechanical Engineering General management rank","GM rank for Mechanical Engineering"],
  "responses": ["Starting from 132312"]
},
{
  "tag": "cet Mechanical Engineering SNQ rank",
  "patterns": ["Mechanical Engineering cet SNQ rank","Mechanical Engineering SNQ rank","SNQ rank for Mechanical Engineering"],
  "responses": ["Starting from 124714 to 130586"]
},
{
  "tag": "cet EEE 2A rank",
  "patterns": ["EEE/Electrical and Electronics Engineering cet 2A rank","EEE/Electrical and Electronics Engineering 2A rank","2A rank for EEE/Electrical and Electronics Engineering"],
  "responses": ["Starting from 142722"]
},
{
  "tag": "cet EEE/Electrical and Electronics Engineering 2B rank",
  "patterns": ["EEE/Electrical and Electronics Engineering cet 2B rank","EEE/Electrical and Electronics Engineering 2B rank","2B rank for EEE/Electrical and Electronics Engineering"],
  "responses": ["Starting from 106573 to 113005"]
},
{
  "tag": "cet EEE/Electrical and Electronics Engineering 3A rank",
  "patterns": ["EEE/Electrical and Electronics Engineering cet 3A rank","EEE/Electrical and Electronics Engineering 3A rank","3A rank for EEE/Electrical and Electronics Engineering"],
  "responses": ["Starting from 77613 to 113646"]
},
{
  "tag": "cet EEE/Electrical and Electronics Engineering 3B rank",
  "patterns": ["EEE/Electrical and Electronics Engineering cet 3B rank","EEE/Electrical and Electronics Engineering 3B rank","3B rank for EEE/Electrical and Electronics Engineering"],
  "responses": ["Starting from 76287 to 83123"]
},
{
"tag": "cet EEE/Electrical and Electronics Engineering SC rank",
"patterns": ["EEE/Electrical and Electronics Engineering cet SC rank","EEE/Electrical and Electronics Engineering SC rank","SC rank for EEE/Electrical and Electronics Engineering"],
"responses": ["Starting from 84630 to 88472"]
},
{
"tag": "cet EEE/Electrical and Electronics Engineering ST rank",
"patterns": ["EEE/Electrical and Electronics Engineering cet st rank","EEE/Electrical and Electronics Engineering st rank","st rank for EEE/Electrical and Electronics Engineering"],
"responses": ["Starting from 21125 to 52506"]
},
{
"tag": "cet EEE/Electrical and Electronics Engineering General management rank",
"patterns": ["EEE/Electrical and Electronics Engineering cet GM rank","EEE/Electrical and Electronics Engineering General management rank","GM rank for EEE/Electrical and Electronics Engineering"],
"responses": ["Starting from 48253 to 74249"]
},
{
"tag": "cet EEE/Electrical and Electronics Engineering SNQ rank",
"patterns": ["EEE/Electrical and Electronics Engineering cet SNQ rank","EEE/Electrical and Electronics Engineering SNQ rank","SNQ rank for EEE/Electrical and Electronics Engineering"],
"responses": ["Starting from 38541 to 48124"]
},
{
  "tag": "cet Electronics and communication Engineering 2A rank",
  "patterns": ["Electronics and communication Engineering cet 2A rank","Electronics and communication Engineering 2A rank","2A rank for Electronics and communication Engineering"],
  "responses": ["starting from 36403 to 52165"]
},
{
  "tag": "cet Electronics and communication Engineering 3A rank",
  "patterns": ["Electronics and communication Engineering cet 3A rank","Electronics and communication Engineering 3A rank","3A rank for Electronics and communication Engineering"],
  "responses": ["starting from 42356"]
},
{
  "tag": "cet Electronics and communication Engineering 3B rank",
  "patterns": ["Electronics and communication Engineering cet 3B rank","Electronics and communication Engineering 3B rank","3B rank for Electronics and communication Engineering"],
  "responses": ["starting from 37060 to 41801"]
},
{
"tag": "cet Electronics and communication Engineering sC rank",
"patterns": ["Electronics and communication Engineering cet sC rank","Electronics and communication Engineering sC rank","sC rank for Electronics and communication Engineering"],
"responses": ["starting from 51352 to 80146"]
},
{
"tag": "cet Electronics and communication Engineering sT rank",
"patterns": ["Electronics and communication Engineering cet st rank","Electronics and communication Engineering st rank","st rank for Electronics and communication Engineering"],
"responses": ["starting from 30231 to 55754"]
},
{
"tag": "cet Electronics and communication Engineering General management rank",
"patterns": ["Electronics and communication Engineering cet GM rank","Electronics and communication Engineering General management rank","GM rank for Electronics and communication Engineering"],
"responses": ["starting from 3668 to 36392"]
},
{
"tag": "cet Electronics and communication Engineering sNQ rank",
"patterns": ["Electronics and communication Engineering cet sNQ rank","Electronics and communication Engineering sNQ rank","sNQ rank for Electronics and communication Engineering"],
"responses": ["starting from 12907 to 25755"]
},
{
  "tag": "cet Computer science Engineering 2A rank",
  "patterns": ["Computer science Engineering cet 2A rank","Computer science Engineering 2A rank","2A rank for Computer science Engineering"],
  "responses": ["starting from 16986 to 30177"]
},
{
  "tag": "cet Computer science Engineering 2B rank",
  "patterns": ["Computer science Engineering cet 2B rank","Computer science Engineering 2B rank","2B rank for Computer science Engineering"],
  "responses": ["starting from 19128 to 23408"]
},
{
  "tag": "cet Computer science Engineering 3A rank",
  "patterns": ["Computer science Engineering cet 3A rank","Computer science Engineering 3A rank","3A rank for Computer science Engineering"],
  "responses": ["starting from 17139 to 20027"]
},
{
  "tag": "cet Computer science Engineering 3B rank",
  "patterns": ["Computer science Engineering cet 3B rank","Computer science Engineering 3B rank","3B rank for Computer science Engineering"],
  "responses": ["starting from 16416 to 21237"]
},
{
"tag": "cet Computer science Engineering sC rank",
"patterns": ["Computer science Engineering cet sC rank","Computer science Engineering sC rank","sC rank for Computer science Engineering"],
"responses": ["starting from 18665 to 57405"]
},
{
"tag": "cet Computer science Engineering sT rank",
"patterns": ["Computer science Engineering cet st rank","Computer science Engineering st rank","st rank for Computer science Engineering"],
"responses": ["starting from 8657 to 33711"]
},
{
"tag": "cet Computer science Engineering General management rank",
"patterns": ["Computer science Engineering cet GM rank","Computer science Engineering General management rank","GM rank for Computer science Engineering"],
"responses": ["starting from 8044 to 16161"]
},
{
"tag": "cet Computer science Engineering sNQ rank",
"patterns": ["Computer science Engineering cet sNQ rank","Computer science Engineering sNQ rank","sNQ rank for Computer science Engineering"],
"responses": ["starting from 4667 to 7891"]
},
{
  "tag": "cet Textile sC rank",
  "patterns": ["Textile cet sC rank","Textile sC rank","sC rank for Textile"],
  "responses": ["starting from 156363"]
},
{
  "tag": "cet Textile sT rank",
  "patterns": ["Textile cet st rank","Textile st rank","st rank for Textile"],
  "responses": ["starting from 168394"]
},
{
  "tag": "cet Textile General management rank",
  "patterns": ["Textile cet GM rank","Textile General management rank","GM rank for Textile"],
  "responses": ["starting from 139069 to 149517"]
},
{
  "tag": "cet Textile SNQ rank",
  "patterns": ["Textile cet sNQ rank","Textile sNQ rank","sNQ rank for Textile"],
  "responses": ["starting from 108402 to 139868"]
},
{
  "tag": "cet Chemical SC rank",
  "patterns": ["Chemical cet SC rank","Chemical SC rank","SC rank for Chemical"],
  "responses": ["starting from 172007"]
},
{
  "tag": "cet Chemical ST rank",
  "patterns": ["Chemical cet ST rank","Chemical ST rank","ST rank for Chemical"],
  "responses": ["starting from 158965"]
},
{
  "tag": "cet Chemical General management rank",
  "patterns": ["Chemical cet GM rank","Chemical General management rank","GM rank for Chemical"],
  "responses": ["starting from 35015 to 78809"]
},
{
  "tag": "cet Chemical SNQ rank",
  "patterns": ["Chemical cet sNQ rank","Chemical sNQ rank","sNQ rank for Chemical"],
  "responses": ["starting from 55477 to 62944"]
},
{
  "tag": "cet Information Science 2A rank",
  "patterns": ["Information Science cet 2A rank","Information Science 2A rank","2A rank for Information Science"],
  "responses": ["starting from 31367 to 38471"]
},
{
  "tag": "cet Information Science 2B rank",
  "patterns": ["Information Science cet 2B rank","Information Science 2B rank","2B rank for Information Science"],
  "responses": ["starting from 36790 to 71203"]
},
{
  "tag": "cet Information Science 3A rank",
  "patterns": ["Information Science cet 3A rank","Information Science 3A rank","3A rank for Information Science"],
  "responses": ["starting from 32908 to 33627"]
},
{
  "tag": "cet Information Science 3B rank",
  "patterns": ["Information Science cet 3B rank","Information Science 3B rank","3B rank for Information Science"],
  "responses": ["starting from 31383 to 31817"]
},
{
"tag": "cet Information Science SC rank",
"patterns": ["Information Science cet SC rank","Information Science SC rank","SC rank for Information Science"],
"responses": ["starting from 64557 to 91499"]
},
{
"tag": "cet Information Science ST rank",
"patterns": ["Information Science cet ST rank","Information Science ST rank","ST rank for Information Science"],
"responses": ["starting from 43355 to 69280"]
},
{
"tag": "cet Information Science General management rank",
"patterns": ["Information Science cet GM rank","Information Science General management rank","GM rank for Information Science"],
"responses": ["starting from 18248 to 30992"]
},
{
"tag": "cet Information Science SNQ rank",
"patterns": ["Information Science cet sNQ rank","Information Science sNQ rank","sNQ rank for Information Science"],
"responses": ["starting from 17342 to 25018"]
},
{
  "tag": "cet Bio Technology SC rank",
  "patterns": ["Bio Technology cet SC rank","Bio Technology SC rank","SC rank for Bio Technology"],
  "responses": ["starting from 71241"]
},
{
  "tag": "cet Bio Technology ST rank",
  "patterns": ["Bio Technology cet ST rank","Bio Technology ST rank","ST rank for Bio Technology"],
  "responses": ["starting from 88433"]
},
{
  "tag": "cet Bio Technology General management rank",
  "patterns": ["Bio Technology cet GM rank","Bio Technology General management rank","GM rank for Bio Technology"],
  "responses": ["starting from 31053 to 125208"]
},
{
  "tag": "cet Bio Technology SNQ rank",
  "patterns": ["Bio Technology cet sNQ rank","Bio Technology sNQ rank","sNQ rank for Bio Technology"],
  "responses": ["starting from 59198"]
},
{
  "tag": "cet AIML 2A rank",
  "patterns": ["AIML cet 2A rank","AIML 2A rank","2A rank for AIML"],
  "responses": ["starting from 51473 to 42602"]
},
{
  "tag": "cet AIML 2B rank",
  "patterns": ["AIML cet 2B rank","AIML 2B rank","2B rank for AIML"],
  "responses": ["starting from 91139"]
},
{
  "tag": "cet AIML 3A rank",
  "patterns": ["AIML cet 3A rank","AIML 3A rank","3A rank for AIML"],
  "responses": ["starting from 40728"]
},
{
  "tag": "cet AIML 3B rank",
  "patterns": ["AIML cet 3B rank","AIML 3B rank","3B rank for AIML"],
  "responses": ["starting from 40701"]
},
{
"tag": "cet AIML SC rank",
"patterns": ["AIML cet SC rank","AIML SC rank","SC rank for AIML"],
"responses": ["starting from 59441 to 91290"]
},
{
"tag": "cet AIML General management rank",
"patterns": ["AIML cet GM rank","AIML General management rank","GM rank for AIML"],
"responses": ["starting from 36190 to 36582"]
},
{
"tag": "cet AIML SNQ rank",
"patterns": ["AIML cet sNQ rank","AIML sNQ rank","sNQ rank for AIML"],
"responses": ["starting from 19401 to 27754"]
},
{
  "tag": "cet computer design 2A rank",
  "patterns": ["computer design cet 2A rank","computer design 2A rank","2A rank for computer design"],
  "responses": ["starting from 38491 to 60317"]
},
{
  "tag": "cet computer design 2B rank",
  "patterns": ["computer design cet 2B rank","computer design 2B rank","2B rank for computer design"],
  "responses": ["starting from 40227 to 77976"]
},
{
  "tag": "cet computer design 3A rank",
  "patterns": ["computer design cet 3A rank","computer design 3A rank","3A rank for computer design"],
  "responses": ["starting from 61558 to 92793"]
},
{
  "tag": "cet computer design 3B rank",
  "patterns": ["computer design cet 3B rank","computer design 3B rank","3B rank for computer design"],
  "responses": ["starting from 38710"]
},
{
"tag": "cet computer design SC rank",
"patterns": ["computer design cet SC rank","computer design SC rank","SC rank for computer design"],
"responses": ["starting from 53544 to 78410"]
},
{
"tag": "cet computer design ST rank",
"patterns": ["computer design cet ST rank","computer design ST rank","ST rank for computer design"],
"responses": ["starting from 98107"]
},
{
"tag": "cet computer design General management rank",
"patterns": ["computer design cet GM rank","computer design General management rank","GM rank for computer design"],
"responses": ["starting from 17861 to 37853"]
},
{
"tag": "cet computer design SNQ rank",
"patterns": ["computer design cet sNQ rank","computer design sNQ rank","sNQ rank for computer design"],
"responses": ["starting from 8144 to 19422"]
},
{
  "tag": "cet computer Business 2A rank",
  "patterns": ["computer Business cet 2A rank","computer Business 2A rank","2A rank for computer Business"],
  "responses": ["starting from 42888 to 47945"]
},
{
  "tag": "cet computer Business 2B rank",
  "patterns": ["computer Business cet 2B rank","computer Business 2B rank","2B rank for computer Business"],
  "responses": ["starting from 61914"]
},
{
  "tag": "cet computer Business 3A rank",
  "patterns": ["computer Business cet 3A rank","computer Business 3A rank","3A rank for computer Business"],
  "responses": ["starting from 55781"]
},
{
  "tag": "cet computer Business 3B rank",
  "patterns": ["computer Business cet 3B rank","computer Business 3B rank","3B rank for computer Business"],
  "responses": ["starting from 42367 to 53518"]
},
{
"tag": "cet computer Business SC rank",
"patterns": ["computer Business cet SC rank","computer Business SC rank","SC rank for computer Business"],
"responses": ["starting from 87531 to 123655"]
},
{
"tag": "cet computer Business General management rank",
"patterns": ["computer Business cet GM rank","computer Business General management rank","GM rank for computer Business"],
"responses": ["starting from 34021 to 42150"]
},
{
"tag": "cet computer Business SNQ rank",
"patterns": ["computer Business cet sNQ rank","computer Business sNQ rank","sNQ rank for computer Business"],
"responses": ["starting from 6604 to 34618"]
},
{
  "tag": "cet fee/all branches cet fee",
  "patterns": ["cet fee","all branches cet fee"],
  "responses": ["99,234.00"]
},
{
  "tag": "college development fee",
  "patterns": ["development fee"],
  "responses": ["18,250.00"]
},
{
  "tag": "total fee pay to college",
  "patterns": ["total fee pay to college"],
  "responses": ["1,17,484.00"]
},
{
  "tag": "cet sc st fee/all branches cet sc st fee",
  "patterns": ["cet sc st fee","all branches cet sc st fee"],
  "responses": ["750.00 and 71,874.00 pay from scholarship amount"]
},
{
  "tag": "college development fee for sc st",
  "patterns": ["development fee for sc st"],
  "responses": ["45,610.00"]
},
{
  "tag": "sc st total fee pay to college",
  "patterns": ["sc st total fee pay to college"],
  "responses": ["1,17,484.00"]
},
{
  "tag": "Library",
  "patterns": [
      "about library"
  ],
  "responses": [
      "The Library & Information Centre is housed in the Administrative Block & having three floors including ground floor with a two mezzanine floors, measuring an area of 2661 sq.m. There are 9 staff members including qualified Librarian working in the library, having 600 seating capacity. To cater to the needs of the staff/ students, to have easy and speedy access to the library collection, the house keeping operations of library have been automated using EasyLib software package. It has adopted open access system and maintains Online Public Access catalogue (OPAC) to provide easy access to the stacks. The library subscribes to 139 print journals and subscribing e-journals through VTU-Consortium. It has also has a collection of nearly 4485 back volumes of periodicals.<br>Library is an essential part of every institution which helps staff and students to enhance the knowledge through various resources such as books, Newspapers, Journals, Magazines and Electronic Library. Our institution library provides Borrowing, Book Bank, OPAC, Reference services, digital library with high speed internet facilities , Reprographic, Wi-Fi etc,.<br>In addition to the general library, the Engineering departments have exclusive department libraries also for quick and easy access of books by staff and students"
  ]
},
{
  "tag": "Working Hours of Library",
  "patterns": [
      "what is the working hours of library"
  ],
  "responses": [
      "From monday to friday the borrowing time will be from 09:00 AM - 01:00 PM and from 02:00 PM - 05:30 PM and reference time will be 09:00 AM - 09:00 PM<br> for saturday Borrowing time will be from 09:00 AM - 01:30 PM and reference time will be from 09:00 AM - 09:00 PM<br>Sunday there will be no borrowing and reference timing is 09:00 AM - 01:00 PM During Examination: 09:00 AM - 9:00 PM "
  ]
},
{
  "tag": "Library staff",
  "patterns": [
      "about library staff"
  ],
  "responses": [
      "1.Dr.K.V.Manjunatha<br>2.Smt.Shakunthala G.S, M.Sc,M.Phil<br>3.G.K.Prasanna Kumar<br>4.Nagaraja A<br>5.Channabasappa<br>6.Kenchappa<br>7.Govindraj<br>8.Smt. Pushpa<br>9.Nirmala K P"
  ]
},
{
  "tag": "Library Collection",
  "patterns": [
      "how many Library Collection are there"
  ],
  "responses": [
      "There are 68815 number of Library Collection"
  ]
},
{
  "tag": "SC/ST Social Walfare Book Bank",
  "patterns": [
      "how many SC/ST Social Walfare Book Bank are there"
  ],
  "responses": [
      "There are 5925 number of SC/ST Social Walfare Book Bank"
  ]
},
{
  "tag": "General Book Bank",
  "patterns": [
      "how many General Book Bank are there"
  ],
  "responses": [
      "There are 40571 number of General Book Bank"
  ]
},
{
  "tag": "Department Library books",
  "patterns": [
      "how many Department Library books are there"
  ],
  "responses": [
      "There are 10761 number of Department Library books"
  ]
},
{
  "tag": "E-Books",
  "patterns": [
      "how many E-Books are there"
  ],
  "responses": [
      "There are 24329  number of E-Books"
  ]
},
{
  "tag": "Print Journals",
  "patterns": [
      "how many Print Journals are there"
  ],
  "responses": [
      "There are 142 number of Print Journals"
  ]
},
{
  "tag": "E-Journals from VTU E-Resource Consortium",
  "patterns": [
      "how many E-Journals from VTU E-Resource Consortium are there"
  ],
  "responses": [
      "There are 142 number of E-Journals from VTU E-Resource Consortium"
  ]
},
{
  "tag": "Bound Volumes",
  "patterns": [
      "how many Bound Volumes are there"
  ],
  "responses": [
      "There are 4485 number of Bound Volumes"
  ]
},
{
  "tag": "General and Subject Encyclopedias",
  "patterns": [
      "how many General and Subject Encyclopedias are there"
  ],
  "responses": [
      "There are 15 sets number of General and Subject Encyclopedias"
  ]
},
{
  "tag": "Handbooks",
  "patterns": [
      "how many Handbooks are there"
  ],
  "responses": [
      "There are 140 number of Handbooks"
  ]
},
{
  "tag": "Phd thesis",
  "patterns": [
      "how many Phd thesis are there"
  ],
  "responses": [
      "There are 98 number of Phd thesis"
  ]
},
{
  "tag": "Student Project Reports",
  "patterns": [
      "how many Student Project Reports are there"
  ],
  "responses": [
      "There are 5077 number of Student Project Reports"
  ]
},
{
  "tag": "Conference proceeding",
  "patterns": [
      "how many Conference proceeding are there"
  ],
  "responses": [
      "There are 121 number of Conference proceeding"
  ]
},
{
  "tag": "CDs/DVDs",
  "patterns": [
      "how many CDs/DVDs are there"
  ],
  "responses": [
      "There are 1894 number of CDs/DVDs"
  ]
},
{
  "tag": "News Paper and Magazines",
  "patterns": [
      "how many News Paper and Magazines are there"
  ],
  "responses": [
      "There are 23 number of News Paper and Magazines"
  ]
},
{
  "tag": "Memebership",
  "patterns": [
      "Library membership"
  ],
  "responses": [
      "Type of Books Type of Members Duration of Loan No of books Overdue charges<br>Borrowing Section UG/PG/PhD Students 15 days 02 16th to 30th day 50 paisa per day.After 30 days onwards Rs.2/- per day till the book is returned to libra<br>Teaching StaffOne year 05 **<br>Non Teaching One year 02 **<br>General Book Bank All the Students Members One semester05 **<br>Social welfare Book Only for SC/ST students One Semester 05"
  ]
},
{
  "tag": "Library rules",
  "patterns": [
      "what are the library rules , library rules"
  ],
  "responses": [
      "All the readers provided with an ID card will use the same card for library acces<br>All readers need to show their card at the entry point of library for using the library facility while check in and checkout of library.<br>Readers are not permitted to take their personal belongings inside the library. However loose sheets are permitted for rough work.<br>Usage of mobiles, carrying water bottle, eatables are not permitted inside the library premises.<br>All readers need to strictly adhere to library rules and maintain silence in the library. No group discussions are permitted in the library.<br>If any reader found taking away library documents without the permission of the library staff, the reader will be charged accordingly and the library facilities will be withdrawn.<br>Suggestions for purchasing books for library and improving library facilities are appreciable.<br>The borrowed books must be returned to the library within stipulated period of 15 days to avoid paying fine.<br>All books must be returned on before the due date.<br>Books are required to be presented physically at the Counter for return.<br>Students are requested to confirm the generation of receipt for the overdue paid.<br>Members must replace the book if lost with latest edition along with overdue charges.<br>Students are required to verify the books before borrowing. Any discrepancies like missing pages etc., shall be brought to the notice of the Library staff. Otherwise books will be verified when they are returned to the library and any discrepancies found will be fined accordingly.<br>The ID card is not transferable and must be produced whenever demanded by teacher, staff or any other college authority.<br>In case the card is lost, kindly report immediately to the Principal / Librarian of the college in writing mentioning the details of ID Card .Members are responsible for any borrowings made against this card.<br>Produce ID card whenever no due certificate is to be collected from the library."
  ]
},
{
  "tag": "Library charges",
  "patterns": [
      "what are the library charges , library charges"
  ],
  "responses": [
      "Photocopying Charges -Single side Rs.0.75/ -Both side: Rs.1.25/-<br>Cyclostyle copes - Office work only in large scale: test question papers etc.,<br>Overdue Charges (for Students only) -1St 15 days No Fine ,2nd 15 days (16th to 30th day) Rs.0.50 per day.,After 30 days onwards Rs.2/- per day till the book is returned to library.<br>Issue of Duplicate ID Card-Rs.200/- per Duplicate ID Card,Rs.50/- per Renewal of ID Card<br>Loss/Damage of Library books, Materials Replacing the material/books or paying such compensation as fixed by the Principal/librarian."
  ]
},
{
  "tag": "Library DO's",
  "patterns": [
      "what are the library DO's , library DO's"
  ],
  "responses": [
      "<br>1.Members should Keep belongings like bags,Aprons, books, files, Xerox copies etc., in the belongings counter at the entrance <br>2.Members should Handle Library books carefully<br>3.Books lost by the Borrowers have to be reported immediately in writing to the Librarian<br>4.Members should Switch off cell phone<br>5.Maintain Queue at circulation counter.<br>6.Show the documents, which are being taken out of the Library, to the staff at the checkpoint<br>7.Use the dustbins provided in the reading area and Keep the Library clean<br>8.MAINTAIN SILENCE"
  ]
},
{
  "tag": "Library DON'Ts",
  "patterns": [
      "<br>1.Keep valuables, Cash, Purses and Calculator etc., in the belongings counter<br>2.Tear pages of books/Journals<br>3.Write on the tables, books, Journals, other materials belonging to the library<br>4Switch on cell phone<br>5.Make Noise<br>6.Misplace the reading materials"
  ]
},
{
  "tag": "Library Services",
  "patterns": [
      "what are the services of library"
  ],
  "responses": [
      "Borrowing Section :Students can borrow two books at a time and can retain them for a fortnight. The books have to be returned before due date failing which overdue charges are levied. Teaching Faculty are given 05 books.Book Bank facility for SC/ST students is being provided for the benefit of deserving candidates with the assistance of social welfare Department, Government of Karnataka. The concerned students can keep these books for one semester.<br>Reference Section :The Reference section is well equipped and having the facility for 600 readers to make reference at a time. It consists of UG Section, PG section, Digital Library and self reading Room.<br>Internet Services :Internet facility is provided in Library with 15 systems connectivity.In additional to all general services, the Central Library provides various value added services includingAccess to E-ResourcesBook Bank ServiceCareer InformationCD-ROM ServiceCirculation ServiceCurrent Awareness ServiceCurrent Content ServiceHigh speed internet serviceNew Arrivals displayNewspaper Clipping ServiceNewspapers & General MagazinesNPTEL serviceOPAC - Online Public Access CataloguePeriodical ServicePhotocopyingPrevious Years VTU Question papers ServiceReading FacilityReading Hall facilityReference ServiceSC/ST Book Bank facilityUser Awareness Programme: Library facilities and services orientation programme is given for the new students at the beginning of the academic year,Wi-Fi service"
  ]
},
{
  "tag": "Library Internet Services",
  "patterns": [
      "what are the internet services of library"
  ],
  "responses": [
      "Internet Services :Internet facility is provided in Library with 15 systems connectivity.In additional to all general services, the Central Library provides various value added services includingAccess to E-ResourcesBook Bank ServiceCareer InformationCD-ROM ServiceCirculation ServiceCurrent Awareness ServiceCurrent Content ServiceHigh speed internet serviceNew Arrivals displayNewspaper Clipping ServiceNewspapers & General MagazinesNPTEL serviceOPAC - Online Public Access CataloguePeriodical ServicePhotocopyingPrevious Years VTU Question papers ServiceReading FacilityReading Hall facilityReference ServiceSC/ST Book Bank facilityUser Awareness Programme: Library facilities and services orientation programme is given for the new students at the beginning of the academic year,Wi-Fi service"
  ]
},
{
  "tag": "Library Committe",
  "patterns": [
      "Library Committe",
      "who are the members of Library Committe"
  ],
  "responses": [
      "Principle",
      "All HOD's,Librarian"
  ]
},
{
  "tag": "Online Courses",
  "patterns": [
      "Online Courses"
  ],
  "responses": [
      "1 SWAYAM (Study Webs of Active-Learning for Young Aspiring Minds) https://swayam.gov.in/<br>AICTE : All India Council for Technical Education) for self-paced and international courses<br>NPTEL : National Programme on Technology Enhanced Learning for Engineering<br>UGC : University Grants Commission for non technical post- graduation education<br>CEC : Consortium for Educational Communication) for under- graduate education<br>NCERT : National Council of Educational Research and Training for school education<br>NIOS : National Institute of Open Schooling) for school education<br>IGNOU : Indira Gandhi National Open University) for out-of-school students<br>IIMB : Indian Institute of Management, Bangalore) for management studies<br>NITTTR : National Institute of Technical Teachers Training and Research) for Teacher Training programm<br>2 MOOCS (Massive Open Online Courses) https: //www.mooc-list.com/countrys/indi<br>3 SPOCS (Small Private Online Courses) https: //www.heacademy.ac.uk/enhancement/.../small-private-online-courses-spo<br>4 MIT Online Courses https: //www.youtube.com/user/MIT/feature<br>5 Academic Earth http: //academicearth.org/online-college-courses<br>6 OCW Consortium"
  ]
},
{
  "tag": "Pentagon space Details",
  "patterns": ["About Pentagon space","Can you provide information about Pentagon space?",
  "Tell me about the recent updates from Pentagon space",
  "I'm interested in learning more about Pentagon space",
  "Pentagon space updates","Pentagon space","Pentagon space placed students",
  "Any news about Pentagon space?",
  "Pentagon space recent activities"],
  "responses": ["Mar 06, 2024 09:00   -  Mar 06, 2024 18:00<br>CONGRATULATIONS TO THE FOLLOWING STUDENTS OF 2024 BATCH HAVE BEEN SELECTED FOR PENTAGON SPACE PVT.LTD., BENGALURU AS AN INTERNS DURING THE ON CAMPUS DRIVE HELD ON 06-03-2024 FOR A CTC OF 3.5-5.0 LPA.<br>1. MANOJ K M<br>2. V SANDHYA<br>3. RAZMIA TASNEEM<br>4. SANJANA B V<br>5. NITHIN KK<br>6. HALASHANKARA SWAMY P B M<br>7. PRASHANTH DK<br>8. SUPRIYA S K<br>9. NISHITHA A N<br>10. LAKSHMI M S<br>11. AZEEZ KHAN AFRIDI<br>12. AKHIL A K<br>13. SUBRAMANYA R<br>14 RAHUL SINGH<br>15. ABHINIT RAJ"]
},
{
  "tag": "Kasmo technology Details",
  "patterns": ["Kasmo Technology","Kasmo Technology placed students","Tell me about Kasmo Technology","Can you provide information about recent placements at Kasmo Technology?",
  "Kasmo Technology updates","Kasmo",
  "Any news about Kasmo Technology?",
  "Kasmo Technology recent activities","information on students placed in Kasmo",
  "Kasmo Technology recent placements","Kasmo Technology placed students",
  "Names of students placed in Kasmo Technology"],
  "responses": ["Feb 16, 2024 09:00   -  Feb 17, 2024 12:00<br>CONGRATULATIONS TO THE FOLLOWING STUDENTS OF 2024 BATCH HAVE BEEN SELECTED FOR KASMO TECHNOLOGIES, BANGALORE DURING THE ON CAMPUS DRIVE HELD ON 16-02-2024 & 17-02-2024 FOR A CTC OF 3.25 LPA.<br>1. TEENA SHARMA<br>2. TEJASWINI S<br>3. NEETHU PJ<br>4. NAYANA R<br>5. BHOOMI SHREE C P<br>6. MANOJ P J<br>7. POOJA BHARAMAGOUDA PYATER<br>8. SONAL V HAMSAGAR"]
},
{
  "tag": "TCS Digital Details",
  "patterns": ["TCS digital","TCS digital Placed students","TCS Digital Placements",
  "Recent placements at TCS Digital",
  "Can you tell me about the recent placements at TCS Digital?",
  "Any updates on placements at TCS Digital?",
  "Tell me about students placed in TCS Digital",
  "Recent TCS Digital placements","Names of students placed in TCS Digital"],
  "responses": ["Feb 14, 2024 09:00   -  Feb 14, 2024 18:00<br>CONGRATULATIONS TO THE FOLLOWING STUDENTS OF 2024 BATCH HAVE BEEN SELECTED FOR TCS- DIGITAL, BENGALURU DURING THE ON CAMPUS DRIVE HELD ON 14-02-2024 FOR A CTC OF 7 LPA.<br>1) HARSHAVARDHAN S SHET<br>2) NEHA MANJUNATH RAIKAR<br>3) SAGAR N TATTI<br>4) SWAROOP ARADHYA N M<br>5) NIKITHA CHINCHALI"]
},
{
  "tag": "TCS Ninja Details",
  "patterns": ["TCS Ninja","TCS Ninja Placements",
  "Recent placements at TCS Ninja",
  "How are the placements at TCS Ninja?",
  "Can you tell me about the recent placements at TCS Ninja?",
  "Any updates on placements at TCS Ninja?",
  "Tell me about students placed in TCS Ninja",
  "Recent TCS Ninja placements",
  "TCS Ninja placed students",
  "Names of students placed in TCS Ninja"],
  "responses": ["Feb 14, 2024 09:00   -  Feb 14, 2024 18:00<br>CONGRATULATIONS TO THE FOLLOWING STUDENTS OF 2024 BATCH HAVE BEEN SELECTED FOR TCS-NINJA, BENGALURU DURING THE ON CAMPUS DRIVE HELD ON 14-02-2024 FOR A CTC OF 3.3 LPA.<br>1) ADITYA D BENKIKERE<br>2) AMRUTH RAVINDRANATH HEBBAR<br>3) ANU R<br>4) BHAVANI S M<br>5) BHOOMI SHREE CP<br>6) GOWRI RAVI<br>7) HITESH G P<br>8) KARUNA C KOLUR<br>9) KHUSHI A M NYAMATHI<br>10) MANOJ P J<br>11) MANOJ BHAVIHAL<br>12) MEGHANA S MUNDARAGI<br>13) SHRAVAN S ALIGAR<br>14) SYED FARHAN<br>15) THEJASHWINI H M<br>16) GANAVI N<br>17) GIRIJA A K<br>18) SUDEEP S HALIGONDRA<br>19) TEJASWINI S<br>20) LINGARAJU M<br>21) ANJALI R<br>22) BHARATHA B<br>23) JAHNAVI G S<br>24) ANIRUDDHA N"]
},
{
  "tag": "TCS Details",
  "patterns": ["TCS","TCS Placed students","TCS Placements",
  "Recent placements at TCS",
  "Can you tell me about the recent placements at TCS?",
  "Any updates on placements at TCS",
  "Tell me about students placed in TCS",
  "Recent TCS placements","students placed in TCS","information on students placed in TCS"],
  "responses": ["Feb 14, 2024 09:00   -  Feb 14, 2024 18:00<br>CONGRATULATIONS TO THE FOLLOWING STUDENTS OF 2024 BATCH HAVE BEEN SELECTED FOR TCS- DIGITAL, BENGALURU DURING THE ON CAMPUS DRIVE HELD ON 14-02-2024 FOR A CTC OF 7 LPA.<br>1) HARSHAVARDHAN S SHET<br>2) NEHA MANJUNATH RAIKAR<br>3) SAGAR N TATTI<br>4) SWAROOP ARADHYA N M<br>5) NIKITHA CHINCHALI<br><br>CONGRATULATIONS TO THE FOLLOWING STUDENTS OF 2024 BATCH HAVE BEEN SELECTED FOR TCS-NINJA, BENGALURU DURING THE ON CAMPUS DRIVE HELD ON 14-02-2024 FOR A CTC OF 3.3 LPA.<br>1) ADITYA D BENKIKERE<br>2) AMRUTH RAVINDRANATH HEBBAR<br>3) ANU R<br>4) BHAVANI S M<br>5) BHOOMI SHREE CP<br>6) GOWRI RAVI<br>7) HITESH G P<br>8) KARUNA C KOLUR<br>9) KHUSHI A M NYAMATHI<br>10) MANOJ P J<br>11) MANOJ BHAVIHAL<br>12) MEGHANA S MUNDARAGI<br>13) SHRAVAN S ALIGAR<br>14) SYED FARHAN<br>15) THEJASHWINI H M<br>16) GANAVI N<br>17) GIRIJA A K<br>18) SUDEEP S HALIGONDRA<br>19) TEJASWINI S<br>20) LINGARAJU M<br>21) ANJALI R<br>22) BHARATHA B<br>23) JAHNAVI G S<br>24) ANIRUDDHA N"]
},
{
  "tag": "INTELLIPAAT SOFTWARE SOLUTIONS PVT.LTD. Details",
  "patterns": ["INTELLIPAAT SOFTWARE SOLUTIONS PVT.LTD.","INTELLIPAAT SOFTWARE SOLUTIONS Placements","INTELLIPAAT SOFTWARE SOLUTIONS",
  "Recent placements at INTELLIPAAT SOFTWARE",
  "Can you tell me about the recent placements at INTELLIPAAT SOFTWARE SOLUTIONS PVT.LTD.?",
  "Any updates on placements at INTELLIPAAT SOFTWARE SOLUTIONS PVT.LTD.?",
  "Tell me about students placed in INTELLIPAAT SOFTWARE SOLUTIONS",
  "Recent INTELLIPAAT SOFTWARE SOLUTIONS PVT.LTD. placements",
  "INTELLIPAAT SOFTWARE SOLUTIONS placed students",
  "Names of students placed in INTELLIPAAT SOFTWARE SOLUTIONS"],
  "responses": ["Feb 12, 2024 09:00 - Feb 12, 2024 18:00<br>CONGRATULATIONS TO THE FOLLOWING STUDENTS OF 2024 BATCH HAVE BEEN SELECTED FOR INTELLIPAAT SOFTWARE SOLUTIONS PVT.LTD., BENGALURU DURING THE VIRTUAL CAMPUS DRIVE HELD ON 12-02-2024 FOR A CTC OF 7.25 LPA.<br>1. NAYANA S N<br>2. SAATHVI C S"]
},
{
  "tag": "SANSERA ENGINEERING .LTD Details",
  "patterns": ["SANSERA ENGINEERING .LTD Placements","SANSERA ENGINEERING",
  "Recent placements at SANSERA ENGINEERING .LTD",
  "Can you tell me about the recent placements at SANSERA ENGINEERING .LTD?",
  "Any updates on placements at SANSERA ENGINEERING .LTD?",
  "What's the status of placements at SANSERA ENGINEERING .LTD?",
  "Tell me about students placed in SANSERA ENGINEERING .LTD",
  "SANSERA ENGINEERING .LTD placed students",
  "Names of students placed in SANSERA ENGINEERING"],
  "responses": ["Feb 09, 2024 09:00   -  Feb 09, 2024 18:00<br>CONGRATULATIONS TO THE FOLLOWING STUDENTS OF 2024 BATCH HAVE BEEN SELECTED FOR SANSERA ENGINEERING .LTD BENGALURU DURING THE POOL CAMPUS DRIVE HELD ON 09-02-2024 FOR A ROLE OF GRADUATE ENGINEER TRAINEE (GET) WITH A CTC OF 3.6 LPA.<br>1 ARSHIYA ANJUM<br>2 S R JEEVAN<br>3 SAGHOSH KUMAR G P<br>4 SHARAVANA A G<br>5 SYED SHAHEED AQTHAR"]
},{
  "tag": "TALENT SERVE Details",
  "patterns": ["TALENT SERVE","TALENT SERVE Placements","TALENT SERVE Placed students details",
  "Recent placements at TALENT SERVE",
  "How are the placements at TALENT SERVE?",
  "Can you tell me about the recent placements at TALENT SERVE?",
  "Any updates on placements at TALENT SERVE?",
  "What's the status of placements at TALENT SERVE?",
  "Tell me about students placed in TALENT SERVE",
  "Recent TALENT SERVE placements",
  "TALENT SERVE placed students","information on students placed in TALENT SERVE",
  "Names of students placed in TALENT SERVE"],
  "responses": ["Jan 18, 2024 09:00 - Jan 18, 2024 18:00<br>CONGRATULATIONS TO THE FOLLOWING STUDENTS OF 2024 BATCH HAVE BEEN SELECTED FOR TALENT SERVE. BENGALURU DURING THE VIRTUAL CAMPUS DRIVE HELD ON 18-01-2024 FOR AN AVERAGE CTC OF 4.0-5.0 LPA.<br>1 ANUSHA PUJAR<br>2 NIDHI S<br>3 RUDRESH S U<br>4 VIBHA D N<br>5 LAKSHMI PRAHARSHA L S<br>6 VINAY SHIVANAGOUDA PATIL<br>7 BHARGAVI KM<br>8 ANUP M<br>9 ANNESHA B<br>10 RAMAKRISHNA S K<br>11 NIDHI KIRAN BETAGERI<br>12 NAYANA SN<br>13 SAATHVI C S<br>14 PRIYA S<br>15 SHREE LAKSHMI M B<br>16 LAVANYA V ASUTI<br>17 THASHWINI K S<br>18 SAHANA MN<br>19 POOJA BHARAMAGOUDA PYATER<br>20 Y PRAGATHI<br>21 KARUNA C KOLUR<br>22 ABHISHREE K M<br>23 BHAVANI S M<br>24 SRUJAN S A<br>25 SOUNDARYA H M<br>26 KAVYA MRUTHYUNJAYA MALAGI<br>27 PRIYANKA B C<br>28 B R VEERESH<br>29 MEDABALIMI KEERTHI<br>30 SHRUTI NAYAK<br>31 PANCHAMI S N<br>32 LAKSHMI M S<br>33 MANOJ PJ<br>34 ROJA A S<br>35 NIVEDITHA G<br>36 JEEVAN H K<br>37 ASHWINI YALLAPPA HUNAGUND<br>38 RENU RAMACHANDRA UPPAR<br>39 HARSHA A SINDHE<br>40 SYED FARHAN<br>41 SUBRAMANYA R<br>42 ALLALLI RUBAYA SULTANA<br>43 SOUJANYA B UPPIN<br>44 P RASHMI<br>45 LIKHITHA G N<br>46 FASIHA KHANUM I<br>47 RASHMI D<br>48 AKASH K N<br>49 MEGHANA PN<br>50 MALATESHA M KOLLAPURA<br>51 YASHAVANTH KUMAR K S<br>52 LOHIT KUMAR T<br>53 NAGARAJA B M<br>54 KHAJA HUSEIN H<br>55 VINAY PATEL<br>56 CHAYA G MELAGIRI<br>57 DEEPIKA M<br>58 SURAJ R K<br>59 B B SHEETAL<br>60 MOHAMMED HAROON U R<br>61 AKSHAYKUMAR S PATIL<br>62 ABHISHEK G M<br>63 AKSHATA RAMAPPA DADDIKOPPA<br>64 SHRAVANA G C<br>65 SUDEEP S HALIGONDRA<br>66 PRAJWAL P KURDEKAR<br>67 T C DEEPAK<br>68 ANMOL S R<br>69 GIRIJA A K<br>70 GOWRI RAVI<br>71 SHRUSTI P S<br>72 NITISH H METI<br>73 BASAVANAGOWDA N G<br>74 SHUBHA K M<br>75 JEEVITHA BK<br>76 NAYANA R<br>77 AMULYA A T<br>78 ASHWINI P<br>79 MEGHA S B<br>80 MOHAMMED JUNAID<br>81 SUMANTH B M<br>82 NIKHIL A<br>83 CHETHAN R<br>84 SHRINIVAS E U<br>85 AJAY S<br>86 PATIL S N<br>87 VEERESH H K<br>88 DOMINIC PAUL R<br>89 VEERESH K C<br>90 PUNITH B<br>91 CHANDAN N L<br>92 VYSHAK KUMAR B S<br>93 SYED SHAHEED AQTHAR<br>94 SWAPNA M<br>95 ANIRUDDHA N"]
},
{
  "tag": "TEACHNOOK Details",
  "patterns": ["TEACHNOOK","TEACHNOOK Placements",
  "Recent placements at TEACHNOOK",
  "Can you tell me about the recent placements at TEACHNOOK?",
  "Any updates on placements at TEACHNOOK?",
  "Tell me about students placed in TEACHNOOK",
  "Recent TEACHNOOK placements",
  "TEACHNOOK placed students",
  "Names of students placed in TEACHNOOK"],
  "responses": ["Jan 10, 2024 15:02 - Jan 10, 2024 15:02<br>CONGRATULATIONS TO THE FOLLOWING STUDENTS OF 2024 BATCH HAVE BEEN SELECTED FOR TEACHNOOK. BENGALURU DURING THE VIRTUAL CAMPUS DRIVE HELD ON 08-01-2024 10-01-2024 FOR A CTC OF 4.0 LPA.<br>1 LAVANYA V ASUTI<br>2 NIDHI KIRAN BETAGERI<br>3 SAATHVI C S<br>4 SHREE LAKSHMI M B<br>5 VINAY SHIVANAGOUDA PATIL<br>6 ALLALLI RUBAYA SULTANA<br>7 BHUVANA P R<br>8 MIRIYALA ROHIT KUMAR<br>9 MOHAMMED TOUFEEQ KHAN<br>10 PRATHIK YESHWANTH P<br>11 SADATH S I<br>12 CHAITRA B.T<br>13 CHAYA G MELAGIRI<br>14 DARSHANAGOUDA PATIL<br>15 DHANRAJ R R<br>16 K. BHUMIKA<br>17 KARTHIK B<br>18 MOHAMMED HAROON U R<br>19 SAHANA B S<br>20 SNEHA RAMESH SORATUR<br>21 SURAJ PRAKASH KADUR<br>22 AASHISH R NETRAKAR<br>23 ANIRUDDHA N<br>24 CHIRANT PATIL<br>25 MADHU D<br>26 SYED SHAHEED AQTHAR<br>27 V M ARPITHA"]
},
{
  "tag": "INDO-MIM PVT. LTD. BENGALURU Details",
  "patterns": ["INDO-MIM PVT. LTD. BENGALURU","INDO-MIM Placements","INDO-MIM PVT. LTD.","INDO-MIM",
  "Recent placements at INDO-MIM",
  "Can you tell me about the recent placements at INDO-MIM?",
  "Tell me about students placed in INDO-MIM",
  "Recent INDO-MIM placements",
  "INDO-MIM placed students",
  "Names of students placed in INDO-MIM"],
  "responses": ["Jan 05, 2024 09:00   -  Jan 05, 2024 12:07<br>CONGRATULATIONS TO THE FOLLOWING STUDENT OF THE 2024 BATCH HAVE BEEN SELECTED FOR INDO-MIM PVT. LTD. BENGALURU DURING THE POOL CAMPUS DRIVE HELD ON MAY 1, 2024, FOR THE ROLE OF GRADUATE ENGINEER TRAINEE (GET) WITH A CTC OF 3.3 LPA.<br>1 ANIRUDDHA N"]
},
{
  "tag": "SHAHI EXPORTS PVT.LTD, BENGALURU Details",
  "patterns": ["SHAHI EXPORTS PVT.LTD, BENGALURU","SHAHI EXPORTS Placements","SHAHI EXPORTS","SHAHI EXPORTS",
  "Recent placements at SHAHI EXPORTS",
  "How are the placements at SHAHI EXPORTS?",
  "Can you tell me about the recent placements at SHAHI EXPORTS?",
  "Any updates on placements at SHAHI EXPORTS?",
  "What's the status of placements at SHAHI EXPORTS?",
  "Tell me about students placed in SHAHI EXPORTS",
  "Recent SHAHI EXPORTS placements",
  "SHAHI EXPORTS placed students",
  "Names of students placed in SHAHI EXPORTS"],
  "responses": ["Dec 21, 2023 14:55   -  Dec 21, 2023 14:55<br>CONGRATULATION TO THE FOLLOWING STUDENTS OF 2024 BATCH HAVE BEEN SELECTED FOR SHAHI EXPORTS PVT.LTD, BENGALURU DURING THE ON CAMPUS DRIVE HELD ON 21-12-2023 FOR A CTC OF 3.0 LPA.<br>1.PRERANA P<br>2.LOHITH S P"]
},{
  "tag": "DESTINATION TECHNOLOGY. BENGALURU Details",
  "patterns": ["DESTINATION TECHNOLOGY. BENGALURU","DESTINATION TECHNOLOGY Placements","DESTINATION TECHNOLOGY",
  "Recent placements at DESTINATION TECHNOLOGY",
  "Can you tell me about the recent placements at DESTINATION TECHNOLOGY?",
  "Any updates on placements at DESTINATION TECHNOLOGY?",
  "Tell me about students placed in DESTINATION TECHNOLOGY",
  "Recent DESTINATION TECHNOLOGY placements",
  "DESTINATION TECHNOLOGY placed students",
  "Names of students placed in DESTINATION TECHNOLOGY"],
  "responses": ["Dec 13, 2023 14:50   -  Dec 13, 2023 14:50<br>CONGRATULATIONS TO THE FOLLOWING STUDENTS OF 2024 BATCH HAVE BEEN SELECTED FOR DESTINATION TECHNOLOGY. BENGALURU DURING THE ON CAMPUS DRIVE HELD ON 13-12-2023 FOR AN AVERAGE CTC OF 3.0-5.0 LPA.<br>1.SURAJ R K<br>2. ABHILASH C<br>3. MADHU D N<br>4. AJAYAKUMAR VIJAYAKUMAR<br>5. MANVITHA G K<br>6. NEETHU P J<br>7. PRIYANKA S<br>8. RAZMIA TASNEEM<br>9. SANJANA B V<br>10. SUDEEP S HALIGONDRA<br>11. ANU R<br>12. LAKSHMI M S<br>13. MANOJ P J<br>14. NEHA MANJUNATH RAIKAR<br>15. SRUJAN S A"]
},
{
  "tag": "ZSCALER, BENGALURU Details",
  "patterns": ["ZSCALER, BENGALURU","ZSCALER Placements","ZSCALER","information on ZSCALER",
  "Recent placements at ZSCALER",
  "Can you tell me about the recent placements at ZSCALER?",
  "Any updates on placements at ZSCALER?",
  "Tell me about students placed in ZSCALER",
  "Recent ZSCALER placements",
  "ZSCALER placed students","information on students placed in ZSCALER",
  "Names of students placed in ZSCALER"],
  "responses": ["Dec 09, 2023 14:52   -  Dec 09, 2023 14:52<br>CONGRATULATIONS TO THE FOLLOWING STUDENTS OF 2024 BATCH HAVE BEEN SELECTED FOR ZSCALER, BENGALURU DURING THE VIRTUAL CAMPUS DRIVE HELD ON 09-12-2023 FOR A CTC OF 14.5 LPA.<br>1.NEHA MANJUNATH RAIKAR<br>2. AISHWARYA H T"]
},
{
  "tag": "ACCENTURE. BENGALURU Details",
  "patterns": ["ACCENTURE. BENGALURU","ACCENTURE Placements","ACCENTURE",
  "Recent placements at ACCENTURE",
  "Can you tell me about the recent placements at ACCENTURE?",
  "Any updates on placements at ACCENTURE?",
  "Tell me about students placed in ACCENTURE",
  "Recent ACCENTURE placements","information on students placed in ACCENTURE",
  "ACCENTURE placed students",
  "Names of students placed in ACCENTURE"],
  "responses": ["Dec 04, 2023 14:59   -  Dec 04, 2023 14:59<br>CONGRATULATIONS TO THE FOLLOWING STUDENTS OF 2024 BATCH HAVE BEEN SELECTED FOR ACCENTURE. BENGALURU DURING THE ON CAMPUS DRIVE HELD ON 04-12-2023 &AMP; 05-12-2023 FOR A CTC OF 4.0 LPA.<br>1 LAVANYA V ASUTI<br>2 A LASYA PRIYA<br>3 THEJASHWINI HIRIYUR MANJUNATHA<br>4 NIKIL BIDARAKATTE SHIVAPRAKASH<br>5 SUPRIYA RAMACHANDRA VERNEKAR<br>6 DISHAN J ALUR<br>7 VISHNU PRASAD JAGADISH BALLEKERE<br>8 KEERTHANA MANJUNATHA SONAR<br>9 AISHWARYA HOLUR THIRTHARAJ<br>10 VISHAL AJAYKUMAR DUNDARADDI<br>11 RAGHAVENDRA MAHESH<br>12 HARSHAVARDHAN SURESH SHET<br>13 SAHANA NUGGEHALLI SURESH<br>14 SAHANA MEDAR M N<br>15 CHANDANA SIDDAPURA<br>16 ANANYA PANDURANGA GUJJAR<br>17 BHOOMIKA NAGARAJAPPA<br>18 ANJALI HANUMANTAPPA KUMBAR<br>19 RISHIKA MUDDAYANAPALYA KRISHNAPPA<br>20 SUPRITA NAGAPPA<br>21 BASAVANAGOWDA NEERTHADI GOWDRU<br>22 LAKSHMI GUDDEMANE RATHNAKAR<br>23 VARSHA VIJAYKUMAR BELAGAVI<br>24 NIKITHA BIDARAKATTE SHIVAPRAKASH<br>25 MEGHANA MAHESH<br>26 NIVEDITHA BHEEMAPPA<br>27 PALLAGATTE AMJAD ALI SUNEHA<br>28APOORVA GOWDRU SHIVARUDRAPPA<br>29NIKITHA NATRAJ CHINCHALI<br>30SANJANA BHAVIHAL RAVI<br>31PRAJWAL ARYA UDAYA SHANKAR<br>32MEGHA RAJENDRAKUMAR<br>33PRAKRUTHI GOWDRU SHIVAKUMAR<br>34GANAVI NAGARAJ<br>35MANOJ KUMAR NARAGANAHALLI"]
},
{
  "tag": "INUBE SOFTWARE SOLUTIONS PVT.LTD. BENGALURU Details",
  "patterns": ["INUBE SOFTWARE SOLUTIONS PVT.LTD. BENGALURU","INUBE Placements","INUBE SOFTWARE SOLUTIONS","INUBE",
  "Recent placements at INUBE",
  "Can you tell me about the recent placements at INUBE?",
  "Any updates on placements at INUBE?",
  "Tell me about students placed in INUBE",
  "Recent INUBE placements","information on students placed in INUBE",
  "INUBE placed students",
  "Names of students placed in INUBE"],
  "responses": ["Oct 31, 2023 10:23   -  Oct 31, 2023 10:23<br>CONGRATULATIONS TO TO THE FOLLOWING STUDENTS OF 2024 BATCH HAVE BEEN SELECTED FOR INUBE SOFTWARE SOLUTIONS PVT.LTD. BENGALURU DURING THE ON CAMPUS DRIVE HELD ON 31-10-2023 FOR A CTC OF 4.0 LPA.<br>1.CHETHAN M KOPPADA<br>2. HARSHITHA H K<br>3. KHUSHI A M NYAMATHI<br>4. MEGHANA S MUNDARAGI<br>5. MOHAMMED JAHANGEER<br>6. SAGAR N TATTI<br>7. SWAROOP ARADHYA N M<br>8. MANJUNATH R<br>9. ARPITHA GOWDA G D<br>10. SAHANA K ACHAR<br>11. VAISHNAVI B M"]
},
{
  "tag": "AARBEE STRUCTURES PVT.LTD., BENGALURU Details",
  "patterns": ["AARBEE STRUCTURES PVT.LTD","AARBEE STRUCTURES Placements",
  "Recent placements at AARBEE STRUCTURES",
  "How are the placements at AARBEE STRUCTURES?",
  "Can you tell me about the recent placements at AARBEE STRUCTURES?",
  "Any updates on placements at AARBEE STRUCTURES?",
  "What's the status of placements at AARBEE STRUCTURES?",
  "Tell me about students placed in AARBEE STRUCTURES",
  "Recent AARBEE STRUCTURES placements",
  "AARBEE STRUCTURES placed students",
  "Names of students placed in AARBEE STRUCTURES"],
  "responses": ["Oct 08, 2023 10:00   -  Oct 08, 2023 10:00<br>TO THE FOLLOWING STUDENTS OF 2024 BATCH HAVE BEEN SELECTED FOR AARBEE STRUCTURES PVT.LTD., BENGALURU DURING THE POOL CAMPUS DRIVE HELD ON 08-10-2023 FOR A CTC OF 3.0 LPA.<br>1. D G BINDU<br>2. SHRAVANI G R"]
},
{
  "tag": "GIGSKY PLACEMENTS Details",
  "patterns": ["GIGSKY","GIGSKY Placements",
  "Recent placements at GIGSKY",
  "How are the placements at GIGSKY?",
  "Can you tell me about the recent placements at GIGSKY?",
  "Any updates on placements at GIGSKY?",
  "What's the status of placements at GIGSKY?",
  "Tell me about students placed in GIGSKY",
  "Recent GIGSKY placements","information on GIGSKY",
  "GIGSKY placed students","information on students placed in GIGSKY",
  "Names of students placed in GIGSKY"],
  "responses": ["Aug 16, 2023 10:23   -  Aug 16, 2023 10:23<br>CONGRATULATIONS TO GIGSKY PLACED STUDENT_2024<br>1. AKSHAY M KALGHATGI<br>2. ABHISHREE K M<br>3. TEJASHWINI G M"]
},
{
  "tag": "VIBS INFOSOL PVT LTD Details",
  "patterns": ["VIBS INFOSOL PVT LTD","VIBS INFOSOL PVT LTD Placements","VIBS INFOSOL",
  "Recent placements at VIBS INFOSOL PVT LTD",
  "Can you tell me about the recent placements at VIBS INFOSOL PVT LTD?",
  "Any updates on placements at VIBS INFOSOL PVT LTD?",
  "Tell me about students placed in VIBS INFOSOL PVT LTD",
  "Recent VIBS INFOSOL PVT LTD placements",
  "VIBS INFOSOL PVT LTD placed students",
  "Names of students placed in VIBS INFOSOL PVT LTD"],
  "responses": ["Jul 11, 2023 18:00   -  Jul 11, 2023 18:00<br>CONGRATULATIONS TO VIBS INFOSOL PVT LTD PLACED STUDENTS_2024<br>1.SHRAVAN S. ALIGAR<br>2.THEJASHWINI H. M.<br>3.HARSHAVARDHAN S SHET<br>4.KAVANA N S<br>5.KUNAL SAXENA<br>6.POOJA K.N.<br>7.S. SUHAS<br>8.MOHAMMAD JAFAR"]
},
{
  "tag": "TESSOLVE SEMICONDUCTORS Details",
  "patterns": ["TESSOLVE SEMICONDUCTORS","TESSOLVE SEMICONDUCTORS Placements",
  "Recent placements at TESSOLVE SEMICONDUCTORS",
  "Can you tell me about the recent placements at TESSOLVE SEMICONDUCTORS?",
  "Any updates on placements at TESSOLVE SEMICONDUCTORS?",
  "Tell me about students placed in TESSOLVE SEMICONDUCTORS",
  "Recent TESSOLVE SEMICONDUCTORS placements",
  "TESSOLVE SEMICONDUCTORS placed students",
  "Names of students placed in TESSOLVE SEMICONDUCTORS"],
  "responses": ["Jul 01, 2023 16:37   -  Jul 01, 2023 16:37<br>CONGRATULATIONS TO TESSOLVE SEMICONDUCTORS PLACED STUDENT_2024<br>1.PAVAN SEPURA"]
},
{
  "tag": "placements",
  "patterns": [
    "Companies visited in 2024","Placements","Placements in 2024","Number of companies visited in 2024"
  ],
  "responses": [
    "Pentagon space<br>Kasmo technology<br>TCS<br>INTELLIPAAT SOFTWARE SOLUTIONS PVT.LTD<br>SANSERA ENGINEERING .LTD<br>TALENT SERVE<br>TEACHNOOK<br>INDO-MIM PVT.LTD.<br>SHAHI EXPORTS PVT.LTD<br>DESTINATION TECHNOLOGY<br>ZSCALER<br>ACCENTURE<br>INUBE SOFTWARE SOLUTIONS PVT.LTD.<br>AARBEE STRUCTURES PVT.LTD.<br>GIGSKY<br>VIBS INFOSOL PVT LTD<br>TESSOLVE SEMICONDUCTORS"
  ]
},
{
  "tag": "aiml vision",
  "patterns": [
    "vision of aiml","give me vision of aiml",
    "what is the vision of aiml",
    "Could you tell me about the vision of the aiml department?",
    "Can you provide insights into the future aspirations of the ECE program?",
    "Tell me the long-term objectives of aiml",
    "What are the ambitions of the ECE field?"
  ],
  "responses": [
    "To be a centre-of-excellence by imbibing state-of-the-art technology in the field of Computer Science and Engineering, thereby enabling students to excel professionally and be ethical."
  ]
},
{
  "tag": "aiml mission",
  "patterns": [
    "mission of aiml",
    "give me mission of artificial intelligence and machine learning",
    "what is the mission of aiml","aiml Mission","what is the aiml Mission","Can you tell me about the mission of the aiml department?",
    "Could you provide insights into the objectives of the aiml program?",
    "Describe the mission statement of the aiml department.",
    "What is the focus of the aiml department?",
    "Tell me the mission statement for aiml."
  ],
  "responses": [
    "Adapting best teaching and learning techniques that cultivates Questioning and Reasoning culture among the students.<br>Creating collaborative learning environment that ignites the critical thinking in students and leading to the innovation.<br>Establishing Industry Institute relationship to bridge the skill gap and make them industry ready and relevant.<br>Mentoring students to be socially responsible by inculcating ethical and moral values."
  ]
},
{
  "tag": "ugaiml peos",
  "patterns": [
    "PEOs of artificial intelligence and machine learning department",
    "what are the program educational objectives of aiml",
    "what are the PEOs of artificial intelligence and machine learning","PEOs of aiml"
  ],
  "responses": [
    "To apply skills acquired in the discipline of Computer Science and Engineering for solving societal and industrial problems with apt technology intervention.<br>To continue the career in industry/academia or to pursue higher studies and research.<br>To become successful entrepreneurs, innovators to design and develop software products and services that meet the societal, technical and business challenges.<br>To work in the diversified environment by acquiring leadership qualities with effective communication skills accompanied by professional and ethical values."
  ]
},
{
  "tag": "aiml psos",
  "patterns": [
    "PSOs of artificial intelligence and machine learning department",
    "what are the program specific outcomes of aiml",
    "what are the PSOs of artificial intelligence and machine learning "
  ],
  "responses": [
    "Analyze and develop solutions for problems that are complex in nature by applying the knowledge acquired from the core subjects of this program.<br>Ability to develop Secure, Scalable, Resilient and distributed applications for industry and societal requirements.<br>Ability to learn and apply the concepts and construct of emerging technologies like Artificial Intelligence, Machine learning, Deep learning, Big Data Analytics, IoT, Cloud Computing, etc for any real time problems."
  ]
},
{
  "tag": "aiml about",
  "patterns": [
    "about aiml department",
    "give me about artificial intelligence and machine learning",
    "information about aiml"
  ],
  "responses": [
    "Department of Computer Science and Engineering was established in 1984 as an academic center for undergraduate studies in engineering. Department offers Undergraduate, Post graduate and research programs in Computer Science and Engineering field and is affiliated to Visvesvaraya Technological University, Belagavi, Karnataka. Undergraduate program is accredited two times by NBA. It is supported by well qualified faculty, non - teaching staff and best - in - class Infrastructure. The faculty members are actively involved in research and development. The staff members have also won the awards from reputed IT organizations like Infosys, IBM and Wipro and achieved academic excellence. 12 faculty members are pursuing research at reputed universities. Department has applied for one US patent in the field of Cluster head election Strategy. One of the faculty members has got best paper award in the URENG conference held at Dubai. Department has produced 5 doctorates in last 10 years."
  ]
},
{
  "tag": "aiml hod",
  "patterns": [
    "aiml HOD",
    "give me artificial intelligence and machine learning hods profile",
    "what is the qualification of aiml hod"
  ],
  "responses": [
    "Dr. Mallikarjuna S B<br>Professor and Head<br> Prof. (Dr.) Mallikarjuna S B (SBM) received his BE degree from the department of Electrical & Electronics Engineering from Government B. D. T. College of Engineering (University of Kuvempu), Davangere in 1994. He started his career as Lecturer at Bapuji Institute of Engineering and Technology (BIET). He persued his Masters degree in Computer Science & Engineering from Mysore University in 2000. After completion of PG, he continued his services at BIET in Computer Science and Engineering department as Lecturer . He was promoted as Assistant Professor in 2006. He served as HOD of Information Science and Engineering department from 2009 to 2013 and also worked as PG coordinator for M.Tech., in Computer Science & Engineering from 2009 to 2013. He was promoted as Associate Professor in 2011 and Professor in 2023 . He received his Doctoral degree (PhD) from Visvesvaraya Technological University (VTU) in 2023 in the field of Computer Science & Machine Learning. Now, he is heading the department of Artificial Intelligence & Machine Learning (AI&ML) from 2022 and also working as Deputy warden for BIET Boys hostel. He has 28 years of experience in teaching and 1 year in industry. "
  ]
},
{
  "tag": "aiml faculty achievements",
  "patterns": [
    "artificial intelligence and machine learning faculty acheivements",
    "give me aiml acheivements of lecturers",
    "staff aiml acheivements in detail"
  ],
  "responses": [
    "Dr. S B Mallikarjuna, Associate Professor, received the Ph.D in 2022-2023 from VTU, Belgaum.<br>Dr. Varsha M, Associate Professor, received the Ph.D in 2022-2023 from VTU, Belgaum."
  ]
},
{
  "tag": "aiml department activities",
  "patterns": [
    "Activities of artificial intelligence and machine learning",
    "activities of aiml",
    "do aiml branch participate in activities."
  ],
  "responses": [
     "Heritage walk Heritage walk for Harihareshwara Temple in view of social connect and responsibility for 3 semester students held on 3/2/2024"
  ]
},
{
  "tag": "aiml number of lecturers",
  "patterns": [
    "total no of lecturers in artificial intelligence and machine learning",
    "total teaching staff in aiml"
  ],
  "responses": [
    "9."
  ]
},
{
  "tag": "aiml faculty members",
  "patterns": [
    "lecturers in artificial intelligence and machine learning department",
    "faculty members of aiml department "
   
  ],
  "responses": [
    "Dr. Mallikarjuna S B<br>Professor<br>Dr. Varsha M<br>Associate Professor<br>Dr. Jyothi G.C.<br>Assistant Professor<br>Dr.Amjad Khan<br>Associate Professor<br>Mrs.Deepashri K M<br>Assistant Professor<br>Mrs.VIJAYALAKSHMI S HALLIKERI. S<br>Assistant Professor<br>Mrs.Bhagya S G<br>Assistant Professor<br>Mrs.Swetha H U<br>Assistant Professor<br>Mr. Santhosha P<br>Assistant Professor"
  ]
},
{
  "tag": "ugaiml technical staff",
  "patterns": [
    "who are technical staff of aiml",
    "technical staff members of artificial intelligence and machine learning department"
   
  ],
  "responses": [
    "Abhishek J J<br>Foreman"
  ]
},
{
  "tag": "ugaiml supporting staff",
  "patterns": [
    "who are supporting staff of aiml",
    "supporting staff members of artificial intelligence and machine learning department"
   
  ],
  "responses": [
    "Gopalakrishna R<br>Attender"
  ]
},
{
  "tag": "csd Vision",
  "patterns": [
    "vision of computer science and design",
    "give me vision of  CSD",
    "what is the vision of computer science and design",
    "what is the vision of CSD","Can you tell me about the vision of the CSD department?","what is the vision of Computer Science and design?",
    "What are the long-term goals of Computer Science and design?",
    "Could you provide insights into the future aspirations of the CSD program?",
    "What is the vision of the CSD department?",
    "Tell me the vision statement for Computer Science and design.",
    "What goals does the CSD department aim to achieve?"
  ],
  "responses": [
    "To be a centre-of-excellence by imbibing state-of-the-art technology in the field of Computer Science and Engineering, thereby enabling students to excel professionally and be ethical."
  ]
},
{
  "tag": "csd mission",
  "patterns": [
    "CSD Mission","what is the Mission of csd","Can you tell me about the mission of the CSd department?","what is the Mission of Computer Science and design?",
        "What are the goals of Computer Science and design",
        "Could you provide insights into the objectives of the CSD program?",
        "Describe the mission statement of the Computer Science and design department.",
        "What is the focus of the CSD department?",
        "Tell me the mission statement for Computer Science and design."
  ],
  "responses": [
    "Adapting best teaching and learning techniques that cultivates Questioning and Reasoning culture among the students.<br>Creating collaborative learning environment that ignites the critical thinking in students and leading to the innovation.<br>Establishing Industry Institute relationship to bridge the skill gap and make them industry ready and relevant.<br>Mentoring students to be socially responsible by inculcating ethical and moral values."
  ]
},
{
  "tag": "csd peos",
  "patterns": [
    "PEOs of computer science and design",
    "what are the program educational objectives of csd",
    "what are the PEOs of computer science and design"
  ],
  "responses": [
    "To apply skills acquired in the discipline of Computer Science and Engineering for solving societal and industrial problems with apt technology intervention.<br>To continue the career in industry/academia or to pursue higher studies and research.<br>To become successful entrepreneurs, innovators to design and develop software products and services that meet the societal, technical and business challenges.<br>To work in the diversified environment by acquiring leadership qualities with effective communication skills accompanied by professional and ethical values."
  ]
},
{
  "tag": "csd psos",
  "patterns": [
    "PSOs of computer science and design",
    "what are the program specific outcomes of computer science and design",
    "what are the PSOs of csd"
  ],
  "responses": [
    "Analyze and develop solutions for problems that are complex in nature by applying the knowledge acquired from the core subjects of this program.<br>Ability to develop Secure, Scalable, Resilient and distributed applications for industry and societal requirements.<br>Ability to learn and apply the concepts and construct of emerging technologies like Artificial Intelligence, Machine learning, Deep learning, Big Data Analytics, IoT, Cloud Computing, etc for any real time problems."
  ]
},
{
  "tag": "csd about",
  "patterns": [
    "about csd department",
    "give me about computer science and design",
    "information about csd"
  ],
  "responses": [
    "Department of Computer Science and Engineering was established in 1984 as an academic center for undergraduate studies in engineering. Department offers Undergraduate, Post graduate and research programs in Computer Science and Engineering field and is affiliated to Visvesvaraya Technological University, Belagavi, Karnataka. Undergraduate program is accredited two times by NBA. It is supported by well qualified faculty, non - teaching staff and best - in - class Infrastructure. The faculty members are actively involved in research and development. The staff members have also won the awards from reputed IT organizations like Infosys, IBM and Wipro and achieved academic excellence. 12 faculty members are pursuing research at reputed universities. Department has applied for one US patent in the field of Cluster head election Strategy. One of the faculty members has got best paper award in the URENG conference held at Dubai. Department has produced 5 doctorates in last 10 years."
  ]
},
{
  "tag": "csd department activities",
  "patterns": [
    "Activities of computer science and design",
    "activities of csd",
    "do csd branch participate in activities."
  ],
  "responses": [
     "NSS <br>yoga under SCR activity <br>SCR activity <br>SCR activity "
  ]
},
{
  "tag": "csd number of lecturers",
  "patterns": [
    "total no of lecturers in computer science and design",
    "total teaching staff in csd"
   
  ],
  "responses": [
    "5."
  ]
},
{
  "tag": "csd faculty members",
  "patterns": [
    "lecturers in computer science and design department",
    "faculty members of csd department"
   
  ],
  "responses": [
    "Shadaksharaiah C<br>Assistant Professor<br>Kaveri C<br>Assistant professor<br>Madhuri deekshith S<br>Assistant professor<br>Navya K G<br>Assistant Professor"
  ]
},
{
  "tag": "csd technical staff",
  "patterns": [
    "who are technical staff of csd",
    "technical staff members of computer science and design department "
   
  ],
  "responses": [
    "Yuvaraj T M<br>Instructor"
  ]
},
{
  "tag": "csd supporting staff",
  "patterns": [
    "who are supporting staff of csd",
    "supporting staff members of computer science and design department "
   
  ],
  "responses": [
    "Suresh<br>Attender<br>Shadaksharaiah C<br>Assistant Processor"
  ]
},
{
  "tag": "civil placements 2018-19",
  "patterns": [
      "number of students placed in civil in 2018-19",
      "civil placements in 2018-19",
      "2019-20 civil placements","2019 2020 civil placements"
  ],
  "responses": [
      "24 students got placed in civil deepartment in 2018-19"
  ]
},
{
  "tag": "civil placements 2019-20",
  "patterns": [
      "number of students placed in civil in 2019-20",
      "civil placements in 2019-20",
      "2019-20 civil placements","2019 2020 civil placements"
  ],
  "responses": [
      "19 students got placed in civil deepartment in 2019-20"
  ]
},
{
  "tag": "civil placements 2020-21",
  "patterns": [
      "number of students placed in civil in 2020-21",
      "civil placements in 2020-21",
      "2020-21 civil placements","2020 2021 civil placements"
  ],
  "responses": [
      "5 students got placed in civil deepartment in 2020-21"
  ]
},
{
  "tag": "civil placements 2021-22",
  "patterns": [
      "number of students placed in civil in 2021-22",
      "civil placements in 2021-22",
      "2021-22 civil placements","2021 2022 civil placements"
  ],
  "responses": [
      "9 students got placed in civil deepartment in 2021-22"
  ]
},
{
  "tag": "civil placements 2022-23",
  "patterns": [
      "number of students placed in civil in 2022-23",
      "civil placements in 2022-23",
      "2022-23 civil placements","2022-23 civil placements"
  ],
  "responses": [
      "8 students got placed in civil deepartment in 2022-23"
  ]
},
{
  "tag": "civil placements package 2018-19",
  "patterns": [
      "highest package for civil department in 2018-19"
  ],
  "responses": [
      "360000"
  ]
},
{
  "tag": "civil placements package 2019-20",
  "patterns": [
      "highest package for civil department in 2019-20"
  ],
  "responses": [
      "186000"
  ]
},
{
  "tag": "civil placements package 2020-21",
  "patterns": [
      "highest package for civil department in 2020-21"
  ],
  "responses": [
      "360000"
  ]
},
{
  "tag": "civil placements package 2021-22",
  "patterns": [
      "highest package for civil department in 2021-22"
  ],
  "responses": [
      "420000"
  ]
},
{
  "tag": "civil placements package 2022-23",
  "patterns": [
      "highest package for civil department in 2022-23"
  ],
  "responses": [
      "360000"
  ]
},
{
  "tag": "csbs",
  "patterns": [
    "what is the vision of CSbs","Can you tell me about the vision of the CSbs department?","what is the vision of Computer Science and business system?",
      "What are the long-term goals of Computer Science and business system",
      "Could you provide insights into the future aspirations of the CSbs program?",
      "What is the vision of the CSBS department?",
      "Tell me the vision statement for Computer Science and business system",
      "What goals does the CSBS department aim to achieve?"
  ],
  "responses": [
    "To be a centre-of-excellence by imbibing state-of-the-art technology in the field of Computer Science and Engineering, thereby enabling students to excel professionally and be ethical."
  ]
},
{
  "tag": "csbs mission",
  "patterns": [
    "CSBS Mission","what is the Mission of CSBS","Can you tell me about the mission of the CSBS department?","what is the Mission of Computer Science and business system",
      "What are the goals of Computer Science and business system",
      "Could you provide insights into the objectives of the CSBS program?",
      "Describe the mission statement of the Computer Science and business system department.",
      "What is the focus of the CSBS department?",
      "Tell me the mission statement for Computer Science and business system"
  ],
  "responses": [
    "Adapting best teaching and learning techniques that cultivates Questioning and Reasoning culture among the students.<br>Creating collaborative learning environment that ignites the critical thinking in students and leading to the innovation.<br>Establishing Industry Institute relationship to bridge the skill gap and make them industry ready and relevant.<br>Mentoring students to be socially responsible by inculcating ethical and moral values."
  ]
},
{
  "tag": "csbs peos",
  "patterns": [
    "PEOs of computer science and business system",
    "what are the program educational objectives of csbs",
    "what are the PEOs of computer science and business system "
  ],
  "responses": [
    "To apply skills acquired in the discipline of Computer Science and Engineering for solving societal and industrial problems with apt technology intervention.<br>To continue the career in industry/academia or to pursue higher studies and research.<br>To become successful entrepreneurs, innovators to design and develop software products and services that meet the societal, technical and business challenges.<br>To work in the diversified environment by acquiring leadership qualities with effective communication skills accompanied by professional and ethical values."
  ]
},
{
  "tag": "csbs psos",
  "patterns": [
    "PSOs of computer science and business system",
    "what are the program specific outcomes of computer science and business system",
    "what are the PSOs of csbs "
  ],
  "responses": [
    "Analyze and develop solutions for problems that are complex in nature by applying the knowledge acquired from the core subjects of this program.<br>Ability to develop Secure, Scalable, Resilient and distributed applications for industry and societal requirements.<br>Ability to learn and apply the concepts and construct of emerging technologies like Artificial Intelligence, Machine learning, Deep learning, Big Data Analytics, IoT, Cloud Computing, etc for any real time problems."
  ]
},
{
  "tag": "csbs hod",
  "patterns": [
    "csbs HOD",
    "computer science and business system hod profile",
    "what is the qualification of csbs hod"
  ],
  "responses": [
    "Dr. Vinutha H P<br>Professor & Head<br> Dr. Vinutha H P, a distinguished academician with 18 years of experience, serves as the Head of the Computer Science and Business Systems Department. Holding a Ph.D. in CS&E, she has made significant contributions to education and research. Driven by a commitment to excellence, currently leads the department, showcasing strong leadership. Her expertise extends across various roles, from NIRF coordinator to Dean of the Incubation Center, showcasing a multifaceted approach to academic administration. Dr. Vinutha actively imparts knowledge in a broad spectrum of subjects, and her contributions to conferences and journals, particularly in intrusion detection and artificial intelligence, highlight her research acumen. Beyond academia, she has organized diverse events, including workshops and hackathons, reflecting a proactive stance in keeping abreast of emerging technologies. Additionally, she has attended workshops by industry leaders like IBM and Infosys, emphasizing her commitment to continuous learning."
  ]
},
{
  "tag": "csbs about",
  "patterns": [
    "about csbs department",
    "give me about computer science and business system",
    "information about csbs"
  ],
  "responses": [
    "Department of Computer Science and Engineering was established in 1984 as an academic center for undergraduate studies in engineering. Department offers Undergraduate, Post graduate and research programs in Computer Science and Engineering field and is affiliated to Visvesvaraya Technological University, Belagavi, Karnataka. Undergraduate program is accredited two times by NBA. It is supported by well qualified faculty, non - teaching staff and best - in - class Infrastructure. The faculty members are actively involved in research and development. The staff members have also won the awards from reputed IT organizations like Infosys, IBM and Wipro and achieved academic excellence. 12 faculty members are pursuing research at reputed universities. Department has applied for one US patent in the field of Cluster head election Strategy. One of the faculty members has got best paper award in the URENG conference held at Dubai. Department has produced 5 doctorates in last 10 years."
  ]
},
{
  "tag": "csbs number of lecturers",
  "patterns": [
    "total no of lecturers in computer science and business system",
    "total teaching staff in csbs"
  ],
  "responses": [
    "3."
  ]
},
{
  "tag": "csbs faculty members",
  "patterns": [
    "lecturers in computer science and Business system",
    "faculty members of csbd department "
  ],
  "responses": [
    "Puneeth B H<br>Assistant Professor<br>Amrutha S M<br>Assistant Professor<br>Priyanka S N<br>Assistant Professor"
  ]
},
{
  "tag": "cse placements 2018-19",
  "patterns": [
      "number of students placed in cse in 2018-19",
      "cse placements in 2018-19",
      "2019-20 cse placements"
  ],
  "responses": [
      "72 students got placed in cse deepartment in 2018-19"
  ]
},
{
  "tag": "cse placements 2019-20",
  "patterns": [
      "number of students placed in cse in 2019-20",
      "cse placements in 2019-20",
      "2019-20 cse placements"
  ],
  "responses": [
      "77 students got placed in cse deepartment in 2019-20"
  ]
},
{
  "tag": "cse placements 2020-21",
  "patterns": [
      "number of students placed in cse in 2020-21",
      "cse placements in 2020-21",
      "2020-21 cse placements"
  ],
  "responses": [
      "67 students got placed in cse deepartment in 2020-21"
  ]
},
{
  "tag": "cse placements 2021-22",
  "patterns": [
      "number of students placed in cse in 2021-22",
      "cse placements in 2021-22",
      "2021-22 cse placements"
  ],
  "responses": [
      "105 students got placed in cse deepartment in 2021-22"
  ]
},
{
  "tag": "cse placements 2022-23",
  "patterns": [
      "number of students placed in cse in 2022-23","students placed in cse in 2022 2023",
      "cse placements in 2022-23",
      "2022-23 cse placements","2022 2023 cse placements"
  ],
  "responses": [
      "86 students got placed in cse deepartment in 2022-23"
  ]
},
{
  "tag": "cse placements package 2018-19",
  "patterns": [
      "highest package for cse department in 2018-19"
  ],
  "responses": [
      "6 LPA"
  ]
},
{
  "tag": "cse placements package 2019-20",
  "patterns": [
      "highest package for cse department in 2019-20"
  ],
  "responses": [
      "7 LPA"
  ]
},
{
  "tag": "cse placements package 2020-21",
  "patterns": [
      "highest package for cse department in 2020-21"
  ],
  "responses": [
      "6 LPA"
  ]
},
{
  "tag": "cse placements package 2021-22",
  "patterns": [
      "highest package for cse department in 2021-22"
  ],
  "responses": [
      "22 LPA"
  ]
},
{
  "tag": "cse placements package 2022-23",
  "patterns": [
      "highest package for cse department in 2022-23"
  ],
  "responses": [
      "12 LPA"
  ]
},
{
  "tag": "cse number of companies visited in 2018-19",
  "patterns": [
      "number of companies visited for cse department in 2018-19","companies visited for cse in 2018-19","companies visited for cse in 2018 19"
  ],
  "responses": [
      "12"
  ]
},
{
  "tag": "cse number of companies visited in 2019-20",
  "patterns": [
      "number of companies visited for cse department in 2019-20"
  ],
  "responses": [
      "10"
  ]
},
{
  "tag": "cse number of companies visited in 2020-21",
  "patterns": [
      "number of companies visited for cse department in 2020-21","companies visited for cse department in 2021"
  ],
  "responses": [
      "15"
  ]
},
{
  "tag": "cse number of companies visited in 2021-22",
  "patterns": [
      "number of companies visited for cse department in 2021-22"
  ],
  "responses": [
      "32"
  ]
},
{
  "tag": "cse number of companies visited in 2022-23",
  "patterns": [
      "number of companies visited for cse department in 2022-23"
  ],
  "responses": [
      "48"
  ]
},{
  "tag": "ise placements 2018-19",
  "patterns": [
      "number of students placed in ise in 2018-19",
      "ise placements in 2018-19",
      "2018-19 ise placements","19 ise placements"
  ],
  "responses": [
      "53 students got placed in ise deepartment in 2018-19"
  ]
},
{
  "tag": "ise placements 2019-20",
  "patterns": [
      "number of students placed in ise in 2019-20",
      "ise placements in 2019-20",
      "2019-20 ise placements","2020 ise placements"
  ],
  "responses": [
      "44 students got placed in ise deepartment in 2019-20"
  ]
},
{
  "tag": "ise placements 2020-21",
  "patterns": [
      "number of students placed in ise in 2020-21",
      "ise placements in 2020-21",
      "2020-21 ise placements","2021 ise placements"
  ],
  "responses": [
      "52 students got placed in ise deepartment in 2020-21"
  ]
},
{
  "tag": "ise placements 2021-22",
  "patterns": [
      "number of students placed in ise in 2021-22",
      "ise placements in 2021-22",
      "2021-22 ise placements","2022 ise placements"
  ],
  "responses": [
      "78 students got placed in ise deepartment in 2021-22"
  ]
},{
  "tag": "ise placements 2022-23",
  "patterns": [
      "number of students placed in ise in 2022-23","students placed in ise in 2022 2023",
      "ise placements in 2022-23",
      "2022-23 ise placements","2023 ise placements"
  ],
  "responses": [
      "73 students got placed in ise deepartment in 2022-23"
  ]
},
{
  "tag": "ise placements package 2018-19",
  "patterns": [
      "highest package for ise department in 2018-19"
  ],
  "responses": [
      "6 LPA"
  ]
},
{
  "tag": "ise placements package 2019-20",
  "patterns": [
      "highest package for ise department in 2019-20"
  ],
  "responses": [
      "7 LPA"
  ]
},
{
  "tag": "ise placements package 2020-21",
  "patterns": [
      "highest package for ise department in 2020-21"
  ],
  "responses": [
      "6 LPA"
  ]
},
{
  "tag": "ise placements package 2021-22",
  "patterns": [
      "highest package for ise department in 2021-22","highest package for ise"
  ],
  "responses": [
      "12 LPA"
  ]
},
{
  "tag": "ise placements package 2022-23",
  "patterns": [
      "highest package for ise department in 2022-23"
  ],
  "responses": [
      "10 LPA"
  ]
},
{
  "tag": "ise number of companies visited in 2018-19",
  "patterns": [
      "number of companies visited for ise department in 2018-19"
  ],
  "responses": [
      "12"
  ]
},
{
  "tag": "ise number of companies visited in 2019-20",
  "patterns": [
      "number of companies visited for ise department in 2019-20"
  ],
  "responses": [
      "10"
  ]
},
{
  "tag": "ise number of companies visited in 2020-21",
  "patterns": [
      "number of companies visited for ise department in 2020-21"
  ],
  "responses": [
      "15"
  ]
},
{
  "tag": "ise number of companies visited in 2021-22",
  "patterns": [
      "number of companies visited for ise department in 2021-22"
  ],
  "responses": [
      "32"
  ]
},
{
  "tag": "ise number of companies visited in 2022-23",
  "patterns": [
      "number of companies visited for ise department in 2022-23"
  ],
  "responses": [
      "21"
  ]
},
{
  "tag": "datascience vision",
  "patterns": [
    "what is the vision of data science","give the vision of data science","Can you tell me about the vision of the data science department?","what is the vision of data science",
    "What are the long-term goals of data science",
    "Could you provide insights into the future aspirations of the data science program?",
    "Describe the overarching goals of the data science department.",
    "What is the vision of the data science department?",
    "Tell me the vision statement for data science.",
    "What goals does the data science department aim to achieve?"
  ],
  "responses": [
    "To be a centre-of-excellence by imbibing state-of-the-art technology in the field of Computer Science and Engineering, thereby enabling students to excel professionally and be ethical."
  ]
},
{
  "tag": "datascience mission",
  "patterns": [
    "mission of data science",
    "give me mission of data science",
    "what is the mission of data science","data science Mission","what is the data science Mission","Can you tell me about the mission of the data science department?",
    "Could you provide insights into the objectives of the data science program?",
    "Describe the mission statement of the data science department.",
    "What is the focus of the data science department?",
    "Tell me the mission statement for data science."
  ],
  "responses": [
    "Adapting best teaching and learning techniques that cultivates Questioning and Reasoning culture among the students.<br>Creating collaborative learning environment that ignites the critical thinking in students and leading to the innovation.<br>Establishing Industry Institute relationship to bridge the skill gap and make them industry ready and relevant.<br>Mentoring students to be socially responsible by inculcating ethical and moral values."
  ]
},
{
  "tag": "data science peos",
  "patterns": [
    "PEOs of data science department",
    "what are the program educational objectives of datascience",
    "what are the PEOs of data science"
  ],
  "responses": [
    "To apply skills acquired in the discipline of Computer Science and Engineering for solving societal and industrial problems with apt technology intervention.<br>To continue the career in industry/academia or to pursue higher studies and research.<br>To become successful entrepreneurs, innovators to design and develop software products and services that meet the societal, technical and business challenges.<br>To work in the diversified environment by acquiring leadership qualities with effective communication skills accompanied by professional and ethical values."
  ]
},
{
  "tag": "data science psos",
  "patterns": [
    "PSOs of datascience department",
    "what are the program specific outcomes of data science",
    "what are the PSOs of datascience"
  ],
  "responses": [
    "Analyze and develop solutions for problems that are complex in nature by applying the knowledge acquired from the core subjects of this program.<br>Ability to develop Secure, Scalable, Resilient and distributed applications for industry and societal requirements.<br>Ability to learn and apply the concepts and construct of emerging technologies like Artificial Intelligence, Machine learning, Deep learning, Big Data Analytics, IoT, Cloud Computing, etc for any real time problems."
  ]
},
{
  "tag": "datascience hod",
  "patterns": [
    "data science HOD",
    "give me datascience hods profile",
    "what is the qualification of datascience hod"
  ],
  "responses": [
    "Vinay M T<br>Assistant Professor and Head<br> Work Experience: 3 Years<br>Worked as a lecturer in BCA Department of Davan Institute Of Management, Davangere from July 2017 to December 2017.<br> Worked as a lecturer in BCA Department of SBC First Grade College for women, Davangere from July 2017 to December 2017.<br>Working as an Assistant Professor in IS&E Department of Bapuji Institute of Engineering and Technology, Davanagere, from January 2018.<br>INDUSTRY EXPERIENCE: Worked as an ASP.NETMVC developer from August 2016 to February2017, in the iNube Software Solutions Pvt. Ltd. Bangalore.<br> Educational Qualification:M.Tech [CS&E] from BIET, Davangere, VTU University, 2017 with First Class Distinction.<br>B.E [CS&E] from BIET, Davangere, VTU University, 2015 with FirstClass"
  ]
},
{
  "tag": "datascience faculty achievements",
  "patterns": [
    "datascience faculty acheivements",
    "give me datascience acheivements of lecturers",
    "staff data science acheivements in detail"
  ],
  "responses": [
    "Dr. Pradeep N, Prof. Gowramma and Prof. Bharath H C have completed the course Applied Generative AI and got Certification in Infosys Springboard<br>Dr. Pradeep N, Prof. Gowramma B H and Prof. Bharath H C have completed the course Principles of Generative AI and got Certification in Infosys Springboard<br>Dr. Pradeep N have completed Patent Drafting for Beginners NPTEL course and got certification by passing NPTEL online exam<br>Dr. Pradeep N, Prof. Gowramma and Prof. Bharath H C have completed the course Citizen Data Science using Python and got Certification in Infosys Springboard"
  ]
},
{
  "tag": "datascience department activities",
  "patterns": [
    "Activities of datascience engineering",
    "activities of data science",
    "do datascience branch participate in activities."
  ],
  "responses": [
     "Technical Talk on 'Data Science: Impact on Administration, Decision Maker, Academician and Research Scholar' by Dr. Hareesha K S, Director, International Centre for Applied Sciences, MIT Campus, MAHE<br>Technical Talk on 'Data Science: Scope, Demand and Career Opportunities' by Ram Mohan, Principal Data Scientist, Automation Anywhere.<br>Forum Logo Design Competition"
  ]
},{
  "tag": "datascience number of lecturers",
  "patterns": [
    "total no of lecturers datascience",
    "total teaching staff in data science"
  ],
  "responses": [
    "5."
  ]
},
{
  "tag": "datascience labs",
  "patterns": [
    "total no of labs in data science department",
    "total labs in datascience"
  ],
  "responses": [
    "2"
  ]
},
{
  "tag": "datascience faculty members",
  "patterns": [
    "lecturers in data sciencedepartment",
    "faculty members of datascience department"
  ],
  "responses": [
    "Vinay M T<br>Assistant Professor<br>Mrs. Gowramma B H<br>Assistant Professor<br>Mrs. RANJANA B JADEKAR<br>Assistant Professor<br>Bharath H C<br>Assistant Professor<br>Usha C<br>Assistant Professor"
  ]
},
{
  "tag": "datascience technical staff",
  "patterns": [
    "who are technical staff of datascience",
    "technical staff members of data science department"
  ],
  "responses": [
    " Pramod H<br>Instructor"
  ]
},
{
  "tag": "ece placements 2018-19",
  "patterns": [
      "number of students placed in EC in 2018-19",
      "EC placements in 2018-19",
      "2019-20 EC placements"
  ],
  "responses": [
      "65 students got placed in EC deepartment in 2018-19"
  ]
},
{
  "tag": "EC placements 2019-20",
  "patterns": [
      "number of students placed in EC in 2019-20","students placed in EC in 2019 2020",
      "EC placements in 2019-20",
      "2019-20 EC placements","2019 2020 EC placements"
  ],
  "responses": [
      "56 students got placed in EC deepartment in 2019-20"
  ]
},
{
  "tag": "EC placements 2020-21",
  "patterns": [
      "number of students placed in EC in 2020-21","students placed in EC in 2020 2021",
      "EC placements in 2020-21",
      "2020-21 EC placements","2019 2020 EC placements"
  ],
  "responses": [
      "55 students got placed in EC deepartment in 2020-21"
  ]
},
{
  "tag": "EC placements 2021-22",
  "patterns": [
      "number of students placed in EC in 2021-22",
      "EC placements in 2021-22",
      "2021-22 EC placements","2021 2022 EC placements"
  ],
  "responses": [
      "98 students got placed in EC deepartment in 2021-22"
  ]
},
{
  "tag": "EC placements 2022-23",
  "patterns": [
      "number of students placed in EC in 2022-23","students placed in EC in 2022 2023",
      "EC placements in 2022-23",
      "2022-23 EC placements","2022 2023 EC placements"
  ],
  "responses": [
      "55 students got placed in EC deepartment in 2022-23"
  ]
},
{
  "tag": "EC placements package 2018-19",
  "patterns": [
      "highest package for EC department in 2018-19"
  ],
  "responses": [
      "4 LPA"
  ]
},
{
  "tag": "EC placements package 2019-20",
  "patterns": [
      "highest package for EC department in 2019-20"
  ],
  "responses": [
      "5 LPA"
  ]
},
{
  "tag": "EC placements package 2020-21",
  "patterns": [
      "highest package for EC department in 2020-21"
  ],
  "responses": [
      "7 LPA"
  ]
},
{
  "tag": "EC placements package 2021-22",
  "patterns": [
      "highest package for EC department in 2021-22"
  ],
  "responses": [
      "7 LPA"
  ]
},
{
  "tag": "EC placements package 2022-23",
  "patterns": [
      "highest package for EC department in 2022-23"
  ],
  "responses": [
      "10 LPA"
  ]
},
{
  "tag": "EC number of companies visited in 2018-19",
  "patterns": [
      "number of companies visited for EC department in 2018-19"
  ],
  "responses": [
      "10"
  ]
},
{
  "tag": "EC number of companies visited in 2019-20",
  "patterns": [
      "number of companies visited for EC department in 2019-20"
  ],
  "responses": [
      "13"
  ]
},{
  "tag": "EC number of companies visited in 2020-21",
  "patterns": [
      "number of companies visited for EC department in 2020-21"
  ],
  "responses": [
      "22"
  ]
},
{
  "tag": "EC number of companies visited in 2021-22",
  "patterns": [
      "number of companies visited for EC department in 2021-22"
  ],
  "responses": [
      "26"
  ]
},
{
  "tag": "EC number of companies visited in 2022-23",
  "patterns": [
      "number of companies visited for EC department in 2022-23"
  ],
  "responses": [
      "10"
  ]
},
{
  "tag": "EEE placements 2018-19",
  "patterns": [
      "number of students placed in EEE in 2018-19",
      "EEE placements in 2018-19",
      "2019-20 EEE placements"
  ],
  "responses": [
      "13 students got placed in EEE deepartment in 2018-19"
  ]
},
{
  "tag": "EEE placements 2019-20",
  "patterns": [
      "number of students placed in EEE in 2019-20","students placed in EEE in 2019 2020",
      "EEE placements in 2019-20",
      "2019-20 EEE placements","2019 2020 EEE placements"
  ],
  "responses": [
      "10 students got placed in EEE deepartment in 2019-20"
  ]
},
{
  "tag": "EEE placements 2020-21",
  "patterns": [
      "number of students placed in EEE in 2020-21","students placed in EEE in 2020 2021",
      "EEE placements in 2020-21",
      "2020-21 EEE placements","2021 2022 EEE placements"
  ],
  "responses": [
      "23 students got placed in EEE deepartment in 2020-21"
  ]
},
{
  "tag": "EEE placements 2021-22",
  "patterns": [
      "number of students placed in EEE in 2021-22","students placed in EEE in 2021 2022",
      "EEE placements in 2021-22",
      "2021-22 EEE placements","2021-22 EEE placements"
  ],
  "responses": [
      "16 students got placed in EEE deepartment in 2021-22"
  ]
},
{
  "tag": "EEE placements 2022-23",
  "patterns": [
      "number of students placed in EEE in 2022-23","students placed in EEE in 2022 2023",
      "EEE placements in 2022-23",
      "2022-23 EEE placements","2022 2023 EEE placements"
  ],
  "responses": [
      "18 students got placed in EEE deepartment in 2022-23"
  ]
},
{
  "tag": "EEE placements package 2018-19",
  "patterns": [
      "highest package for EEE department in 2018-19"
  ],
  "responses": [
      "4 LPA"
  ]
},
{
  "tag": "EEE placements package 2019-20",
  "patterns": [
      "highest package for EEE department in 2019-20"
  ],
  "responses": [
      "4 LPA"
  ]
},
{
  "tag": "EEE placements package 2020-21",
  "patterns": [
      "highest package for EEE department in 2020-21"
  ],
  "responses": [
      "5 LPA"
  ]
},
{
  "tag": "EEE placements package 2021-22",
  "patterns": [
      "highest package for EEE department in 2021-22"
  ],
  "responses": [
      "6 LPA"
  ]
},
{
  "tag": "EEE placements package 2022-23",
  "patterns": [
      "highest package for EEE department in 2022-23"
  ],
  "responses": [
      "4 LPA"
  ]
},
{
  "tag": "EEE number of companies visited in 2018-19",
  "patterns": [
      "number of companies visited for EEE department in 2018-19"
  ],
  "responses": [
      "10"
  ]
},
{
  "tag": "EEE number of companies visited in 2019-20",
  "patterns": [
      "number of companies visited for EEE department in 2019-20"
  ],
  "responses": [
      "13"
  ]
},
{
  "tag": "EEE number of companies visited in 2020-21",
  "patterns": [
      "number of companies visited for EEE department in 2020-21"
  ],
  "responses": [
      "22"
  ]
},
{
  "tag": "EEE number of companies visited in 2021-22",
  "patterns": [
      "number of companies visited for EEE department in 2021-22"
  ],
  "responses": [
      "16"
  ]
},
{
  "tag": "EEE number of companies visited in 2022-23",
  "patterns": [
      "number of companies visited for EC department in 2022-23"
  ],
  "responses": [
      "10"
  ]
},
{
  "tag": "mechanical placements 2018-19",
  "patterns": [
      "mechanical number of students placed in mechanical in 2018-19","students placed in mechanical in 2018 2019",
      "mechanical placements in 2018-19",
      "2019-20 mechanical placements","2019 2020 mechanical placements"
  ],
  "responses": [
      "25 students got placed in mechanical deepartment in 2018-19"
  ]
},{
  "tag": "mechanical placements 2019-20",
  "patterns": [
      "number of students placed in mechanical in 2019-20","students placed in mechanical in 2019 2020",
      "mechanical placements in 2019-20",
      "2019-20 mechanical placements","2019 2020 mechanical placements"
  ],
  "responses": [
      "42 students got placed in mechanical deepartment in 2019-20"
  ]
},
{
  "tag": "mechanical placements 2020-21",
  "patterns": [
      "number of students placed in mechanical in 2020-21","students placed in mechanical in 2020 2021",
      "mechanical placements in 2020-21",
      "2020-21 mechanical placements","2020 2021 mechanical placements"
  ],
  "responses": [
      "13 students got placed in mechanical deepartment in 2020-21"
  ]
},
{
  "tag": "mechanical placements 2022-23",
  "patterns": [
      "number of students placed in mechanical in 2022-23","students placed in mechanical in 2022 2023",
      "mechanical placements in 2022-23",
      "2022-23 mechanical placements","2022 2023 mechanical placements"
  ],
  "responses": [
      "41 students got placed in mechanical deepartment in 2022-23"
  ]
},
{
  "tag": "mechanical placements package 2018-19",
  "patterns": [
      "highest package for mechanical department in 2018-19"
  ],
  "responses": [
      "4 LPA"
  ]
},
{
  "tag": "mechanical placements package 2019-20",
  "patterns": [
      "highest package for mechanical department in 2019-20"
  ],
  "responses": [
      "10 LPA"
  ]
},
{
  "tag": "mechanical placements package 2020-21",
  "patterns": [
      "highest package for mechanical department in 2020-21"
  ],
  "responses": [
      "4 LPA"
  ]
},
{
  "tag": "mechanical placements package 2022-23",
  "patterns": [
      "highest package for mechanical department in 2022-23"
  ],
  "responses": [
      "6 LPA"
  ]
},
{
  "tag": "mechanical number of companies visited in 2018-19",
  "patterns": [
      "number of companies visited for mechanical department in 2018-19"
  ],
  "responses": [
      "8"
  ]
},
{
  "tag": "mechanical number of companies visited in 2019-20",
  "patterns": [
      "number of companies visited for mechanical department in 2019-20"
  ],
  "responses": [
      "10"
  ]
},
{
  "tag": "mechanical number of companies visited in 2020-21",
  "patterns": [
      "number of companies visited for mechanical department in 2020-21"
  ],
  "responses": [
      "10"
  ]
},
{
  "tag": "mechanical number of companies visited in 2022-23",
  "patterns": [
      "companies visited for mechanical department in 2022-23"
  ],
  "responses": [
      "30"
  ]
},
{
  "tag": "biet no of placements in  2018-19",
  "patterns": [
      "number of students placed  in 2018-19",
      " placements in 2018-19","list students placed in 2019",
      "2019-20  placements"
  ],
  "responses": [
      "252 students got placed  in 2018-19"
  ]
},
{
  "tag": "biet no of placements in  2019-20",
  "patterns": [
      "number of students placed  in 2019-20",
      " placements in 2019-20","list students placed in 2020",
      "2019-20  placements"
  ],
  "responses": [
      "248 students got placed  in 2019-20"
  ]
},
{
  "tag": "biet no of placements in  2020-21",
  "patterns": [
      "number of students placed  in 2020-21",
      " placements in 2020-21","list students placed in 2021",
      "2020-21  placements"
  ],
  "responses": [
      "215 students got placed  in 2020-21"
  ]
},
{
  "tag": "biet no of placements in  2021-22",
  "patterns": [
      "number of students placed  in 2021-22",
      " placements in 2021-22","list students placed in 2022",
      "2021-22  placements"
  ],
  "responses": [
      "313 students got placed  in 2021-22"
  ]
},
{
  "tag": "biet no of placements in  2022-23",
  "patterns": [
      "number of students placed in 2022-23",
      "placements in 2022-23","list students placed in 2023",
      "2022-23 placements"
  ],
  "responses": [
      "252 students got placed  in 2022-23"
  ]
},
{
  "tag": "total number of companies in 2018-19",
  "patterns": [
      "number of companies visited in 2018-19","number of companies visited in 2019","companies visited in 2019",
      "companies in 2018-19"
  ],
  "responses": [
      "A total of 57 companies visited in 2018-19"
  ]
},
{
  "tag": "total number of companies in 2019-20",
  "patterns": [
      "number of companies visited in 2019-20","number of companies visited in 2020","companies visited in 2020",
      "companies in 2019-20"
  ],
  "responses": [
      "A total of 62 companies visited in 2019-20"
  ]
},
{
  "tag": "total number of companies in 2020-21",
  "patterns": [
      "number of companies visited in 2020-21","number of companies visited in 2021","companies visited in 2021",
      "companies in 2020-21"
  ],
  "responses": [
      "A total of 91 companies visited in 2020-21"
  ]
},
{
  "tag": "total number of companies in 2021-22",
  "patterns": [
      "number of companies visited in 2021-22","number of companies visited in 2022","companies visited in 2022",
      "companies in 2021-22"
  ],
  "responses": [
      "A total of 115 companies visited in 2021-22"
  ]
},
{
  "tag": "total number of companies in 2022-23",
  "patterns": [
      "number of companies visited in 2022-23","number of companies visited in 2023","companies visited in 2023",
      "companies in 2022-23"
  ],
  "responses": [
      "A total of 126 companies visited in 2022-23"
  ]
},
{
        "tag": "goodbye",
        "patterns": ["Bye", "See you later", "Goodbye"],
        "responses": [
          "See you later, thanks for visiting",
          "Have a nice day",
          "Sad to see you go :(",
          "Bye! Come back again soon."
        ],
        "context_set": ""
      },
      {
        "tag": "thanks",
        "patterns": ["Thanks", "Thank you", "That's helpful", "Thank's a lot!"],
        "responses": ["Happy to help!", "Any time!", "My pleasure"]
      },
      {
        "tag": "BIET",
        "patterns": [
          "About BIET","BIET",
          "Tell me about BIET college",
          "Information about BIET",
          "History of BIET"
        ],
        "responses": [
          "Bapuji Institute of Engineering and Technology, Davangere (BIET) is an Engineering and Technology institute located in the city of Davangere, Karnataka, India. The College houses around 18 different departments. It offers Bachelor of Engineering (B.E) in 12 Engineering Disciplines, Master of Technology in 5 specializations, Master of Computer Applications and Master of Business Administration degrees. Thirteen of its departments have been recognized as research centers and 12 departments have been accredited by National Board of Accreditation, New Delhi. It began offering courses from the academic year 1979-1980 and is affiliated to Visvesvaraya Technological University (VTU).<br><button class='chatbox__send--footer btnn' value='courses available'>courses available</button>"
        ],
        "context_set": ""
      },
      {
        "tag": "identity",
        "patterns": ["What is your name?", "What should I call you?", "Who are you?"],
        "responses": ["You can call me Mind Reader. I'm a Chatbot."]
      },
      {
        "tag": "Creator",
        "patterns": [
          "Who created you?", "Who is your developer?", "Who made you?"
        ],
        "responses": [
         "I was created by ...."
        ],
        "context_set": ""
      },
      {
        "tag": "funny",
        "patterns": [
          "Tell me a joke!",
          "Tell me something funny!",
          "Do you know a joke?"
        ],
        "responses": [
          "Why did the hipster burn his mouth? He drank the coffee before it was cool.",
          "What did the buffalo say when his son left for college? Bison."
        ],
        "context_set": ""
      },
      {
        "tag": "hours",
        "patterns": ["What are the college timings?", "When is the college open?", "What are your hours of operation?"],
        "responses": ["The college is open from 8am to 5pm, Monday to Saturday."],
        "context_set": ""
      },
      {
        "tag": "contact",
        "patterns": ["How can I contact the college?", "What is the college telephone number?", "Can I get your contact number?"],
        "responses": ["You can contact the college at 08192 - 22326."],
        "context_set": ""
      },
      {
        "tag": "admission",
        "patterns": ["Admissions","Admission","admission"],
        "responses": ["Eligibility for Admission to B.E.Course:<br> A pass in II PUC/Intermediate/10+2 or any other equivalent examination with Physics and Mathematics as compulsory subjects along with Chemistry/Bio-Technology/Computer Science/Biology/Electronics as optional subjects with English as one of the languages of study with an minimum aggregate of 45% marks in the optional subjects <br><button class='chatbox__send--footer btnn' value='Under Graduate'>Under Graduate</button><button class='chatbox__send--footer btnn' value='Post Graduate'>Post Graduation</button> <button class='btnn'><a href='https://docs.google.com/forms/d/e/1FAIpQLSdo16NrHcNMSPoT1TeYpubRMNlvMD9KzH87jVTJ-4jIa-LOnw/viewform'><i>Admission Enquiry</i></a></button> <button class='btnn'><a href='https://www.bietdvg.edu/ug_addmission'><i>Fee Structure</i></a></button> <button class='btnn'><a href='https://www.bietdvg.edu/ug_addmission'><i>Scholarships</i></a></button> <button class='btnn'><a href='https://www.bietdvg.edu/ug_addmission'><i>Contact</i></a></button>"]
      },
      {
        "tag": "Under Graduate",
        "patterns": ["Under Graduate"],
        "responses": ["The college offers 13 different Under Graduate(UG) courses in <br>Information Technology<br>Computer Science and Engineering<br>Mechanical Engineering<br>Chemical Engineering<br>Civil Engineering<br>Electrical and Electronics<br>Electronics and Communication Engineering <br>Textile Technology<br> Bio-Technology<br> Computer Science and Business Systems<br> Computer Science and Design <br>Artificial Intelligence and Machine Learning<br>Computer Science and Engineering (Data Science)<br>"]
      },
      {
        "tag": "Post Graduate",
        "patterns": ["Post Graduate"],
        "responses": ["The college offers 4 different Post Graduate(UG) courses in <br>M.Tech Structural Engineering<br>M.Tech Environmental Engineering<br>M.C.A.<br>IoT & Sensor Systems"]
      },
      {
        "tag": "courses",
        "patterns": ["branches","departments","courses","courses available","What courses are offered in the college?", "Can you tell me about the available courses?", "What are the branches in the college?","Available Departments"],
        "responses": ["The college offers 13 different Under Graduate(UG) courses in <br>Information Technology<br>Computer Science and Engineering<br>Mechanical Engineering<br>Chemical Engineering<br>Civil Engineering<br>Electrical and Electronics<br>Electronics and Communication Engineering <br>Textile Technology<br> Bio-Technology<br> Computer Science and Business Systems<br> Computer Science and Design <br>Artificial Intelligence and Machine Learning<br>Computer Science and Engineering (Data Science)<br><br>The college offers 4 different Post Graduate(UG) courses in <br>M.Tech Structural Engineering<br>M.Tech Environmental Engineering<br>M.C.A.<br>IoT & Sensor Systems"]
      },
      {
        "tag": "fees",
        "patterns": ["How much is the college fee?", "Tell me about the fees", "What are the hostel fees?","fee deatils"],
        "responses": ["For detailed fee information, please visit our college website or <a href='https://www.bietdvg.edu/admission/fee_structure'><i><u>Click here</u></i></a>"],
        "context_set": ""
      },
      {
        "tag": "location",
        "patterns": ["Where is the college located?", "What is the college address?", "How can I reach the college?","Address of Biet","Biet Address"],
        "responses": ["Bapuji Institute of Engineering and Technology is located at Shamanur Road, Davangere, Karnataka 577004. You can find the location on <a href='https://www.bing.com/maps?osid=882f672f-589c-4968-a97d-f6fd4cc718cc&cp=14.444605~75.896566&lvl=16&imgid=9b133292-fcfe-4eb6-813a-a72fb307dcc2&v=2&sV=2&form=S00027'><i><u>Google Map</u></i></a>"],
        "context_set": ""
      },
      
      {
        "tag": "professors_teachers",
        "patterns": ["Are your professors good teachers?", "How is the quality of teaching at your college?", "Do you have experienced faculty?"],
        "responses": ["Our college prides itself on having experienced and dedicated faculty members who are committed to providing quality education."],
        "context_set": ""
      },
      
      {
        "tag": "computer_labs",
        "patterns": ["Are there enough computer labs?", "How accessible are the computer labs?", "Is there a shortage of computer lab facilities?"],
        "responses": ["Our college provides an ample number of computer labs across campus. These labs are accessible to students and equipped with the necessary technology and software needed for academic work."],
        "context_set": ""
      },
      {
        "tag": "campus_wifi",
        "patterns": ["How is the WiFi on campus?", "Is the campus WiFi reliable?", "Are there any connectivity issues with the WiFi?"],
        "responses": ["The campus WiFi network is designed to provide reliable internet connectivity to students, faculty, and staff. However, occasional connectivity issues may arise, which are usually promptly addressed by the IT department."],
        "context_set": ""
      },
      {
        "tag": "sports_popularity",
        "patterns": ["Are sports popular?", "Do many students participate in sports?", "What's the athletic culture like at your college?"],
        "responses": ["Sports are popular at our college, and many students participate in various athletic activities. We have a range of sports teams, intramural sports, and fitness programs to cater to different interests and skill levels."],
        "context_set": ""
      }
    ]
  }
  